[
{"title": "D", "location": "\n              Redmond, WA\n            ", "company_name": "\n                Aditi Consulting\n              ", "position_name": "Data Scientist", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong><u>Job Details:</u></strong></p><p><strong>Title: </strong>Data Scientist</p><p><strong>Location:</strong> Remote</p><p><strong>Duration: </strong>6 Months Contract (Only on W2)</p><p> </p><p><strong><u>Required Skills:</u></strong></p><p>· 3-5 years of experience</p><p>· Apply knowledge of machine learning techniques and concepts, including the design and implementation of advanced artificial intelligence, computational algorithms, and data science techniques.</p><p>· Participate in and lead the running of experiments and documentation of results in technical or research whitepapers.</p><p>· Communicates data findings to both business and IT leaders to influence how an organization approaches and meets business challenges of an evolving customer base and changing marketplace, using strong business acumen.</p><p>· Collaborates with database engineers and other scientists to develop, refine, and scale data management and analytics procedures, systems, workflows, best practices, and other issues.</p><p>· Conduct statistical modeling and experiment design, test and validate predictive models.</p><p>· Conducts scalable data research, on and off the cloud.</p><p>· Develop custom algorithms to solve analytical problems with data sets.</p><p>· Implement automated processes for scaling models.</p><p>· Build and maintain data pipelines.</p><p> </p><p><strong><u>Must have Skillsets:</u></strong></p><p>· Adobe analytics &amp; SQL - 4 to 5 years experience</p><p><br></p><p><strong><u>REQUIREMENTS:</u></strong></p><ul><li>3-5 years of experience</li><li>Apply knowledge of machine learning techniques and concepts, including the design and implementation of advanced artificial intelligence, computational algorithms, and data science techniques.</li><li>Participate in and lead the running of experiments and documentation of results in technical or research whitepapers.</li><li>Communicates data findings to both business and IT leaders to influence how an organization approaches and meets business challenges of an evolving customer base and changing marketplace, using strong business acumen.</li><li>Collaborates with database engineers and other scientists to develop, refine, and scale data management and analytics procedures, systems, workflows, best practices, and other issues.</li><li>Conduct statistical modeling and experiment design, test and validate predictive models.</li><li>Conducts scalable data research, on and off the cloud.</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3468551283"},
{"title": "M", "location": "\n              United States\n            ", "company_name": "\n                InterEx Group\n              ", "position_name": "Machine Learning Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>Our client is a Fortune 500. The ideal candidate's favourite words are learning, data, scale, and agility. You will leverage your strong collaboration skills and ability to extract valuable insights from highly complex data sets to ask the right questions and find the correct answers.</p><p><br></p><p><u>Responsibilities</u></p><ul><li>Analyze raw data: assessing quality, cleansing and structuring for downstream processing</li><li>Design accurate and scalable prediction algorithms</li><li>You will be collaborating closely with our Data Science org</li><li>Collaborating with the engineering team to bring analytical prototypes to production</li><li>Generate actionable insights for business improvements</li></ul><p><br></p><p><u>Qualifications</u></p><ul><li>Bachelor's degree or equivalent experience in a quantitative field (Statistics, Mathematics, Computer Science, Engineering, etc.)</li><li>At least 4 years' of experience in quantitative analytics or data modelling</li><li>Deep understanding of predictive modelling, machine learning, clustering and classification techniques, and algorithms</li><li>Fluency in a programming language (Python, C,C++, Java, SQL)</li><li>Familiarity with Big Data frameworks and visualization tools (Cassandra, Hadoop, Spark, Tableau)</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3476847767"},
{"title": "D", "location": "\n              Missouri, United States\n            ", "company_name": "\n                Envision\n              ", "position_name": "Data Scientist", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting and Biotechnology Research\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>***W2 Candidates Only***</p><p><br></p><ul><li>MS Computer Science, Engineering, Technology, Mathematics, Statistics, or related field with 3+ years of industry experience or BS + 5 years' experience </li><li>Hands on coding experience with Python building end-to-end systems as an MLOps Engineer, Machine Learning Engineer, Software Engineer, or equivalent </li><li>Experience in ML model development, orchestration, deployment, monitoring, support and creating and maintaining deployment pipelines with CI/CD tools </li><li>Experience with cloud computing platforms like AWS, GCP, or other cloud providers developing with containers (e.g., Docker, Kubernetes) in cloud computing environments </li></ul><p><br></p><p>***W2 Candidates Only***</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3477350784"},
{"title": "D", "location": "\n              United States\n            ", "company_name": "\n                US Tech Solutions\n              ", "position_name": "Data Scientist - Customer Analytics", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting, Banking, and Accounting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Title: Data Scientist - Customer Analytics</strong></p><p><strong>Location: Remote(CST)</strong></p><p><strong>W2 Contract</strong></p><p><strong>Job Description:</strong></p><p>The primary responsibilities of this role, Data Scientist – customer analytics are to:</p><p> Develop &amp; Deliver:</p><p>· Deliver best-in-class analytics solutions for the customer-centric commercial operations of client. Topics include but not limited to: customer analytics, segmentation analysis, predictive cross-sell, churn prediction, and agronomic recommendation. Results will drive business decisions and significant revenue.</p><p>· Develop practical, interpretable, and automated solutions for these business problems through expertise in feature engineering, statistical analysis, predictive modeling (classification and regression), simulation, and optimization methodology by working in a highly interactive, team-oriented environment.</p><p>· Write model documentation to detail problem formulation, modeling approach, validation, data requirements and implementation steps.</p><p>· Support stakeholder requests for model development, implementation, and feature improvements, be able to communicate results to a broad range of audience in a clear, interpretable manner.</p><p>· Research new and innovative technical methodologies to support enhancement and expansion of existing work.</p><p>Collaborate &amp; Communicate:</p><p>· Work closely with research data science teams and business partners to break down complex business problems, gather requirements to build feasible solutions that are impactful, accurate and validated.</p><p>· Collaborate with system integration and data warehouse engineers on data extraction and data cleaning (ETL).</p><p>· Be creative, resourceful, detail-oriented, able to take initiatives and exercise critical thinking when it comes to problem solving.</p><p>· Be a proactive member of a global data science team to adopt and advocate for coding best practice and documentation.</p><p>Required Qualifications:</p><p>· Bachelor’s degree with at least 4 + of experience, Master’s degree with 2+ years of experience or a PhD in one of the following areas: Data Science, Economics, Electrical/Industrial Engineering, Applied Mathematics, Statistics, Computer Science or Any other discipline with strong quantitative skills or research experience.</p><p>· Applied experience conducting statistical inferences, time-series analysis, statistical simulation, analysis and building machine learning models using disparate sources of data.</p><p>· Advanced programming skills in R or Python or both employing object-oriented programming, good programming practices, use of IDEs, adherence to code style and good documentation for machine-learning tasks, working knowledge of version-control tools (such as git and git workflows including CLI).</p><p>· Passionate about data driven story telling using data visualization tools and appropriate supporting media (such as interactive dashboard, presentation slides, research report)</p><p>· Excellent work ethic, and a strong desire to learn new skills for technical and professional growth.</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3477149100"},
{"title": "A", "location": "\n              Seattle, WA\n            ", "company_name": "\n                Xoriant\n              ", "position_name": "Azure ML/Data Scientist", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Required Candidate Skills and Experience: </strong></p><ul><li>Machine Learning - working with ML frameworks such as SKLearn or other ML libraries</li><li>BS or MS in Engineering, Math, Statistics, Analytics, or Finance</li><li>5-8+ years of experience working in a fast-paced environment as a data scientist.</li><li>Hands on experience with Azure.</li><li>Hands on experience with modeling, optimization, and simulation</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3477679595"},
{"title": "D", "location": "\n              Austin, TX\n            ", "company_name": "\n                Seven Hills Group Technologies Inc.\n              ", "position_name": "Data Visualization Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          Computer and Network Security\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <strong>Job Title: Data Visualization Engineer<br><br></strong><strong>Location: Austin, TX or Bay Area, CA. <br><br></strong><strong>Type: Contract/Fulltime<br><br></strong><strong>Mode: Hybrid <br><br></strong><strong><u>Job Description<br><br></u></strong><strong>Details of the application, and domain, as appropriate:<br></strong><ul><li>Responsible for delivering Executive dashboards end-to-end with actionable insights.</li><li>Be a storyteller who can show how to get business insights from the Dashboard.</li><li>Responsible for engaging Executives to gather requirements and use agile methodology to deliver dashboards.</li><li>Conduct deep analysis to discover actionable business insights to grow client business top line</li><li>Act as Coach/Mentor for other Enterprise BI developers and influence Visualization best practices</li><li>Develop analytics across different personas which include C-Level executives, product leaders and DevOps engineers.<br></li></ul><strong>Key responsibilities and expected \"output\":<br></strong><ul><li>Solve data and analytics problems using design thinking principles.</li><li>Deep knowledge and understanding of Sales, Marketing and Customer Success business domain.</li><li>Excellent oral and written communications skills and ability to interact with and present to all levels of management.</li><li>Self-starter with sharp decision-making skills, the ability to multitask, work independently and prioritize in a fast-paced and changing environment.<br></li></ul><strong>\"Required\" tech stack and other related details:<br></strong><ul><li>10+ yrs of experience in BI/UI/UX domain</li><li>5+ years of experience working with Tableau</li><li>Ability to create actionable dashboards, passionate about data and good data evangelist.</li><li>Strong experience in building dashboards in any of the BI Platforms</li><li>Should have experience in writing SQL queries to understand or build dashboards.<br></li></ul><strong>\"Good to have\" tech stack and other related details:<br><br></strong><strong>Any other information considered \"critical\" / \"Useful\":<br></strong><ul><li>Prior experience in high-tech and software industries is beneficial.</li><li>Prior experience in building cloud spend dashboards, unit economics, and marginal analysis dashboards is beneficial</li><li>Prior experience in working with google big query and tableau security is added advantage.</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3476245093"},
{"title": "U", "location": "\n              Syracuse, NY\n            ", "company_name": "\n                Modis\n              ", "position_name": "Usability Test Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>Akkodis is seeking a Usability Test Engineer for a Contract position with a client located in Syracuse, NY - (Remote 100%). Ideally looking for applicants to have a solid work experience in Usability Testing and Product Designing exp.</p><p><br></p><p>Pay Range: $45 - $48/hour on W2</p><p>Also, open for C2C candidates.</p><p><br></p><p>This role will provide recommendations to project teams for product/project design or requirement changes that arise from test data/results and reports into the Director of Continuous Improvement and Usability Test, R&amp;D.</p><p><br></p><p>What you'll be doing</p><p>Acts as a support team member of the cross-functional new product development teams.</p><p>Supports creation of user needs, claims and primary operating functions during the product requirements phase.</p><p>Supports the creation of a usability test plan with usability designers early in the product design life cycle.</p><p>Supports analysis of use errors and their potential impacts for teams to improve product and interface designs including leading multi-functional team discussions as required.</p><p>Supports designs and usability testing (formative and summative testing).</p><p>Tracks day-to-day status of project tasks, issues, and concerns.</p><p>Supports the development of standard work and processes for the Usability and Design Validation Test group and participates in pilot process and tool efforts.</p><p><br></p><p>What you'll bring</p><p>Bachelors degree in a technical subject area preferred.</p><p>2-4 years experience in product design, human subject testing preferred.</p><p>Detail oriented with strong organization and time management skills and the ability to multi-task across a diverse scope of responsibilities, projects and people.</p><p>Effective verbal and written communication skills; strong social skills; ability to facilitate and work effectively in diverse, multi-functional teams.</p><p>Comfortable with direct interaction with medical professionals in clinical environments.</p><p>Knowledge of Microsoft Word, Excel, and PowerPoint.</p><p>Continuous improvement / lean experience or interest desired.</p><p>Experience with SAP preferred.</p><p><br></p><p>Equal Opportunity Employer/Veterans/Disabled</p><p><br></p><p>Benefit offerings include medical, dental, vision, term life insurance, short-term disability insurance, additional voluntary benefits, commuter benefits, and a 401K plan. Our program provides employees the flexibility to choose the type of coverage that meets their individual needs. Available paid leave may include Paid Sick Leave, where required by law; any other paid leave required by Federal, State, or local law; and Holiday pays upon meeting eligibility criteria. </p><p><strong><em>Disclaimer:</em></strong><em> These benefit offerings do not apply to client-recruited jobs and jobs which are direct hires to a client.</em></p><p><em>To read our Candidate Privacy Information Statement, which explains how we will use your information, please visit https://www.modis.com/en-us/candidate-privacy/.</em></p><p><br></p><p><em>The Company will consider qualified applicants with arrest and conviction records.</em></p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3476267018"},
{"title": "F", "location": "\n              San Francisco, CA\n            ", "company_name": "\n                Motion Recruitment\n              ", "position_name": "Fullstack Engineer - Python & React - Remote", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          Staffing and Recruiting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        The company's major objective is to help clients improve their security by putting security best practices into effect, with a focus on prevention. They are rethinking how quickly consumers can maximize the value of their security investment by including an automation mindset and a methodological emphasis to help overcome any impediments that may stand in the way of improving security posture.<br><br>A Full Stack Engineer is needed for the Services Innovation Engineering Team to design, develop, test, and deploy highly scalable services and applications. We utilize tools like Python, Django, FastAPI, ReactJS, GraphQL, Docker, and Kubernetes while running on the Google Cloud Platform.<br><br><strong><u>Required Skills &amp; Experience<br></u></strong><ul><li>Javascript</li><li>React</li><li>GraphQL </li><li>Python</li><li>Django</li><li>GCP <br></li></ul>The Offer<br><br><strong><u>You Will Receive The Following Benefits<br></u></strong><ul><li>Medical, Dental, Vision Insurance </li><li>401K</li><li>PTO <br></li></ul>Applicants must be currently authorized to work in the US on a full-time basis now and in the future.<br><br><strong>Posted By:</strong> Bianca Lagamon\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3452898460"},
{"title": "L", "location": "\n              United States\n            ", "company_name": "\n                Revolution Technologies\n              ", "position_name": "Lead Data Scientist", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          Staffing and Recruiting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>RevUp Your Career as a Data Scientist</strong></p><p><strong> </strong></p><p><strong>Job Title:</strong> Lead Data Scientist</p><p><strong>Job Location: </strong>Remote </p><p><br></p><p><strong>Summary</strong></p><p>Revolution Technologies is hiring a Lead Data Scientist for our leading Technology client! Launch your career to the next level in the technology industry with this top-rated employer!</p><p><br></p><p><strong>Key Skills and Experience Required </strong></p><ol><li>Strong SQL and Python background</li><li>6 years of data development experience </li></ol><p><br></p><p><strong>Job Description</strong></p><ul><li>Identifies requirements, creates, validates, and distributes analyses to support strategic engineering initiatives for a nimble SaaS org where priorities can shift quickly.</li><li>Creates and manages data pipelines against first-party and third-party data sources to create infrastructure for analysis &amp; automation, leveraging industry standard version control best practices when working with peer developers.</li><li>Maintains and generates Python-based scripts, notebooks, API integrations, etc. to support data development processes. Automates these processes where possible.</li><li>Develops models and dashboards to measure and track performance and help with forecasting future performance based on data.</li></ul><p><br></p><p><strong> Qualifications</strong><em>:</em></p><ul><li>5-6 years of experience in an analytical/data science/data engineering role and a track record of successful application of diverse analytical approaches.</li><li>Strong SQL &amp; Python background.</li><li>Data development experience – specifically generating new data structures from existing sources for the purposes of analysis.</li><li>Demonstrated experience of data pipeline development to support automation.</li><li>Experience with version control tools and systems (Git, Bitbucket).</li></ul><p><br></p><p><br></p><p><br></p><p><strong>Why Revolution Technologies?</strong></p><p><strong> </strong></p><p><strong>About the company</strong></p><p><em>Revolution Technologies - Making a difference across the nation with premier consulting, staffing, and hiring services.</em></p><p>Revolution Technologies, founded in 1993, provides best-in-class services that make a positive difference in the lives of our clients <em>and</em> our talent. We provide strategic management consulting; ERP and EA consulting; staff augmentation, contract, and contingent staffing; contract-to-permanent and permanent placement; as well as payrolling, recruitment process outsourcing, and human resources advisement services.</p><p><br></p><p><strong>Let’s talk about benefits</strong></p><p>Revolution Technologies is proud to offer some of the best rates in the market. Revolution is also pleased to provide a comprehensive benefits package including medical, dental, vision, short term disability, access to a health savings account, tuition reimbursement, scholarship opportunities, 401k, life insurance, supplemental insurance, and paid time off.</p><p><strong> </strong></p><p><strong>Equal Opportunity Employer</strong></p><p>Revolution Technologies, LLC is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.</p><p><br></p><p><strong><em>Revolution Technologies: Turn to us!</em></strong></p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3475123003"},
{"title": "J", "location": "\n              United States\n            ", "company_name": "\n                Insight Global\n              ", "position_name": "Javascript Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          Pharmaceutical Manufacturing\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Location:</strong> Remote (EST hours)</p><p><strong>Duration:</strong> 9 month contract (possible extensions)</p><p><br></p><p><strong><span class=\"ql-cursor\"> </span>***Must be U.S. Citizen or Green Card***</strong></p><p><br></p><p><strong>Must Haves:</strong></p><ul><li>5+ years’ experience as a JavaScript developer (web/front-end development experience with complex applications (jQuery, html, etc))</li><li>Expert level knowledge in JavaScript and modern frameworks (Angular, React, Node.js)</li><li>4+ years of recent experience with Python</li><li>Experience with responsive web design &amp; responsive frameworks, ideally bootstrap</li><li>Experience developing web applications that utilize RESTful APIs</li><li>SQL database knowledge of schema design, optimization, query analysis</li></ul><p><br></p><p><strong>Day To Day:</strong></p><p>Insight Global is looking for a JavaScript developer to sit fully remote for a large pharmaceutical client. This developer will be joining the Research IT team and will be working closely with the current team to create an application that will allow for multiple clients (scientists) to concurrently expedite the drug discovery process. This application will track a certain area in research (what they are doing with mice) to give them a better idea of where it stands. Currently, the team is working on a prototype that will be ready in the beginning of March. This candidate will be spending 90% of their time fixing code and making it better as well as spending 10% of their time working on the backlog of requirements. In about 4 months the day to day will be flipped and instead they will be spending 90% of their time adding new requirements and only 10% will be fixing code. The ideal candidate needs to be very experienced in JavaScript and python.</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3467828146"},
{"title": "D", "location": "\n              Austin, Texas Metropolitan Area\n            ", "company_name": "\n                Allied Consultants, Inc.\n              ", "position_name": "Data Scientist", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Overview</strong></p><p>Allied Consultants, Inc. is an Austin-based firm which has for 31 years been a premier provider of technical and business professionals to clients in Texas. We are currently seeking an experienced <strong><u>Data Scientist</u></strong> to be a key resource on a technical services team.</p><p> </p><p>Allied Consultants offers its family of consultants excellent rates, a local support staff, and an attractive benefits package which includes medical insurance (Allied shares a percentage of the cost), life insurance, a matching 401(k) plan and a cafeteria plan.</p><p><br></p><p>Candidates selected for interview will be required to undergo criminal background checks and may be required to complete a drug screen in accordance with Federal and State Law. Offers of Employment are contingent on a successful background check</p><p><br></p><p>Allied Consultants is an equal opportunities employer.</p><p><br></p><p><strong>Responsibilities</strong></p><p>The Advanced Grid Technologies group with the client is looking for a passionate Data Scientist to join our innovation and technology driven team. This position joins a very skilled workgroup that works closely with Program Managers, Analysts, Project Coordinators, and other technical leads performing analysis, reporting, and strategy building utilizing a wide array of documented use-cases in areas like advanced metering, work management, and distributed energy resource integration. Amongst a host or varied tasks, the successful candidate will: Deep dive on existing and new system data sources, unearthing problems known and unknown; Develop performance dashboards for existing and emerging programs and grid technology projects; and provide prescriptive analytics on an ad hoc basis in a fast-paced environment. We are looking for an enthusiastic, flexible, and personable individual with an eye for detail and ability to work independently in a deadline driven environment; a data scientist with a strong desire to be part of a growing and high performing team.</p><ul><li>BS, MS, or PhD in a numerical analysis–related field of study (statistics, computer science, mathematics, computer engineering).</li><li>Minimum 2 years of professional experience conducting data science projects in a professional or research environment.</li><li>Prior experience leading projects from conception to completion including iteration and QA concepts.</li><li>Proficiency and demonstrated experience in all phases of the data science life cycle working with real-world data—data compilation, data exploration, feature selection and engineering, training and testing of statistical or ML models, and communication of results.</li><li>Proficiency in R or Python, ability to craft complex queries and analysis using SQL.</li><li>Experience building reporting and analytics dashboards in Tableau or related visualization platform.</li></ul><p><br></p><p><strong>Qualifications</strong></p><p><strong>Minimum (Required)</strong></p><ul><li>4-7 years of professional experience as a data analyst, developer, or data scientist.</li><li>4-7 years of professional experience creating statistical or machine models to execute forecasting based on disparate and unfamiliar datasets.</li><li>4-7 years of coding and release experience using bash, Python, and/or other common languages.</li><li>4-7 years of building dashboard and reporting suites keeping stakeholders and consumers in mind through the design and iteration phases.</li></ul><p><br></p><p><strong>Preferred (Optional)</strong></p><ul><li>3 years experience working with, analyzing, and testing deeper analytical hypothesis using utility or energy- related data sets.</li><li>3 years of working within a cloud infrastructure, confidence to be own DevOps support alongside other experts.</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3469869907"},
{"title": "M", "location": "\n              United States\n            ", "company_name": "\n                Cygnus Professionals Inc.\n              ", "position_name": "MLops engineer with GCP and Computer Vision experience", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Role - MLops engineer with GCP and Computer Vision experience</strong></p><p><strong>Location - Remote</strong></p><p><strong>Job Type: Contract</strong></p><p><br></p><p><strong>Job Description:</strong></p><p><br></p><ul><li>Proficient in Python Programming</li><li>Understanding of MLOps, Model development lifecycle with knowledge of Training and Deployment pipelines for Machine Learning solutions.</li><li>Experience in building low latency systems/embedded systems, streaming, mobile app dev is important (key for this position)</li><li>Very good understanding about one or more container orchestration frameworks (KubeFlow etc.)</li><li>Exposure to Google Cloud Tech (GCS, BQ, Dataflow, Pub/Sub, GKE, VertexAI/KF Pipeline, etc.)</li><li>Knowledge of Git and Github. Gitops, Bazel and CI/CD deployments with Jenkins</li><li>Exposure to IaC (Terraform)</li><li>Familiar with AI\\\\ML Models and its basics</li><li>Experience working as one or more of the following DevOps Engineer, SRE, Platform Engineer, Infrastructure Engineer, Cloud Engineer, and/or Production Engineer.</li></ul><p></p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3475664039"},
{"title": "P", "location": "\n              United States\n            ", "company_name": "\n                Maxonic\n              ", "position_name": "Python Developer with AWS", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>Our direct client is a leading software development company. We are looking for -</p><p><br></p><p><strong>Position:</strong> Python AWS Developer (AWS + JavaScript/ Node.js + Microservices + Java/Python)</p><p><strong>Location:</strong> 100% Remote</p><p><strong>Duration: </strong>6 to 12 months</p><p><br></p><p><u>Requirements</u></p><ul><li>Strong AWS and ideally Node.js/JavaScript.</li><li><strong>Primarily skills for AWS:</strong> AWS Lambda, SQS, mainly AWS serverless technologies.</li><li>Build integrations / middleware between their apps in AWS using Node.js.</li><li>Microservices development (preferred)</li><li>Ideally a Python backend developers interested in using JavaScript/Node.js.</li></ul><p><br></p><p><strong><u>RESPONSIBILITIES</u></strong></p><ul><li>Create, improve and maintain software components utilizing appropriate software language(s) while applying the necessary engineering theory and logic to meet overall project requirements.</li><li>Assist in the coordination of component changes with related elements to ensure seamless flow and continuity.</li><li>Assists others in owned components and other fundamental expertise areas.</li><li>Lead the development, implementation, and testing tasks in different development projects.</li><li>tied to systems and functionality.</li><li>Manage the documentation creation and updates related to any development tasks.</li><li>Support and troubleshoot issues relating to custom development that have been created via</li><li>the Helpdesk system with a high level of customer satisfaction and in a timely manner</li><li>Create different conﬁguration &amp; infrastructure environments in a development lab to</li><li>troubleshoot issues and offer possible solutions.</li><li>Maintain connections between core business systems.</li><li>Communicate and coordinate with other functional teams across the enterprise on both design decisions and troubleshooting.</li><li>Any other task or projects as assigned.</li></ul><p><br></p><p><strong>About Maxonic:</strong></p><p>Since 2002 Maxonic has been at the forefront of connecting candidate strengths to client challenges. Our award-winning, dedicated team of recruiting professionals are specialized by technology, are great listeners, and will seek to find a position that meets the long term career needs of our candidates. We take pride in the over 5,000 candidates that we have placed, and the repeat business that we earn from our satisfied clients.</p><p><br></p><p><strong>Interested in Applying?</strong></p><p>We can’t wait to see your resume! Please apply below with your most current resume and anything else you’d like us to know about you – commute preferences, desired work environments, etc. You should also feel free to email (Saurav@maxonic.com) or call (408) 400 2332.</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3467854281"},
{"title": "S", "location": "\n              United States\n            ", "company_name": "\n                Burtch Works\n              ", "position_name": "Sr Machine Learning Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering\n          ", "company_sector": "\n          Software Development\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>Senior Machine Learning Engineer</p><p><br></p><p>As a Senior Machine Learning Engineer, you will develop cutting-edge algorithms and</p><p>production machine learning systems for consumer product innovations. You will work with</p><p>design and engineering teams to create intelligent workflows on the platform. Your</p><p>work will translate into new products on the shelf, and ultimately it will benefit millions of</p><p>people’s lives.</p><p><br></p><p>You will:</p><p>● Research, prototype and productionize state-of-the-art machine learning algorithms and</p><p>systems in AI platform.</p><p>● Work on probabilistic graphical models, bayesian inference, optimization, explainable AI</p><p>and causal inference.</p><p>● Automate data analysis, data visualization and build data pipelines.</p><p>● Build and maintain the infrastructure for data and model management.</p><p>● Collaborate with product, engineering and design teams to build intuitive workflows for</p><p>consumer product innovation.</p><p>You are a good fit if you:</p><p><br></p><p>● Have 5+ years of professional experience in machine learning or have a Ph.D. in</p><p>Computer Science, Statistics, Mathematics, or Physics.</p><p>● Have experience in probabilistic graphical models, bayesian inference and optimization.</p><p>● Are proficient with Python and R.</p><p>● Have experience with Python data science stack (e.g., SciPy, NumPy, Pandas, PyTorch).</p><p>● Have demonstrated end-to-end ownership of projects.</p><p>● Have worked in a fast-paced team environment.</p><p>● Can communicate proactively and effectively.</p><p>● (Bonus) Have experience with deep learning, especially transformers and graphical</p><p>neural networks.</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3184133160"},
{"title": "J", "location": "\n              Phoenix, AZ\n            ", "company_name": "\n                ABCS, Inc.  IT Executive and Contingent Workforce Staffing\n              ", "position_name": "Javascript Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology, Analyst, and Engineering\n          ", "company_sector": "\n          Banking, Insurance, and Financial Services\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>FullStack Engineer (React, Node.js, AWS, Agile)</strong></p><p><strong>12 to 24-month contract to hire</strong></p><p><strong>100% Remote</strong></p><p><strong>Phoenix, AZ</strong></p><p><strong>$70 - $85 Per hour on W2</strong></p><p><br></p><p><strong>Key technologies: React, Node.js, AWS, Agile (Must Have)</strong></p><p><strong>Responsibilities</strong></p><ul><li>Serves as a lead software engineering resource on the Digital Engineering team while building next generation of customer-facing web &amp; mobile applications.</li><li>Leads the design, delivery and maintenance of large-scale and complex software applications within a specific technology or application area.</li><li>Works with stakeholders to design and deliver clear, pragmatic solutions with applicability to meet immediate business needs.</li><li>Develops clear and complete design artifacts as needed to illustrate Digital Engineering technology.</li><li>Advises teams during design sessions, implementation planning, code reviews and troubleshooting for all Digital applications.</li><li>Understands and communicates tradeoffs between usability and performance needs.</li><li>Stays up-to-date on new technologies and methodologies, and continuously seeks opportunities to expand skills and knowledge.</li><li>Collaborates with Leads and Architects to establish a technical vision for various projects and experiences.</li><li>Proactively identifies opportunities and proposes solutions that improve the team’s software, making it better and easier to maintain.</li><li>Is an integral voice in establishing and evangelizing DevOps practices to optimize team's efficiency.</li><li>Participates in recruiting, hiring and mentoring exceptional software engineering talent.</li><li>Works closely with other functional teams including Integrations, Policy Administration, Claim Administration, and Product to solve complex integration challenges.</li><li>Ensures that technical solutions are aligned with Enterprise Architecture and applications and systems are built for uninterrupted availability, meet performance requirements, future extensibility, multiple system integrations, long-term growth and low-maintenance support.</li><li>Mentors and coaches more junior Engineers.</li></ul><p><br></p><p>Skills, Knowledge and Experience</p><ul><li>5+ years' successful professional experience in the design, delivery, and support of complex projects across web platforms &amp; mobile applications.</li><li>2+ years' deep and direct hands-on experience with the specific technologies used in the teams systems/solutions.</li><li>Experience working in an Agile delivery environment.</li><li>Ability to adapt quickly to changing priorities, assignments, deliverables, and timelines.</li><li>Ability to develop technical solutions based on requirements from product, technology, and support teams.</li><li>Ability to work with onshore/offshore teams, and comfortable working in a virtual environment.</li><li>Ability to participate in the interview process and help your team train and mentor interns and apprentices.</li><li>Experience using unit testing frameworks.</li><li>Experience using code analysis tools such as PMD, Checkstyle, Findbugs, and Sonar.</li><li>Experience building and consuming RESTful web services.</li><li>Experience with fully automated QA (TDD, BDD, Performance, Security, Integration/Compatibility, Regression, and Functional Testing), API-Driven Development and systems design, Engineering Best-Practices, Designing/Developing in a cloud-based environment.</li><li>Experience supporting complex systems with significant integration points and external third-party systems through APIs.</li><li>Strong customer relationship, interpersonal, analytical, and problem-solving skills.</li><li>Outstanding oral, written, presentation and listening communication skills.</li><li>Effective decision-making skills, even under pressure and while lacking all of the desired detail.</li><li>Deep understanding of Object-oriented design principles and other design patterns (e.g. MVC, serverless, etc.).</li><li>Experience with performance optimization techniques.</li><li>Experience deploying to cloud platforms such as AWS.</li><li>Demonstrated mastery of software development best practices, including code standards, code reviews, source control management, build processes, testing, and operations.</li><li>Working experience of Cloud architectures, services, and DevOps practices within AWS.</li><li>Understanding of front-end technologies including experience with React, Typescript, and Node.js.</li><li>Experience with open source user authentication tools and methods.</li><li>Experience with log management and user monitoring tools.</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3443981315"},
{"title": "S", "location": "\n              New York, United States\n            ", "company_name": "\n                InterEx Group\n              ", "position_name": "Senior Machine Learning Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          Staffing and Recruiting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong><u>Senior Role</u></strong></p><p><br></p><p>The ideal candidate's favourite words are learning, data, scale, and agility. You will leverage your strong collaboration skills and ability to extract valuable insights from highly complex data sets to ask the right questions and find the correct answers.</p><p><br></p><p><strong>Responsibilities</strong></p><ul><li>Analyze raw data: assessing quality, cleansing, and structuring for downstream processing</li><li>Design accurate and scalable prediction algorithms</li><li>Collaborate with the engineering team to bring analytical prototypes to production</li><li>Generate actionable insights for business improvements</li></ul><p><br></p><p><strong>Qualifications</strong></p><ul><li>Bachelor's degree or equivalent experience in a quantitive field (Statistics, Mathematics, Computer Science, Engineering, etc.)</li><li>At least 4 years of experience in quantitative analytics or data modelling</li><li>Deep understanding of predictive modelling, machine-learning, clustering and classification techniques, and algorithms</li><li>Fluency in a programming language (Python, CC++, Java, SQL)</li><li>Familiarity with Big Data frameworks and visualization tools (Cassandra, Hadoop, Spark, Tableau)</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3476849156"},
{"title": "A", "location": "\n              United States\n            ", "company_name": "\n                University of California, Los Angeles\n              ", "position_name": "Application Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Must Haves: </strong></p><ul><li>5+ years of software engineering experience with C#/.Net</li><li>Experience designing and developing secure, RESTful APIs</li><li>JSON schema and serialization</li><li>Experience with Angular and Typescript for front-end development</li><li>Experience with AWS cloud services (ECS, ECR, Lambdas, S3, etc.)</li></ul><p><strong>Plusses: </strong></p><ul><li>Bachelor’s degree in Computer Science, Engineering, or Information Systems</li></ul><p><strong>Day to Day:</strong></p><p>Our client is looking for a Software Engineer to join their Financial Transformation Program. This Engineer will be responsible for working with business users, developers, and leads to deliver quality financial applications for the campus. This person will participate in the development of project plans, detailing application requirements, maintain existing programs, and unit, system, and functional testing. This Engineer will also be responsible for designing, coding, and validating application development as well.</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3468545199"},
{"title": "C", "location": "\n              United States\n            ", "company_name": "\n                MATRIX Resources\n              ", "position_name": "Chatbot Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Job Title: Chatbot Product Manager</strong></p><p><strong>Contract Opportunity: 1-month</strong></p><p><strong>Location: Remote</strong></p><p><strong>Pay: Up to $65/hr </strong></p><p><br></p><p><strong>Position Summary:</strong></p><p>The Chatbot Developer position is a unique opportunity to assist thousands of members that interact with our services each day. We are looking for an individual with a strong blend of financial services and enterprise technology experience. Well-developed communication and collaboration skills will be critical to the success of this role, as well as an aptitude for data, language, and technology. This position is 100% remote, ideally based in Jacksonville, FL, however we are open to remote anywhere in the US for the ideal candidate.</p><p><br></p><p>Our ideal candidate will enjoy partnering with internal stakeholders to uncover critical business drivers and meet the needs of our varied lines of business. The Chatbot Developer leverages data and key insights to optimize member interactions for both members and our internal support team. This candidate must consistently drive actionable solutions for customer care, sales, quality, compliance, operations efficiency, and marketing groups. The Chatbot Developer plays a critical role in the continuous improvement of the customer engagement model and shares a commitment to delivering positive experiences around our evolving products and services. This role requires a passion to help our members thrive in their financial journey. To be successful in this role, you’ll need superior analytical skills, keen attention to detail, and a proven ability to deliver results in a fast-paced environment both individually and as part of a team.</p><p><br></p><p><br></p><p><strong>Responsibilities:</strong></p><ul><li>Implement chatbot flows</li><li>Recognize pertinent language patterns and conversational content that can lead to business value through product or operational improvements</li><li>Determine keywords and phrases to train our software to recognize to create successful member interactions</li><li>Review, calibrate, and validate the quality of data to verify analysis requirements in broadcasting the overall health of interactions across multiple products</li><li>Manage and maintain solutions libraries that can be used across multiple lines of business</li><li>Brainstorm value-added features and applications to further use our available technology</li></ul><p><br></p><p><br></p><p><strong>Required Skills:</strong></p><ul><li>Necessary extensive experience in B2C conversational English related to chatbots or with speech/text analytics solutions OR</li><li>Necessary experience with Contact Center business practices relevant to the appropriate products</li><li>Demonstrated strong analytical skills, adept at identifying patterns, and hypothesis-driven problem-solving</li><li>Exceptional written and oral communication skills related to communicating to cross-functional groups across key business areas</li><li>Positive attitude, empathy, and customer-focused communication skills are required for impact on interaction with customers</li><li>Innovative mindset, aptitude for learning new technologies / software and dexterity to adjust to changing priorities within a dynamic business</li><li>Ability to act independently and proactively address problems as a self-starter</li><li>Proven collaborative achievements in past roles</li><li>Ability to work effectively with product development, engineers, and business team</li><li>Bachelor's Degree in Business, Marketing, Communications, Statistics or other quantitative oriented fields or equivalent experience</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3471538108"},
{"title": "A", "location": "\n              United States\n            ", "company_name": "\n                MashPoint - Technology & Staffing\n              ", "position_name": "Advanced Software Engineer (13612422)", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          Staffing and Recruiting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <strong>Job Title: Advanced Software Engineer<br><br></strong><strong>Location: Remote<br><br></strong><strong>Duration: 6+MONTHS (With the Possibility of extension)<br><br></strong><strong><u>Job Description<br><br></u></strong>One of our prestigious clients is currently seeking an Advanced Software Engineer in the Software Development department. The Advanced Software Engineer plays a critical role in the delivery of high-quality products to the healthcare industry. A successful candidate will be able to demonstrate all essential functions to effectively design and construct modern software systems utilizing diverse technology sets while working within and across cross-functional and geographically dispersed teams.<br><br>This position will be based out of the Indianapolis, IN office.<br><br><strong><u>Responsibilities<br></u></strong><ul><li>Responsible for the development, maintenance and integration of application software, and tier II support.</li><li>Codes, defines criteria, performs testing, debugging, and documents software functionality. </li><li>Understands and utilizes the methodologies, policies and procedures to support the use of inheriting objects and modifying base components to maximize development time and consistency. </li><li>Diagnoses and isolates application software problems; formulates and implements effective solutions considering system capacity, limitations, time requirements, and desired results in order to resolve system problems and prevent recurrence. </li><li>Estimates amount of work effort required to complete tasks. </li><li>Works closely with team members to understand IT business requirements that drive the analysis and design of technical solutions that are in compliance with architectural blueprints and business strategies. </li><li>Knowledge of software development life cycles and the activities that occur within life-cycles. </li><li>Performs other duties as assigned. <br></li></ul><strong><u>Required Skills<br></u></strong><ul><li>Agile Development Methods</li><li>Web Services Development </li><li>Web Application Development </li><li>Java JDK </li><li>Major Relational Database Development / Management </li><li>Microsoft Visual Studio </li><li>SQL Server Enterprise Tools </li><li>IntelliJ or other Java Development Tools <br></li></ul><strong><u>Preferred Skills<br></u></strong><ul><li>Very Strong Java development</li><li>Experience with Spring </li><li>Experience with Maven and/or Gradle </li><li>Strong written and verbal communication </li><li>Works well to collaborate with others within teams </li><li>Experience in Healthcare IT preferred <br></li></ul><strong><u>Required Experience<br></u></strong><ul><li>BS in Computer Science, Information Systems, or related field</li><li>2+ years of Software Development work experience</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3476612432"},
{"title": "S", "location": "\n              United States\n            ", "company_name": "\n                Insight Global\n              ", "position_name": "Sr. Data Scientist", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          Broadcast Media Production and Distribution and Entertainment Providers\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Position: </strong> Sr. Data Scientist</p><p><strong>Duration: 12 </strong>month + contract to possible hire</p><p>Location: <strong>100% Remote, Eastern Standard Time (EST)</strong></p><p><strong>W2 Candidates only, no c2c</strong></p><p><br></p><p><strong>Summary:</strong></p><p>A client is looking for a 100% remote Sr. Data Scientist for an entertainment based company. This application will provide ad sales projections and forecasting based off consumer engagement data to high level executives throughout the organization. This person will be working with both internal and external stakeholders to help build, maintain, and enhance the ad sales models using Python. Additionally, this person must be comfortable creating high level forecasting models using ARIMA modeling.</p><p><br></p><p>Building predictive analytic application for ad sales.</p><p><br></p><p><br></p><p><strong>Desired skills and experience:</strong></p><p>- 3 to 5 years experience as a Data Scientist</p><p>- Strong Python &amp; Machine Learning (supervised &amp; unsupervised) experience</p><p>- Ability to understand data distribution and anomalies: statistical analysis</p><p>- Experience with Time Series Forecasting, ARIMA Modeling</p><p>- Experience deploying your models into production</p><p>- Decision Tree methods</p><p><br></p><p>Preferred but not required:</p><p>- Masters Degree</p><p>- Ad-Sales or Ad-Tech Experience</p><p>- Experience with Nielsen Data</p><p>- Experience AWS Sagemaker</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3472342299"},
{"title": "S", "location": "\n              New York, United States\n            ", "company_name": "\n                InterEx Group\n              ", "position_name": "Sr Data Scientist", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology and Engineering\n          ", "company_sector": "\n          Staffing and Recruiting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>My client are a Global Retail Brand, with over 30,000 employees and just shy of $300 Billion in revenue for 2022.</p><p><br></p><p>I am currently working closely with their Vice President of Data and Analytics, he has recently joined the business to further grow out their Data Science and Machine Learning organization.</p><p><br></p><p>Data &amp; Analytics is a strategic focus area for the company currently and they are investing heavily.</p><p><br></p><p>They are currently searching for 1 Senior Data Scientist to drive the team and to support their organizations goals for the rest of 2022 and 2023.</p><p>Responsibilities</p><ul><li>Ability to run and prioritize multiple tracks of work, ensuring high-quality output on- time delivery</li><li>Identify and improve the execution of the full Analytics &amp; Data Science team</li><li>Proven experience building positive working relationships in cross-functional teams,</li><li>Collaborate with engineering team to bring analytical prototypes to production.</li><li>Expertise in in metric development, statistical analysis, and intuitive reporting.</li></ul><p><br></p><p><br></p><p>Qualifications</p><ul><li>Master’s or Bachelor's degree in Math, Statistics, Psychology, Economics, Computer Science, or similarly quantitative fields.</li><li>Applied Machine Learning experience (regression analysis, time series, probabilistic models, supervised, classification and/or unsupervised learning).</li><li>Strong skills in statistics/machine learning languages and packages such as Python, R, Azure ML.</li><li>2+ years Building Data Scientist models</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3431317441"},
{"title": "S", "location": "\n              United States\n            ", "company_name": "\n                Compunnel Inc.\n              ", "position_name": "Software Engineer in Test", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Customer Service, Business Development, and Sales\n          ", "company_sector": "\n          IT Services and IT Consulting, Consumer Services, and Business Consulting and Services\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>A Senior SDET Position open in my team, we are looking for Strong Coding skills with good understanding of Core Java, Cucumber, Selenium , Rest Assured, and AWS.</p><p> Finra</p><p>please find below job description</p><p><br></p><p> </p><p>Job Description :</p><ol><li>Under minimal supervision, the Senior Developer in Test ensures quality of software products delivered within the software development life cycle. The Senior Developer in Test is responsible for developing and executing software testing components, developing automation solutions, and performing manual tests as needed throughout the SDLC.</li><li>Independently design and build framework and implement</li><li>Responsible for identifying project risks and develop mitigation strategies.</li><li>Develop automation architecture and set up test frameworks/infrastructure.</li><li>Actively participate in collaborative resolution of defects including root cause analysis of production incidents.</li><li>Continually look for ways to innovate and improve testing process to gain efficiencies.</li><li>Demonstrates business domain expertise in the project involved.</li><li>Ensure compliance with FINRA technology policies and standards .</li><li>Independently create, build, and execute test plans and strategy for complex test cases</li><li>Participate in reviews of system architecture, code, and design documents.</li><li>Perform Independent Assurance on all SDLC phases in a project.</li><li>Design and develop complex automation code, scripts, utilities, simulators, data generators, API/Interface testing solutions and other programmatic test tools as required to execute tests.</li><li>Effectively communicate testing activities, findings, and project risk in oral and written formats.</li><li>Supports or assists test lead to identify project risks and to develop mitigation strategies.</li><li>Perform product code reviews.</li><li>Mentor junior developers in test.</li></ol><p><strong>Other Responsibilities:</strong></p><ol><li>Additional responsibilities as needed.</li></ol><p> </p><p><strong>Education &amp; Experience Requirements:</strong></p><ol><li>Bachelor’s degree in computer science/engineering or STEM and 5 year of software development and/or test automation or the equivalent combination of training and experience, or master’s with 3 years' experience.</li><li>Thorough understanding in computer science fundamentals - algorithm design, problem solving, complexity analysis and data structures.</li><li>Experienced with modern programming languages and common development technologies with software architecture and design skills.</li><li>Deep understanding of programming languages such as Java, JavaScript, and Python</li><li>Thorough understanding of testing process, test types, test design and testing methodologies.</li><li>Experienced with functional or Performance or Security or DevOps test tools.</li><li>Experienced in architecting, designing, and developing automation frameworks and test suites.</li><li>Proficiency in any of the following tools: Cucumber, Selenium, Maven, Git, Junit, Jenkins, Splunk, Rest Assured.</li><li>Experienced with Cloud related technologies.</li><li>Experienced with Unix/Linux environment.</li><li>Self-directed, detail-oriented and have excellent written &amp; oral communication skills.</li></ol><p>Ability to work in a fast- paced environment</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3476937141"},
{"title": "M", "location": "\n              Austin, TX\n            ", "company_name": "\n                Wimmer Solutions\n              ", "position_name": "Machine Learning Ops Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          Machinery Manufacturing\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Machine Learning Ops Engineer- Remote</strong></p><p><strong>Client Location: Austin, TX</strong></p><p><strong>PLEASE READ- At this time we may only process US Citizens and Green Card Holders (Permanent Residence) no EAD</strong></p><p><strong>Must be able to work for a US based company without requiring visa sponsorship.</strong></p><p><br></p><p>We’re seeking a MLOps data Engineer specializing in data and cloud infrastructure to join our team. Our machine learning platform helps manage the various components of the ML application development life cycle, starting from data ingestion, annotation, exploration to model training, deployment, and monitoring. All these components are interdisciplinary, so you will be working closely with roboticists, ML researchers and Safety &amp; Perception teams.</p><p>A well-qualified candidate for this position will be a problem-solver who is capable of exhibiting deftness to handle multiple simultaneous competing priorities and deliver solutions in a timely manner. You like to automate anything which you do, and you document it for the benefit of others. The candidate should be adept at prioritizing multiple issues and have strong expertise in troubleshooting complex production issues.</p><p><br></p><p>WHAT YOU GET TO DO</p><p>• Monitor, investigate and fix issues of data ingestion and training pipeline as L1 support.</p><p>• Identify patterns of data ingestion and pipeline issues, propose short- and long-term solutions and actively participate in developing the solutions.</p><p>• Provide data and infra support to internal Jupiter teams and work collaboratively with other developers in Jackson, IT and Platform team to figure out a resolution.</p><p>• Provide guidance to improve the stability, security, efficiency, and scalability of systems.</p><p>• Help improve our code quality through writing unit tests, automation and performing code reviews.</p><p>WHAT YOU BRING</p><p>• A BSc. or MSc. degree in Computer Science / Software engineering is required.</p><p>• 3+ years of professional backend software development experience.</p><p>• Experience in supporting highly scalable data systems and services written in Python.</p><p>• Strong communication skills and ability to work effectively across multiple technical teams.</p><p>• Experience building ETL workflows and Data Warehouse solutions.</p><p>• Solid understanding of relational and non-relational database systems</p><p>• Experience with Docker, CI/CD build systems like Jenkins/Team city, AWS services like S3, DynamoDB, EC2, ECR, lambda, SQS, SNS etc.</p><p>• Have a passion for automation by creating tools using Python.</p><p>• Bachelor's Degree or higher in Computer Science, Math, or another quantitative field</p><p>• Bonus points if you have expertise in migrating, supporting the applications on Kubernetes &amp; services on third party clouds.</p><p>• Bonus points if you have experience with Cloud workflow platforms such as Kubeflow.</p><p>• Bonus points if you have familiarity with ML Frameworks such as TensorFlow, PyTorch.</p><p>• Bonus points if you have experience in Infrastructure templating tools like Terraform or CloudFormation.</p><p><br></p><p><strong>Must be able to work for a US based company without requiring visa sponsorship.</strong></p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3348098378"},
{"title": "S", "location": "\n              Durham, NC\n            ", "company_name": "\n                Vector Technologies LLC\n              ", "position_name": "Senior Machine Learning Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          Financial Services\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        Title: Senior Machine Learning Engineer<br><br>Location: Hybrid from Durham, NC, or RI, NH, TX, NJ, MA, UT<br><br>Duration: 12+ Months<br><br>**No H1b, OPT, CPT**<br><br><strong><u>Required Experience And Skills<br></u></strong><ul><li>Bachelor's or Master's Degree in a technology related field (e.g. Engineering, Computer Science, etc.)</li><li>10+ years of proven experience in implementing Big data solutions in data analytics space</li><li>4+ years of experience in developing ML infrastructure and MLOps in the Cloud using AWS Sagemaker</li><li>Extensive experience working with machine learning models with respect to deployment, inference, tuning, and measurement required</li><li>Experience in Object Oriented Programming (Java, Scala, Python), SQL, Unix scripting or related programming languages and exposure to some of Python's ML ecosystem (numpy, panda, sklearn, tensorflow, etc.)</li><li>Experience with building data pipelines in getting the data required to build and evaluate ML models, using tools like Apache Spark or other distributed data processing frameworks</li><li>Data movement technologies (ETL/ELT), Messaging/Streaming Technologies (AWS SQS, Kinesis/Kafka), Relational and NoSQL databases (DynamoDB, EKS, Graph database), API and in-memory technologies</li><li>Strong knowledge of developing highly scalable distributed systems using Open-source technologies</li><li>Experience with CI/CD tools (e.g., Jenkins or equivalent), version control (Git), orchestration/DAGs tools (AWS Step Functions, Airflow, Luigi, Kubeflow, or equivalent)</li><li>Solid experience in Agile methodologies (Kanban and SCRUM)</li><li>Strong technical design and analysis skills</li><li>Ability to deal with ambiguity and work in fast paced environment</li><li>Experience supporting critical applications</li><li>Familiarity with applied data science methods, feature engineering and machine learning algorithms</li><li>Data wrangling experience with structured, semi-structured and unstructured data</li><li>Experience building ML infrastructure, with an eye towards software engineering</li><li>Excellent communication skills, both through written and verbal channels</li><li>Excellent collaboration skills to work with multiple teams in the organization</li><li>Ability to understand and adapt to changing business priorities and technology advancements in Big data and Data Science ecosystem<br></li></ul><strong><u>Project Details<br><br></u></strong>PI Data Engineering team (part of Personal Investing Technology BU) is focused on delivery data and ML solutions for the organization. As part of this team, you will be responsible for building advanced analytics solutions using various cloud technologies and collaborating with Data Scientists to robustly scale up ML Models to large volumes in production.<br><br><strong><u>Top Skills<br></u></strong><ul><li>10+ year of programming (3+ years in Python people who can write in Python) / Fast API or Flask</li><li>2+ years of AWS experience in the Engineering space (need to know the Ecosystem)</li><li>Clear communication skills.<br></li></ul><strong><u>NICE To Have Skills<br></u></strong><ul><li>Sagemaker<br></li></ul>**We are an Equal Opportunity Employer**<br><br>https://vectortechsol.com/jobs\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3473341847"},
{"title": "S", "location": "\n              New York, NY\n            ", "company_name": "\n                Burtch Works\n              ", "position_name": "Senior Machine Learning Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology, Engineering, and Research\n          ", "company_sector": "\n          IT Services and IT Consulting, Software Development, and Research Services\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Job Description: </strong></p><p><br></p><p><strong> </strong></p><p><strong>Senior Machine Learning Engineer</strong></p><p><br></p><p><strong> </strong></p><p><strong>At Turing Labs, we’re driven to build software that helps Consumer Packaged Goods (CPG)</strong></p><p><strong>companies create products that are safer, smarter, and leaner. Our platform uses data, AI, and</strong></p><p><strong>technology that enable CPG companies to develop new products 10x faster than the traditional</strong></p><p><strong>trial-and-error process.</strong></p><p><strong>As a Senior Machine Learning Engineer, you will develop cutting-edge algorithms and</strong></p><p><strong>production machine learning systems for consumer product innovations. You will work with</strong></p><p><strong>design and engineering teams to create intelligent workflows on the Turing Labs platform. Your</strong></p><p><strong>work will translate into new products on the shelf, and ultimately it will benefit millions of</strong></p><p><strong>people’s lives.</strong></p><p><br></p><p><strong> </strong></p><p><strong>You will:</strong></p><p><br></p><p><strong>● Research, prototype and productionize state-of-the-art machine learning algorithms and</strong></p><p><strong>systems in Turing Lab’s AI platform.</strong></p><p><strong>● Work on probabilistic graphical models, bayesian inference, optimization, explainable AI</strong></p><p><strong>and causal inference.</strong></p><p><strong>● Automate data analysis, data visualization and build data pipelines.</strong></p><p><strong>● Build and maintain the infrastructure for data and model management.</strong></p><p><strong>● Collaborate with product, engineering and design teams to build intuitive workflows for</strong></p><p><strong>consumer product innovation.</strong></p><p><br></p><p><br></p><p><strong>You are a good fit if you:</strong></p><p><br></p><p><strong> </strong></p><p><strong>● Have 5+ years of professional experience in machine learning or have a Ph.D. in</strong></p><p><strong>Computer Science, Statistics, Mathematics, or Physics.</strong></p><p><strong>● Have experience in probabilistic graphical models, bayesian inference and optimization.</strong></p><p><strong>● Are proficient with Python and R.</strong></p><p><strong>● Have experience with Python data science stack (e.g., SciPy, NumPy, Pandas, PyTorch).</strong></p><p><strong>● Have demonstrated end-to-end ownership of projects.</strong></p><p><strong>● Have worked in a fast-paced team environment.</strong></p><p><strong>● Can communicate proactively and effectively.</strong></p><p><strong>● (Bonus) Have experience with deep learning, especially transformers and graphical</strong></p><p><strong>neural networks.</strong></p><p><br></p><p><strong> </strong></p><p><strong>Perks</strong></p><p><strong><span class=\"ql-cursor\"> </span></strong></p><p><strong>● Competitive salary, bonus, and equity package.</strong></p><p><strong>● Work from home with unlimited vacation policy.</strong></p><p><strong>● Platinum level medical insurance 100% covered for individuals and 70% covered for</strong></p><p><strong>dependents.</strong></p><p><strong>● Dental and Vision insurance.</strong></p><p><strong>● 401k with 4% employer matching.</strong></p><p><strong>● $1,500 home office benefit.</strong></p><p><strong>● Reimbursement of home Internet.</strong></p><p><strong>● Professional growth education sponsorship.</strong></p><p><strong>● Mentorship program.</strong></p><p><strong>● Health and well-ness focused programs.</strong></p><p><strong>● Weekly virtual social events and annual company retreats.</strong></p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3472314248"},
{"title": "P", "location": "\n              United States\n            ", "company_name": "\n                Feuji Inc\n              ", "position_name": "Python Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Title: Python Developer </strong></p><p><strong>Duration: Very Long Term</strong></p><p><strong>Location: 100% Remote</strong></p><p><br></p><p><strong>Note: Only W2, No Corp - Corp</strong></p><p><strong> </strong></p><p><strong> </strong></p><p><strong>Job Description</strong></p><ol><li>Sound knowledge of B/E technology stack such as Python/Node.JS/Ruby/Java. </li><li>Practical understanding of HTML, CSS, and JavaScript. </li><li>Experience working on architectures involving one or more of the following concepts and their implementation: XML/JSON message processing, REST API, GraphQL, Object Relational Mapping, asynchronous web services and distributed message queues. </li><li>Growth mindset - motivated by experimentation, moving metrics and delivering an outstanding user experience </li><li>Experience working on scalable architecture which can handle high volumes of data required for building out of our cloud-based platform </li><li>Experience writing tests for written code (unit tests, regression tests, integration tests etc.) </li><li>Experience with SAS platform. </li><li>Quick learner and keen to learn new tools, languages, and technologies 8. Professional experience working with Django, React or Ember.js is preferred</li></ol><p><br></p><p><br></p><p><strong>Best regards,</strong></p><p><strong>Arun Sharma</strong></p><p><strong>Talent Acquisition Lead</strong> | <strong>Feuji, Inc</strong></p><p><strong>Direct: (972) 656-1798, 703-420-7916</strong>| arun.s@feuji.com</p><p>105 Decker court, Suite # 850, Irving, TX, 75062</p><p><strong>USA | Costa Rica | India</strong></p><p><strong>Core Values:</strong> Wow the customer | Simpler is better | Walk the talk | Spread the cheer | Pay it forward</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3478123082"},
{"title": "U", "location": "\n              United States\n            ", "company_name": "\n                Insight Global\n              ", "position_name": "UI Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Design\n          ", "company_sector": "\n          IT Services and IT Consulting and Government Administration\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Front End UI Engineer </strong></p><ul><li><span>Contract through September 2023</span></li><li>Interview process: informational phone screen, 60 minute take home assessment, one hour panel video interview</li><li>Target hourly pay $65-75hr </li></ul><p><strong><em>Unfortunately, this role cannot accommodate for C2C</em></strong></p><p><br></p><ul><li>Design and develop the front end User Interface component software for the enablement of this product with a Human Centered, design thinking focus.</li><li>Build front end components, integrate with the back end and server side software engineers, deploy outputs of the software services and machine learning outputs in a meaningful way to end users.</li><li>Apply strong front end UX/UI design best practices with Human Centered Design focus to the user interface creating a delightful, remarkable user experience and journey</li><li>Apply one or more of the following agile product management concepts: Customer Centricity, Design thinking, journey mapping, use of Personas to influence design of the user interface.</li><li>Working with the Senior Business Analyst, UX Designer, customers and development team members, use Empathy map canvases and journey maps, develop the customer journey on the user interface to create a unique, superior customer experience.</li><li>Conceptualize and build the front end applications and update and improve existing functionality</li><li>Develop the front end components with frameworks such as React and heavy use of D3. Enable the UI to support multiple browsers, and mobile use. Optimize the front end application for usability and speed.</li><li>Seamlessly integrate services health status and machine learning outputs providing a stellar end user experience</li><li>Ensure product is maintainable, scalable, solutions are forward thinking, and ensure the team follows SDLC and Software Engineering best practices,</li><li>Leverage expert level understanding of front-end application design using modern frameworks and UI development tools</li><li>Work with the Software Quality Lead engineer to help them devise a robust testing strategy using software quality best practices for all new and existing components to ensure defect free code quality, that function as per user story specifications</li><li>Create a culture of inclusion and teamwork through leading by example and always considering how their actions influence the broader team</li><li>Lead code quality review sessions with Junior developers and provide feedback and guidance</li><li>Support team leadership and team architect as required</li></ul><p><br></p><p><strong>What we’re looking for:</strong></p><ul><li>Strong background in UX/UI design a must. Someone passionate that obsesses about helping develop high quality, flawless UI experiences</li><li>Deep expertise with both UX/UI design and development a huge plus. However UX/UI development is a priority over UI/UX design skills.</li><li>Needs to demonstrate originality and innovation in UI design and user experience.</li></ul><p><br></p><p><strong> Minimum Education and Experience</strong></p><ul><li>Bachelor’s Degree in related field with a minimum of 8 years’ experience or equivalent combination of education, experience and/or certifications. </li></ul><p><br></p><p><strong>Required Skills:</strong></p><ul><li>Good interpersonal and communication skills. Ability to articulate thoughts clearly, crisp, clear communication. Critical thinking abilities.</li><li>JavaScript, NodeJS, ReactJS, Angular and other JavaScript frameworks and libraries</li><li>D3 - Expert, React/Redux, CSS, SCSS</li><li>Data Visualization, Section 508 compliance, Front end frameworks.</li><li>Creation of reusable components for API endpoint consumption</li><li>Knowledge of object-oriented design a plus to help with API design and integration with the server-side components</li><li>Front end frameworks and performance of front end of software applications</li><li>Version control and use of GitHub and CI/CD pipelines</li><li><strong>D3 Experience with:</strong></li><li>“Stacked to Grouped Bars” component</li><li>Ability to integrate JSON data into D3 data sets</li><li>Familiarity with existing D3-related tools, such as Vega, a React-based interface for D3.</li><li>Customization of X-Axis fields</li><li>Customization of Legend component</li><li><strong>HTML Experience with:</strong></li><li>Customization/manipulation of the Canvas control, to create custom graphs</li><li><strong>React Experience with:</strong></li><li>Strong React fundamentals, including state management.</li><li>Integration with Graphical tools, such as D3 and Vega</li><li>Form management</li><li>Material UI development</li></ul><p></p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3469888396"},
{"title": "T", "location": "\n              United States\n            ", "company_name": "\n                GenSpark\n              ", "position_name": "Test Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Title</strong>: Test Engineer</p><p><strong>Location:</strong> Remote</p><p><strong>Duration</strong>: 1.5 years Contract to hire</p><p><br></p><p><strong>Description</strong></p><p><br></p><p><strong><u>What We Are Looking For</u></strong></p><ul><li>US Citizen or Green Card holder</li><li>Strong skills in communication, motivation, and self-discipline</li><li>Willing to commit to a role for a minimum of 12 months</li></ul><p><br></p><p><strong><u>Minimum Requirement</u></strong></p><p>BS /MS with STEM, Information Systems or CS background. The highest education should be from US</p><p><br></p><p><strong><u>Required Skills:</u></strong></p><ul><li>1-3 yr of software testing experience</li><li>Experience with Linux working environment</li><li>Able to read and write Shell and Python scripts</li></ul><p><br></p><p><strong><u>Role and Responsibility</u></strong></p><ul><li>Execute tests per test plan</li><li>Automate test cases</li><li>Perform regression tests</li><li>Report and verify bugs</li></ul><p><br></p><p><strong><u>What We Offer</u></strong></p><ul><li>Rapid career growth, with focused and intensive training</li><li>Compensation in line with industry norms</li><li>Excellent medical, dental, and vision benefits</li><li>Relocation assistance, if required for client assignment</li><li>Mentorship and support throughout the full-program</li><li>Networking opportunities within your industry with peers and industry leaders</li></ul><p><br></p><p>Thanks and regards</p><p>Pooja Gaikwad</p><p><strong>Executive Sourcing resourcing</strong></p><p>Mobile-<strong>478-341-4595</strong></p><p>Email-pooja.gaikwad@genspark.net</p><p>https://www.linkedin.com/in/pooja-gaikwad-680849136/</p><p><strong>Spark the Future</strong></p><p><strong>GenSpark is Division of Pyramid Consulting Inc</strong></p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3474335325"},
{"title": "R", "location": "\n              United States\n            ", "company_name": "\n                Insight Global\n              ", "position_name": "Remote Python Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering\n          ", "company_sector": "\n          Transportation, Logistics, Supply Chain and Storage and Farming\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Desired Qualifications:</strong></p><ul><li>Candidate must have 5+ years of experience working with Python.</li><li>Candidate must be proficient with React and React workflows.</li><li>Candidate must be able to perform code reviews utilizing Git.</li><li>Candidate must have professional experience doing front and backend testing with PyUnit, Cypress and Jest etc.</li><li>Candidate must have professional knowledge using AWS for the cloud and experience with CI/CD pipelines.</li></ul><p><br></p><p><strong><span class=\"ql-cursor\"> </span>Plusses:</strong></p><ul><li>Prior Agricultural professional work experience.</li></ul><p> </p><p><strong>Day-to-day:</strong></p><p>Insight Global is hiring for a Remote React Developer for one of our top agricultural companies here in the Des Moines, IA area. In this role they will be joining a new project that will be focused on data visualizations using React.js and Python. This is a new project around GIS mapping and will be working within a scrum team for this project. This React developer will be tasked with constructing visualizations that can depict vast amounts of data as well as building reusable components and libraries for future use. There will be a lot of collaboration within this team making strong communication key.</p><p></p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3471555586"},
{"title": "C", "location": "\n              United States\n            ", "company_name": "\n                Redbock - an NES Fircroft company\n              ", "position_name": "Clinical Programmer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Consulting, Science, and Research\n          ", "company_sector": "\n          Biotechnology Research and Pharmaceutical Manufacturing\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>W2 only - no 3rd party</p><ul><li>Creation of SAS programs to manage the import/export of data from the clinical database;</li><li>Development and maintenance of programs to import external and internal data files;</li><li>Provide programming support to generate listings to detect data quality issues for the study teams;</li><li>Generation of reconciliation listings cross systems to ensure data consistency and accuracy for the study team;</li><li>Provide support to the data manager in the review of Data Transfer Specifications for accuracy and provide lab codes to enable standardization;</li><li>Communicate and collaborate with the study team to identify and provide support to resolve data issues, and ensure data quality and consistency;</li><li>Creation of SAS programs to manage datasets required for data snapshots and database lock deliverables;</li><li>Creation and maintenance of data visualization in Spotfire;</li><li>Creation and management of the operational datasets on the central servers (i.e. enable blinding/ unblinding, masking/unmasking, merging of datasets, etc.);</li><li>Manage the processing of data files on an sFTP server platform;</li></ul><p><strong>Required:</strong></p><ul><li>Preferably, 5+ years of expertise working in SAS clinical programming in pharma industry, </li><li>Experience in R or more programming languages such as PERL, PYTHON, C# is preferred;</li><li>MACROs experience is preferred, with the ability to modify or update the client's system Macro functions</li><li>Bachelor's Degree </li><li>Knowledge of the RAVE EDC system is a plus</li><li>Knowledge of clinical research, FDA &amp; ICH, GCP, GCDMP, and related regulatory requirements;</li><li>Strong interpersonal skills with demonstrated capability of working on multiple projects simultaneously;</li><li>Excellent verbal and written communications skills.</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3472319911"},
{"title": "U", "location": "\n              United States\n            ", "company_name": "\n                Vectorsoft\n              ", "position_name": "UI Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong><u>React JS &amp; UI Developer:</u></strong></p><p><strong><u>Experience Level - 3+ required </u></strong></p><p><strong><u>Position - Remote</u></strong></p><p><br></p><p><br></p><p><br></p><p><strong>[Note: We are sponsoring H1-B for OPT-EAD&amp; STEM-OPT candidates who have valid EAD in USA]</strong></p><p><br></p><p><br></p><p><strong><u>Essential Responsibilities</u></strong></p><ul><li>Join a team of Web developers building world-class streaming video apps</li><li>Deliver working features at the end of every sprint</li><li>Build performant and scalable streaming apps for responsive web and living room platforms</li><li>Design and Implement new features for Entertainment’s HTML5/Javascript based streaming video apps</li><li>Triage and fix bugs</li><li>Design and Implement beautiful adaptive UIs in clean codebase and best practices</li><li>Foster the use of software design patterns for the team</li><li>Contribute to the app build process and CI/CD flow</li><li>Participate in code reviews</li><li>Collaborate with product and project team members to ensure timely delivery of quality releases</li><li>Contribute to planning and assignment of development tasks for the team</li><li>Manage submissions of the applications to the living room platform app distribution stores</li><li>Provide feedback and coaching for software engineers</li></ul><p><strong> </strong></p><p><strong><u>Qualifications/Requirements</u></strong></p><p><strong> </strong></p><p><strong><u>Basic Qualifications:</u></strong></p><ul><li>Proven experience as a javascript developer web application released to the public</li><li>Proven experience working in Agile software methodology</li><li>Bachelor’s degree in Computer Science or related field or applicable work experience</li><li>2+ years’ experience developing, releasing, and maintaining consumer facing web sites with HTML5/Javascript, React/Redux</li><li>Experience working with responsive design</li><li>Experience in creating and developing against RESTful and SOAP web services</li><li>Strong CS fundamentals, troubleshooting, debugging, and problem-solving skills</li><li>Familiarity with security guidelines and secure coding practices</li><li>Familiarity with CI/CD build and deployment practices</li><li>Excellent communication skills with the ability to explain issues clearly to non-technical stakeholders</li><li>Experience working in a collaborative team environment</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3477381062"},
{"title": "P", "location": "\n              Seattle, WA\n            ", "company_name": "\n                AllSTEM Connections\n              ", "position_name": "Python Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          Banking\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Contract Length:</strong> 4 month contract with possible extensions</p><p><strong>Location:</strong> 100% remote (but manager sits in Seattle, WA)</p><p><strong>Max Pay:</strong> $65/hr.</p><p>*There will be a Python Pre-assessment test before the interview*</p><p> </p><p><strong>Responsibilities</strong></p><ul><li>Develop data pipeline to orchestrate the lifecycle of crowd grading tasks, build dashboard to monitoring and reporting the quality of tasks</li><li>Programming in one of the following languages: Java, Python, Scala</li><li>Audit a wide variety of data for correctness</li></ul><p><strong>Required Skills</strong></p><ul><li>Programming language - Python, Java, or Scala</li><li>Familiarity with Git or similar version control system</li><li>Good understanding of data processing concepts and data engineering process.</li><li>Able to frequently collaborate closely with a diverse tight-knit team</li><li>Experience investigating and/or debugging problems</li><li>Able to track, analyze, and report issues in a timely manner</li><li>Attention to detail and a commitment to quality, while delivering work on schedule</li><li>Highly organized and efficient</li><li>Flexibility to respond and react to changing priorities quickly and efficiently</li><li>Excellent oral and written communication in English</li></ul><p><br></p><p><strong>Highly Desired Skills</strong></p><ul><li>Big data processing, e.g. Spark/Hadoop</li><li>Cloud based services, e.g. AWS</li><li>Workflow management tools, e.g. Apache Airflow</li><li>SQL</li><li>UI design fundamentals</li><li>Web development technologies, such as React for JS</li><li>QA/QE</li></ul><p><br></p><p><strong>Education</strong></p><p>BA or BS degree or equivalent work experience.</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3467849346"},
{"title": "C", "location": "\n              United States\n            ", "company_name": "\n                KORE1\n              ", "position_name": "Computer Vision Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          Staffing and Recruiting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>This would be 100% remote but must work on EST.</p><p><br></p><p> <strong>Responsibilities</strong> </p><p> Participate in full lifecycle software development for Computer Vision (CV) Models, specifically their deployment and management in development, pre-production, and production environments </p><p> Advise on performance improvement and maturation strategies for models based on feature performance, in-situ model performance and stakeholder feedback </p><p> Manage deployment of ML models to production and assist in monitoring live site issues </p><p> Develop and iterate on release pipeline for ML models to drive incremental improvements </p><p> Collaborate with technology teams across FM Global in the development of new AI/ML capabilities and establish a best-in-class processes for model management and deployment </p><p> Provide guidance across CV team – from CV Data Scientists, Data Engineers, and DevOps – to support sustainable deployment of ML capabilities across AI/ML teams </p><p> <strong>Skills/Knowledge</strong> </p><p> Experience with cloud platforms (AWS, Azure, GCP), especially with AI/ML solutions </p><p> Understanding of software engineering, including performance tuning, algorithm design, and architecture </p><p> Experience with large batch processes operations </p><p> Excellent debugging knowledge of requisite tools </p><p> Supported full-stack systems design, observability, and live site management </p><p> Experience with automated testing of machine learning artifacts </p><p> Experience deploying projects and platforms through CI/CD, Git, and automation </p><p> Experience with scaling production models using containerization </p><p> Experience establishing system health monitoring and observability solutions </p><p> Bachelor's degree in Computer Science, Engineering, Information Technology, or related field is preferred </p><p> Experience working with Agile methodologies and frameworks </p><p> Experience working in Azure cloud and using Azure Machine Learning toolset</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3476471416"},
{"title": "1", "location": "\n              United States\n            ", "company_name": "\n                Summit Human Capital \n              ", "position_name": "100% Remote Full Stack Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>Summit Human Capital is seeking a highly motivated 100% Remote Full Stack Developer to support one of our largest clients in the Fintech industry. This is a long-term contract engagement supporting the re-architecting and modernizing of several applications within an Enterprise environment. The ideal candidate will meet the following criteria: </p><p> </p><p><strong>Requirements:</strong> </p><ul><li>4+ years of development experience</li><li>Frontend experience with JavaScript to develop UI</li><li>Experience with Java, Spring Boot, and Node.js</li><li>Experience developing microservice architecture</li><li>Extensive experience with AWS serverless services, including Lambda, ECS, S3, and Load Balancer</li><li>Bachelor’s Degree in Computer Science or related field</li></ul><p> </p><p><strong>Desired:</strong> </p><ul><li>Prior experience supporting Fintech, or Financial Services industry</li><li>AWS certification(s)</li></ul><p> </p><p><strong>Responsibilities:</strong> </p><ul><li>Collaborate with development teams to develop scalable applications</li><li>Design and develop frontend UI for a better user experience</li><li>Interface across functional business units to ensure application is in line with company expectations</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3477053566"},
{"title": "M", "location": "\n              United States\n            ", "company_name": "\n                MokshaaLLC\n              ", "position_name": "ML OPS Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology and Engineering\n          ", "company_sector": "\n          IT Services and IT Consulting and Computer and Network Security\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong><u>ML OPS Engineer</u></strong></p><p><br></p><p>The ideal candidate should be able to build MLOPS pipelines for a Computer Vision based.</p><p><br></p><p><strong>MUST HAVE SKILL SET:</strong></p><ul><li>Proficient in Python Programming</li><li>Very good understanding about one or more container orchestration frameworks (KubeFlow etc.)</li><li>Understanding of MLOps, Model development lifecycle with knowledge of Training and Deployment pipelines for Machine Learning solutions.</li><li>Exposure to Google Cloud Tech (GCS, BQ, Dataflow, Pub/Sub, GKE, VertexAI/KF Pipeline, etc.)</li><li>Knowledge of Git and Github. Gitops, CI/CD deployments with Jenkins</li><li>Exposure to IaC (Terraform), experience with platform/utility lib dev</li><li>Familiar with AI\\ML Models and its basics</li><li>Experience working as one or more of the following DevOps Engineer, SRE, Platform Engineer, Infrastructure Engineer, Cloud Engineer, and/or Production Engineer.</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3476280861"},
{"title": "J", "location": "\n              United States\n            ", "company_name": "\n                Vectorsoft\n              ", "position_name": "Javascript Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>We are also doing H1b Filling process for CPT/ OPT-EAD/ STEM-OPT/ H4-EAD</strong></p><p><br></p><p><strong>Hey Are Looking for H1B this Year.....</strong></p><p><br></p><p><strong>H1B SPONSORSHIP</strong></p><p><strong>+</strong></p><p><strong>GREEN CARD PROCESSING</strong></p><p><strong>+</strong></p><p><strong>We Provide OPT &amp; CPT offer letter and STEM extension</strong></p><p><br></p><p><strong>We Will Sponsor H1B for:</strong></p><p><strong>-- OPT /CPT /H4 EAD/ L2 EAD/ J2 EAD/ TN</strong></p><p><strong>Our Strengths:</strong></p><p><strong>--100% Success Rate in H1B</strong></p><p><strong>-- Day One Green Card Processing</strong></p><p><strong>-- Big Team for Future Marketing</strong></p><p><strong>--We will provide free training in all it technologies</strong></p><p><strong>-- Great Benefits</strong></p><p><strong>--Availability in Guesthouse Facility</strong></p><p><strong>If anyone interested please revert to me asap</strong></p><p><br></p><p><strong>Thanks Regards</strong></p><p><strong>Rohith Ganji</strong></p><p><strong>Email Id- rohithg@vectorsoft.com</strong></p><p><strong>WhatsApp (647) 496-1369</strong></p><p><strong>LinkedIn: linkedin.com/in/rohith-ganji-94a10321a</strong></p><p><strong>Facebook: https://www.facebook.com/profile.php?id=100084565182898</strong></p><p>-------------------------------------------------------------------------------------------------------------</p><p><br></p><p><strong>Title: </strong> <strong>JavaScript Developer</strong></p><p><strong>Experience : 3+ Years</strong></p><p><strong>Position: Contract on w2</strong></p><p><br></p><p><strong>Job Description:</strong></p><p><br></p><p><strong>JavaScript Developer Responsibilities:</strong></p><ul><li>Building sustainable coding that may be used in the future.</li><li>Ensuring the feasibility of UI/UX designs.</li><li>Enhancing performance of the main front-end website.</li><li>Modifying designs and specifications of complex applications.</li><li>Analyzing code, requirements, system risks, and software reliability.</li><li>Collaborating with front-end and back-end web developers.</li><li><br></li></ul><p><strong>JavaScript Developer Requirements:</strong></p><ul><li>Degree in computer science, engineering, MIS, or related field.</li><li>Extensive knowledge and understanding of JavaScript.</li><li>Experience with JavaScript libraries (e.g. ExtJS, Backbone JS, and Angular JS).</li><li>Proficiency in browser rendering behavior and performance.</li><li>Experience in front-end tools (e.g. Grunt and Gulp JS.)</li><li>Sound understanding of web markup, such as HTML5.</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3478392559"},
{"title": "P", "location": "\n              United States\n            ", "company_name": "\n                Vectorsoft\n              ", "position_name": "Python Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>We are looking for</strong></p><p><strong>Position Title: Python Developer</strong></p><p><strong>Location: Remote</strong></p><p><strong>Roles: Contract on W2</strong></p><p><strong>Experience : 3+ Years</strong></p><p><strong>Note: We're Filing for H1 (OPTEAD, STEMOPT, H4EAD,CPT)</strong> </p><p><strong>Responsibilities:</strong></p><p><br></p><p><strong>· Write SAS/Python code based on functional specification and technical design. Adhere to architectural standards and develop designs that consider impact with other aspects of the database and appropriately leverage existing code.</strong></p><p><strong>· Drive optimal solution design collaborating with architects and cross-functional teams.</strong></p><p><strong>· Independently analyze and resolve production problems, assessing alternatives as appropriate and implementing long-term solutions.</strong></p><p><strong>· Evaluate and interpret requirements to design, develop and implement appropriate solutions.</strong></p><p><strong>· Perform code reviews, identify potential issues to reduce technical debt and provide coding best practice recommendations.</strong></p><p><strong>· Build and automate repeatable processes to efficiently deploy rate updates into existing rating engine.</strong></p><p><strong>· Take ownership of tasks and deliver with limited supervision while using own discretion to seek help when necessary.</strong></p><p><strong>· Collaborate closely with members of other teams throughout the delivery of the product.</strong></p><p><strong> </strong></p><p><strong> </strong></p><p><strong>Qualifications:</strong></p><p><strong> </strong></p><p><strong>· 3+ years' experience in a developer or analyst role.</strong></p><p><strong>· Statistics, Actuarial Science or equivalent experience.</strong></p><p><strong>· Proficiency in a programming language (Python, SAS or R).</strong></p><p><strong>· Strong T-SQL skills, with knowledge of database design, objects, and query tuning.</strong></p><p><strong>· Ability to comprehensively understand data sources, elements and relationships in both business and technical terms.</strong></p><p><strong>· Critical thinker with the ability to solve problems independently.</strong></p><p><strong>· A desire to build tools and applications to automate work.</strong></p><p><strong>· Excellent interpersonal, written, and verbal communication skills.</strong></p><p><strong>· Strong sense of self-motivation, organization and attention to detail; strong analytical skills</strong></p><p><strong>· Experience with Agile/Scrum, TDD/BDD is desired.</strong></p><p><strong>· AWS experience a plus</strong></p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3477960931"},
{"title": "S", "location": "\n              San Francisco, CA\n            ", "company_name": "\n                Aquent\n              ", "position_name": "Senior Data Scientist", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Temporary\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          Staffing and Recruiting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        Job Description:<p><br></p>Our saas client is seeking a Sr. Data Scientist to join their diverse and vibrant internal team.<p><br></p>In this role, you will work closely with the product management team to ensure our cloud is secure<p><br></p>and ready for our customers. Whether it’s SSO, directory syncing, or enhanced security, you’ll be focused on<p><br></p>supporting a broad portfolio of enterprise administration features and capabilities through their product lifecycle. You<p><br></p>will often use imperfect data to influence strategic company decisions under tight timelines. Our client is looking for<p><br></p>someone who is excited about building a strong data foundation with analytical rigor and best practices to make us<p><br></p>best of class.<p><br></p><u><strong>You Will:</strong></u><p><br></p><ul><li>Work with other data scientist to measure the success of one of the largest products in the company. This includes regular evergreen support.</li><li>Work with Cloud Security PMs, Engineers, and Designers to help build better products.</li><li>Support multiple technically complex products, all in different levels of maturity, requiring data instrumentation, dashboard building, understanding adoption and engagement, experimentation, and building customer profiles.</li><li>Translating insights into decisions and actions that have a direct business impact</li><li>Instrument data and supporting products and/or features through their lifecycle</li><li>Have a strong sense of accountability, self-drive, and the ability to function independently</li><li>Be proficient in SQL and expertise in Python / R</li><li>Prioritize your time wisely against multiple competing projects and requests</li></ul><p><br></p>The target hiring compensation range for this role is $55/hr to $64/hr. Compensation is based on several factors including, but not limited to education, relevant work experience, relevant certifications, and location. Additional benefits offered may include; medical health insurance and dental insurance, life insurance, and eligibility to participate in 401k plan with company match.\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3474155792"},
{"title": "S", "location": "\n              Ohio, United States\n            ", "company_name": "\n                Brooksource\n              ", "position_name": "SDET", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          Retail\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>SDET</strong></p><p><strong>100% Remote working on EST</strong></p><p><br></p><p><strong>Job Description</strong></p><p>We are looking for an individual with a passion for being part of an Agile development team, participating in all aspect of the software development lifecycle, focusing on making the team more efficient and productive through quality software best practices. As an SDET, you will be given the opportunity to create software, as well as design/build/maintain test automation and have a direct and meaningful impact on the quality of the client's platform</p><p><br></p><p><strong>Qualifications</strong></p><ul><li>Strong automation background and expert knowledge in building frameworks</li><li>Experience with Selenium/testing required</li><li>Front/Backend - Springboot/Java/React JS</li></ul><p><br></p><p><strong>Key Responsibilities</strong></p><ul><li>Own and be accountable for test strategy, test planning, and test execution within their product team</li><li>Responsible for design and execution of test strategies as part of an Agile scrum team</li><li>Participate in product design reviews to provide input on testability of functional requirements, product designs, and estimating/planning</li><li>Analyze and decompose complex software systems and collaborate with and influence others to improve the overall design</li><li>Translate user stories and requirements to test cases</li><li>Develop and support the testing of product features throughout the entire development cycle</li><li>Design and build advanced automated testing frameworks</li><li>Uncovering issues by debugging the application through logs, stack traces and test results and continuous monitoring of systems under test</li><li>Work closely with development teams to drive root cause analysis and feed that knowledge into automated quality processes effectively</li><li>Drive adoption of best practices in code health, testing, and maintainability</li><li>Collaborate with engineers in other teams to keep current on the company’s latest developments in the area of automation, learn from them and share/propose ideas</li><li>Advocate for shift-left approach to testing and be the voice of quality</li><li>Research emerging test tools, trends and methodologies and enhance existing systems and processes</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3476243979"},
{"title": "S", "location": "\n              Hershey, PA\n            ", "company_name": "\n                PRI Global\n              ", "position_name": "Sr. Data Scientist", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <strong>Job Description</strong><p><br></p>Summary:<p><br></p>The Enterprise Data Science organization drives value for Hershey by creating disruptive predictive and prescriptive solutions to the Enterprise for analytics and decision-making.<p><br></p>The Sr. Data Scientist will be working with Hershey business partners, technical engineers, data architects, and project managers to ensure data science standards adhere to company best practice and help to deliver rapid impactful benefits.<p><br></p>The Sr. Data Scientist will act as a trusted advisor for Hershey business partners to build new, data-driven, machine-intelligent capabilities that impact the business. You will work with large volumes of data, innovative technologies, and advanced methods to solve real business problems. You'll design and run experiments, research new algorithms, and find new ways of optimizing risk, profitability, and the customer experience. You will work with a diverse team of business analysts, technical engineers, data architects, and project managers to deliver outcomes aligned with our business partners strategy. In addition, you will work directly with the Director of Data Science to ensure consistency and compliance of deliverables to frameworks and governance processes.<p><br></p>Applicants should have a strong background in machine learning, statistical modeling, feature discovery/selection, optimization, exploratory data analysis, data mining and pattern recognition.<p><br></p>Responsibilities:<p><br></p>Data Science Solution Delivery:<p><br></p>Contribute to the agile delivery of business partner strategic roadmaps using best practice data science methods, frameworks, and governance processes<p><br></p>Data Science Domain:<p><br></p>Collaborate with IT and business partners to define, manage and deliver innovative data science solutions to drive growth and adoption of capabilities at Hershey<p><br></p>Data Science Advocacy:<p><br></p>Evangelize future data science solutions identified by Enterprise Data leadership, including innovations such as: machine learning, statistical modeling, feature discovery/selection, optimization, exploratory data analysis, data mining and pattern recognition<p><br></p>Lead and coordinate key cross-functional data science efforts to accelerate value creation for agile execution team outcome delivery through machine learning<p><br></p>As part of a team, use machine learning (Client), deep learning (DL) and other analytical techniques to create scalable solutions for business problems<p><br></p>Interact with business partners, technologists and engineers define and understand business problems, help, and aid them to implement Client/DL algorithms when appropriate<p><br></p>Design, develop and evaluate highly innovative models for predictive learning, content ranking, and anomaly detection<p><br></p>Analyze and extract relevant information from historical data to help automate and optimize key processes<p><br></p>Work closely with technology, business, and engineering teams to drive model implementations and adoption of new algorithms<p><br></p>Using best practice guidance from the Enterprise Data team, oversee the health and evolution of agile execution team data science technologies<p><br></p>Strategic thinker with holistic vison, specific focus on automation of existing processes to drive key business performance<p><br></p>Able to articulate the holistic benefits of data science from a business perspective, while maintaining the relationship with business analysts, data architects, technical engineers, and project managers<p><br></p>Routinely meets with entire execution team (business analysts, data scientists, technical engineers, data architects, and project managers), business stakeholders and the Director for Data Science. Occasionally meets with senior leaders Enterprise Data and with key business partners.<p><br></p>Minimum knowledge, skills and abilities required to successfully perform major duties/responsibilities:<p><br></p>Working knowledge of agile frameworks<p><br></p>Ability to manage multiple priorities, meet deadlines and produce quality results under pressure<p><br></p>Demonstrated leadership and managerial skills<p><br></p>Strong problem solving and analytical skills<p><br></p>Strong team player, change agent, and advocate<p><br></p>Excellent customer service skills<p><br></p>High energy self-starter<p><br></p>Excellent verbal and written communication skills<p><br></p>Minimum Education:<p><br></p><strong>Masters In a STEM Degree Required, Ph.D. Preferred</strong><p><br></p>Minimum Experience Requirements:<p><br></p>3&amp;plus; years of professional experience with applying quantitative research in optimizing human decisions using technologies like machine learning and/or deep learning<p><br></p>2&amp;plus; years using major machine learning/deep learning frameworks (e.g., Scikit-learn, PyTorch, TensorFlow and Keras) and algorithms (e.g., CNN, GAN, LSTM, RNN, XGBOOST)<p><br></p>2&amp;plus; years of data engineering experience with modern big data analytics architectures (Hadoop, SQL, HIVE, Spark, etc.) on major cloud platforms (e.g., AWS, Azure, Google Cloud)<p><br></p>2&amp;plus; years programming skill in Python, R, Scala or Java<p><br></p>Working knowledge with modern cloud-based data storage and compute environments (e.g., Snowflake, Databricks in Azure, AI-platform in GCP, etc.)<p><br></p>Experience deploying Client models into discovery/production environment to drive insights using MLOps a plus<p><br></p>Experience working in a agile delivery model a plus<p><br></p>Demonstrated leadership and self-direction. Willingness to both teach others and learn new techniques<p><br></p>Ability to communicate complex ideas in a clear, precise, and actionable manner<p><br></p>Excellent communication and presentation skills, with the ability to articulate new ideas and concepts to technical and non-technical partners\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3478366331"},
{"title": "S", "location": "\n              United States\n            ", "company_name": "\n                LeadStack Inc.\n              ", "position_name": "Software Tools Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          Staffing and Recruiting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Job Description</strong></p><p><strong> </strong></p><p><strong> LeadStack Inc.</strong> is an award winning, one of the nation’s fastest growing, certified minority owned (MBE) staffing services provider of contingent workforce. As a recognized industry leader in contingent workforce solutions and Certified as a Great Place to Work, we’re proud to partner with some of the most admired Fortune 500 brands in the world. </p><p> </p><p> </p><p><strong>Title: Software Tools Engineer</strong></p><p><strong> Location: Cedar Rapids, IA -Hybrid (25% Travel Required) -</strong></p><p><strong> Duration: 6 Months with possible hire</strong></p><p><strong>Job ID: 23-00321</strong></p><p><strong> Pay range: $60– $60/ hour DOE</strong></p><p><strong> Need Local candidate</strong></p><p><strong> </strong>Job Description:</p><p>· The group is looking for a Software Engineer to be responsible for supporting our company's ongoing projects. You will be working closely with your team members to ensure that all software requirements, deadlines, and schedules are on track. Responsibilities include working with a team of engineers, creating software product schedules, ensuring quality of software, and delivering said products on time. To be a successful candidate, you will need to have proven experience in software development and the ability to take a set of revolving requires and ensure the product is to customer expectations. A Bachelor's degree is required, and experience in GNSS product development is desirable. You will be tasked with supporting both internal and external software tool projects to support the organization's strategic direction. You will be required to work with local and international groups to successfully release innovative products. </p><p>Requirements</p><p>• Design and implement new methods of automated tool test integration for current and upcoming Location products </p><p>• Received requirements and create quality tools.</p><p>· <strong>Ability to code C, C++, Python, Java (Android)</strong></p><p>• Contribute ideas and follow through with designs for upcoming Location-based features </p><p>• Continued support and evolution of new and existing tools will be required Minimum Qualifications </p><p>• Familiarity with the continuous integration process and the use of GIT </p><p>• A self-driven engineer with good task execution skills to deliver high-quality output in a timely manner </p><p>• Past experience leading a group of engineers to complete engineering tasks in a timely manner </p><p>• Demonstrated ability to work as a team player as part of a local and globally distributed team </p><p>• Strong mathematical and analytical abilities • Solid communication and documentation skills </p><p>•<strong> Good understanding of GNSS principles, from signal generation, transmission, reception, measurement construction and final position generation</strong></p><p> </p><p> </p><p><strong> </strong></p><p><strong> To know more about current opportunities at LeadStack</strong>, please visit us on https://leadstackinc.com/careers/</p><ul><li><strong> Should you have any questions, feel free to call me on 628.</strong>226<strong>.</strong>0998 or send an email on waseem.ahmad@leadstackinc.com</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3477448783"},
{"title": "A", "location": "\n              United States\n            ", "company_name": "\n                Insight Global\n              ", "position_name": "Automation Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          Financial Services\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>- 5+ years of relevant technical experience and experience in test automation</p><p>- Strong working knowledge of Relational Databases like Oracle or Postgres.</p><p>- Experience with PL/SQL or SQL</p><p>- Expertise building automation frameworks using Python</p><p>- Experience building BDD frameworks</p><p>- Experience building automation for ETL and heavy data focused applications</p><p>- Expert knowledge in test automation frameworks and demonstrate proficiency, quality and passion in your coding ability</p><p>- Experience with DevOps, Continuous Integration and Delivery tools like Jenkins, Maven, uDeploy, Stash.</p><p>- Experience with Java, Selenium, Karate</p><p> </p><p> You will be working with a team of technologists focused on delivering Automation, Continuous Integration and Test Data ecosystems. This role demands significant collaboration with members of various business and IT groups throughout the lifecycle of a typical project. As a technical associate, you will be working directly to shape our technology vision and will have a real impact on our Workplace Solutions organizations success.</p><p>Stock Plan Services administers equity compensation programs on behalf of public and private companies offering various compensations programs such as: Employee Stock Purchase Plans, Restricted Stock Awards/Units, Stock Option Plans, Stock Appreciation Rights and Performance based Awards. Currently SPS services over 1.6M participants employed by over 300 clients and spread out in 150 countries. The business is looking to further expand in the international equity compensation market, focused initially on western European countries and companies based there. As part of this business initiative, we are extending our capabilities to enable a truly global platform.</p><p> </p><p>We are looking for individuals with a strong Python and SQL background to focus on data validation portions of the platform. The majority of the time will be spent on validation of back end ETLs. There is minimal UI or API testing involved for this individual. He or she must also be extremely independent and able to think through problems on his own and work across multiple workstreams.</p><p></p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3467875216"},
{"title": "D", "location": "\n              United States\n            ", "company_name": "\n                TechnoGen, Inc.\n              ", "position_name": "Data Integration Developer (Data Engineer with Python\\/Pyspark)", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <em>TECHNOGEN, Inc. is a Proven Leader in providing full IT Services, Software Development and Solutions for 15 years. <br><br></em><em>TECHNOGEN is a Small &amp; Woman Owned Minority Business with GSA Advantage Certification. We have offices in VA; MD &amp; Offshore development centers in India. We have successfully executed 100+ projects for clients ranging from small business and non-profits to Fortune 50 companies and federal, state and local agencies.<br><br></em>Hello,<br><br>Am Satheesh from Technogen Inc, I am currently looking for <strong>Data Engineer</strong> for one of our clients. Below is the job description for your review.<br><br>Please let me know if you would be interested and share your updated resume.<br><br>You can reach me at Satheesh.m@technogeninc.com<br><br>HI,<br><br>Hope you are doing good.<br><br><strong>Job Title :</strong><strong> Data Engineer With Python/Pyspark<br><br></strong><strong>Client : NTT Data/ Humana Inc<br><br></strong><strong>Location: Louisville, KY (Permanent remote)<br><br>Experience level: 7+ years<br><br></strong><strong><u>Skills<br></u></strong><ul><li>Python/Pyspark a must. Knowledge of MS Azure tools such as ADF, Databricks or ASA.<br></li></ul><strong><u>Required Qualifications<br></u></strong><ul><li>Bachelor's Degree in Computer Science or related field.</li><li>3-5 years of experience in systems analysis or application programming development. </li><li>Must be passionate about contributing to an organization focused on continuously improving consumer experiences.</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3476448565"},
{"title": "S", "location": "\n              United States\n            ", "company_name": "\n                Modis\n              ", "position_name": "Software Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology and Business Development\n          ", "company_sector": "\n          Furniture and Home Furnishings Manufacturing\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>Akkodis is seeking a <strong>Software Developer</strong> for a <strong>Contract</strong> position with a client located in <strong>Rochester, NY</strong>. Ideally looking for applicants to have a solid background in reporting tools(SSRS/OBIEE/MicroStrategy) and have Python experience.</p><p><br></p><p><strong>Title: Software Developer</strong></p><p><strong>Location: Rochester, NY (Fully Remote) </strong></p><p><strong>Duration: Contract</strong></p><p><strong>Pay Range: $60 - $65/hour</strong></p><p><strong> </strong></p><p><strong>Desired Qualifications:</strong></p><p><strong> </strong></p><ul><li>Bachelor’s Degree</li><li>Experience with any Reporting Tools (OBIEE / SSRS / MicroStrategy)</li><li>Background with object-oriented programming/scripting like Python</li><li>Ability to write and troubleshoot SQL</li><li>Knowledge of code management, SDLC, and automated deployments</li><li>Has worked in an agile environment</li><li>Willing to learn and try new things</li></ul><p><br></p><p>If you are interested in this <strong>Software Developer</strong> job in <strong>Rochester, NY</strong>, then please click APPLY NOW. For other opportunities available at Akkodis go to www.akkodis.com.If you have questions about the position, please contact <strong>Rahul Singh </strong>at <strong>610-813-1156 or rahul.singh@modis.com.</strong></p><p><strong> </strong></p><p><strong>Equal Opportunity Employer/Veterans/Disabled </strong></p><p><strong> </strong></p><p><strong>Benefit offerings include medical, dental, vision, term life insurance, short-term disability insurance, additional voluntary benefits, commuter benefits, and 401K plan. Our program provides employees the flexibility to choose the type of coverage that meets their individual needs. Available paid leave may include Paid Sick Leave, where required by law; any other paid leave required by Federal, State or local law; and Holiday pay upon meeting eligibility criteria. </strong></p><p><strong>To read our Candidate Privacy Information Statement, which explains how we will use your information, please visit </strong>https://www.modis.com/en-us/candidate-privacy/</p><p><strong> </strong></p><p><strong>The Company will consider qualified applicants with arrest and conviction records.</strong></p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3473973124"},
{"title": "P", "location": "\n              United States\n            ", "company_name": "\n                Pegasus Knowledge Solutions\n              ", "position_name": "Python/AWS Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong><em>Pegasus Knowledge Solutions, Inc</em></strong><em>.</em> (PKSI) is a highly-recognized provider of professional IT Consulting services in the United States of America.</p><p> </p><p>Here is our open requirement with our direct client which can be filled immediately.</p><p><br></p><p>The goal of this role is to bring best practices and efficiencies to an existing ETL system, and to help prepare parts of that system for migration. You will have the responsibility of assisting a team lead in moving this workstream forward, working alongside dedicated engineers who value their community of knowledge sharing, communication, and growth. We encourage open dialogue between our people, and you’ll have the opportunity to interface with your peers, leadership, and product teams daily.</p><p><br></p><p>The product development team is looking for a seasoned Software Engineer (Python / AWS Developer) consultant with a proclivity for project delivery. This role requires a good balance of professional autonomy and team collaboration to move the needle on critical workstreams.</p><p><br></p><p><strong>Responsibilities :</strong></p><p><br></p><p> Create maintainable software including comprehensive unit and performance testing primarily using Python and AWS</p><p> Work closely with Tech Lead and Delivery Manager to advance progress on development workstreams</p><p> Independent identification and delivery of tasks without daily assistance, including work toward automation, code-base clean-up, bug fixes, etc.</p><p> Active participation in peer code reviews and all scrum ceremonies </p><p> Be a trusted mentor for other members of the team, assisting in related deliverables and openly participating in knowledge sharing and pair programming exercises where useful</p><p> Uphold and help evolve coding standards using best-practices and lessons-learned</p><p> Consistent and effective communication and collaboration with peers and stakeholders</p><p> Bring energy and commitment to our inclusive and equitable team environment</p><p><br></p><p><strong>REQUIRED SKILLS</strong></p><p><br></p><p> Experience building systems using<strong> Python, AWS,</strong> and above features.</p><p> Demonstrated understanding of Python dependency management, build, project structure, etc.</p><p> Basic experience working with <strong>Snowflake</strong></p><p> Understanding of <strong>AWS basics, particularly Lambda and step functions</strong></p><p> 5+ years of professional software development on critical backend systems in a production environment</p><p> Strong understanding of database schema design and access especially non-relational databases (e.g. within Snowflake)</p><p> Solid understanding of cloud computing strengths and weaknesses</p><p> Solid understanding of security and encryption practices</p><p><br></p><p>Please send your questions and resumes to sbudha@pksi.com</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3473964748"},
{"title": "N", "location": "\n              United States\n            ", "company_name": "\n                Planet Technology\n              ", "position_name": "Node/React Full Stack Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering\n          ", "company_sector": "\n          Higher Education\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>Planet Technology's client is looking for a Node/React Full Stack Engineer for a Long-Term Remote Contract opportunity. </p><p><br></p><p>They are looking for someone with strong Backend experience with Node.js, as well as strong experience working in an AWS Serverless environment (Lambda, Dynamo, SNS/SQS, CloudWatch, etc). The team will be building a SaaS relating to Financial Aid Applications</p><p><br></p><p>Must Haves:</p><ul><li>5+ years experience in Full Stack Software Development, programming, database development and infrastructure development</li><li>4+ years of experience with Node.js, React.js, and Javascript</li><li>3+ years working in AWS Serverless environment (Lambda, Dynamo, SNS/SQS, CloudWatch)</li><li>Experience building IaC using AWS CDK and Cloud Formation</li><li>Strong knowledge of CI/CD tools: Jenkins, Ansible, BitBucket, CloudFormation, etc. </li></ul><p><br></p><p>Nice to Haves:</p><ul><li>Monitoring tools like: SumoLogic, Datadog, Nagios, </li><li>Knowledge of programming languages, relational and non-relational databases</li><li>Experience in Linux based administration</li><li>Automated testing tools (Selenium, Cucumber, etc.)</li></ul><p></p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3469818308"},
{"title": "S", "location": "\n              United States\n            ", "company_name": "\n                GForce Life Sciences\n              ", "position_name": "SAS Clinical Programmer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Consulting, Science, and Information Technology\n          ", "company_sector": "\n          Medical Equipment Manufacturing, Biotechnology Research, and Pharmaceutical Manufacturing\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Consultant, Clinical Programmer, Pharmaceuticals</strong></p><p><br></p><p><strong>Summary</strong></p><p>Our mid-sized, growing pharmaceutical client is seeking an experienced SAS programmer to support safety and efficacy clinical trial analysis and reporting. This Programmer will sit within the Clinical Programming Department and will report up to the Senior Manager and above.</p><p><br></p><p><strong>General Duties / Expectations of Role:</strong></p><ul><li>Independently develop/validate programs that generate analysis datasets based on ADaM specifications</li><li>Prepare/QC ADaM datasets documentation: Define.xml, Reviewer’s Guide, and analysis metadata report</li><li>Independently develop/validate programs that generate tables, listings, and graphs specified in the protocol or the Statistical Analysis Plan (SAP) including statistical efficacy analysis</li><li>Perform quality control on final reports</li><li>Provide QC and validation reports</li><li>Support the development of technical programming specifications for ADaM standards</li><li>Communicate with programming and statistics leads, data managers, and other team members</li><li>Provide project progress updates on programming activities </li><li>Develop and validate technical specifications and programs for safety and efficacy analysis datasets, tables, listings, and graphs</li><li>High competence in using SAS/Base, SAS/Macro, SAS/STAT</li><li>Knowledge of SAS/Graph, and SAS/SQL</li></ul><p><br></p><p><strong>Qualifications</strong></p><ul><li>BS/MS in Statistics, Biostatistics, Computer Science, Mathematics, or Life Sciences</li><li>Minimum of 8 years of statistical programming experience in the Pharmaceutical, Biotechnology, or Contract Research Industry</li><li>Strong SAS programming skills required in Windows &amp; UNIX environments with proficiency in SAS/Base, SAS Macros, SAS/Stat</li><li>Experience with creating PK datasets and outputs (ADPC and ADPP), generating datasets for PK analysis</li><li>Knowledge of working in the SAS Grid environment with experience in the SAS Enterprise Guide and SAS Studio </li><li>Experience with all clinical phases I (preferred) as well as II, III, and IV of trails </li><li>Good understanding of standards specific to clinical trials such as CDISC, SDTM, ADaM, MedDRA, WHODRUG</li><li>Strong problem-solving skills</li></ul><p><br></p><p><strong>Knowledge and implementation of:</strong></p><ul><li>CDISC SDTM and ADaM principals</li><li>Relational Databases</li><li>Good Clinical Practice principals</li><li>Good Programming Practice principals</li><li>21CFR Part 11 Standards principals</li><li>Integrated Summary Safety/Efficacy Analyses</li><li>Safety data and Coding Dictionaries (MedDRA and WHODD)</li></ul><p><br></p><p><strong>Nice to have</strong></p><ul><li>Experience in CNS preferred, Nephrology is a plus</li><li>Submission experience is a plus</li><li>Experience leading study is a plus</li></ul><p><br></p><p><strong>Term &amp; Start</strong></p><ul><li><strong>12-month contract – option to extend</strong></li><li><strong>Start 2 weeks from an offer</strong></li><li><strong>Remote Opportunity </strong></li><li><strong>Benefits included (Medical, Dental, Vision, 401k)</strong></li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3452369768"},
{"title": "J", "location": "\n              Florida, United States\n            ", "company_name": "\n                Insight Global\n              ", "position_name": "Javascript Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          Staffing and Recruiting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>Must-haves </p><p>- 5+ years of expert Java Script/Type Script skills </p><p> - Strong knowledge of Node.js </p><p> - Experience with CI/CD processes/practices using GitHub Actions </p><p> - Experience working in a fast-moving environment </p><p><strong> </strong></p><p>Plusses </p><p>- Experience with Jenkins/Groovy </p><p><strong> </strong></p><p>Day-to-Day </p><p>- Understand the current CI/CD process coded in Groovy and recode the same in Git Hub actions using Java Script </p><p> - Develop modular Git Hub Action handlers, which can be wired up together to run an end-to-end CI/CD suite </p><p> - Own and manage the product and ensure unit test coverage and high-quality code artifacts are developed </p><p> - Migrate from Jenkins to Git Hub Actions </p><p> - Work with Product team to understand the features and user stories and deliver the software and documentation artifacts</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3469841380"},
{"title": "S", "location": "\n              United States\n            ", "company_name": "\n                Adaptive Solutions Group\n              ", "position_name": "Software Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>Adaptive Solutions Group is a premier provider of information technology personnel. We provide a variety of technical professionals available for contract, contract to hire, or direct placement positions to companies in and around the St. Louis and Kansas City Areas. </p><p> </p><p>We are currently looking for a <strong>Software Engineer</strong> to join our team. </p><p> </p><p><strong>Responsibilities</strong> </p><ul><li>Documentation and coding to maintain scripts. </li><li>Assess the coding landscape and needs. </li><li>Primary work is NOT building but is assessing and documenting. </li><li>Convert ideas into documents other people can follow. </li><li>Documents can be in Confluence or can be READMEs in the code. </li><li>Assess if there are any red flags in what has been done and fix them. </li></ul><p> </p><p><strong>Education &amp; Experience</strong> </p><ul><li>Bachelor’s degree in Computer Science, Information Systems, or Computer Programming preferred. </li><li>5+ years' in a Software Engineer role </li><li>Must have Skillset: </li><li>Python </li><li>PowerShell </li><li>GitLab configured by YAML </li><li>Modern Cloud mindset – i.e. knitting together different services in a zero-trust context </li></ul><p> </p><p>Adaptive Solutions Group is an equal opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, and veteran or disability status. </p><p>Adaptive Solutions Group offers a competitive compensation and benefits package that includes medical, dental, STD/LTD, life insurance coverage, 401k, paid vacation and holidays.</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3478534927"}
]