[
{"title": "Data Scientist", "location": "\n              Austin, Texas Metropolitan Area\n            ", "company_name": "\n                Allied Consultants, Inc.\n              ", "position_name": "Data Scientist", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Overview</strong></p><p>Allied Consultants, Inc. is an Austin-based firm which has for 31 years been a premier provider of technical and business professionals to clients in Texas. We are currently seeking an experienced <strong><u>Data Scientist</u></strong> to be a key resource on a technical services team.</p><p> </p><p>Allied Consultants offers its family of consultants excellent rates, a local support staff, and an attractive benefits package which includes medical insurance (Allied shares a percentage of the cost), life insurance, a matching 401(k) plan and a cafeteria plan.</p><p><br></p><p>Candidates selected for interview will be required to undergo criminal background checks and may be required to complete a drug screen in accordance with Federal and State Law. Offers of Employment are contingent on a successful background check</p><p><br></p><p>Allied Consultants is an equal opportunities employer.</p><p><br></p><p><strong>Responsibilities</strong></p><p>The Advanced Grid Technologies group with the client is looking for a passionate Data Scientist to join our innovation and technology driven team. This position joins a very skilled workgroup that works closely with Program Managers, Analysts, Project Coordinators, and other technical leads performing analysis, reporting, and strategy building utilizing a wide array of documented use-cases in areas like advanced metering, work management, and distributed energy resource integration. Amongst a host or varied tasks, the successful candidate will: Deep dive on existing and new system data sources, unearthing problems known and unknown; Develop performance dashboards for existing and emerging programs and grid technology projects; and provide prescriptive analytics on an ad hoc basis in a fast-paced environment. We are looking for an enthusiastic, flexible, and personable individual with an eye for detail and ability to work independently in a deadline driven environment; a data scientist with a strong desire to be part of a growing and high performing team.</p><ul><li>BS, MS, or PhD in a numerical analysis–related field of study (statistics, computer science, mathematics, computer engineering).</li><li>Minimum 2 years of professional experience conducting data science projects in a professional or research environment.</li><li>Prior experience leading projects from conception to completion including iteration and QA concepts.</li><li>Proficiency and demonstrated experience in all phases of the data science life cycle working with real-world data—data compilation, data exploration, feature selection and engineering, training and testing of statistical or ML models, and communication of results.</li><li>Proficiency in R or Python, ability to craft complex queries and analysis using SQL.</li><li>Experience building reporting and analytics dashboards in Tableau or related visualization platform.</li></ul><p><br></p><p><strong>Qualifications</strong></p><p><strong>Minimum (Required)</strong></p><ul><li>4-7 years of professional experience as a data analyst, developer, or data scientist.</li><li>4-7 years of professional experience creating statistical or machine models to execute forecasting based on disparate and unfamiliar datasets.</li><li>4-7 years of coding and release experience using bash, Python, and/or other common languages.</li><li>4-7 years of building dashboard and reporting suites keeping stakeholders and consumers in mind through the design and iteration phases.</li></ul><p><br></p><p><strong>Preferred (Optional)</strong></p><ul><li>3 years experience working with, analyzing, and testing deeper analytical hypothesis using utility or energy- related data sets.</li><li>3 years of working within a cloud infrastructure, confidence to be own DevOps support alongside other experts.</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3469869907"},
{"title": "Actimize Developer", "location": "\n              United States\n            ", "company_name": "\n                Pacific Consulting\n              ", "position_name": "Actimize Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Management and Manufacturing\n          ", "company_sector": "\n          Software Development\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <ul><li>Excellent understanding of Actimize SAM/CDD/WLF 8.x solution databases such as UDM, CDS, APP, Profiles and RCM databases</li><li>The ability to work with multiple systems, investigate application failures, and trace through various app logs to troubleshoot is necessary</li><li>Knowledge of Web Server and Web Application server</li><li>Unix programming experience specifically shell scripting in the Linux environment. Ability to use tools such as awk, sed, grep and other Unix utilities.</li><li>Good understanding of Actimize solutions including how the rules work end-to-end, rule logic, configurations, settings, parameters, population groups, scores, thresholds, etc.</li><li>Experience working on ETL processes to gather, manage, load, and analyze large data volumes of data </li><li>Strong SQL experience and the ability to create/modify/execute/troubleshoot queries</li></ul><p></p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3472314036"},
{"title": "Node.js developer", "location": "\n              United States\n            ", "company_name": "\n                Kaizer Software Solutions\n              ", "position_name": "Node.js developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>Job Description:</p><p><br></p><p>Key skills:</p><p><br></p><p>Experience in consuming SOAP and REST Web services </p><p>JavaScript, HTML, CSS</p><p>Experience with Node.js.</p><p> </p><p><br></p><p>Required skills:</p><p><br></p><p>Strong proficiency with JavaScript, TypeScript, ES6 to build RESTful API</p><p>Knowledge of Node.js and frameworks available for it e.g. Express, Hapi</p><p>Understanding the nature of asynchronous vs synchronous programming and its quirks and workarounds.</p><p>Good understanding of server-side tinplating languages e.g. Jade, EJS.</p><p>Good understanding of NoSQL vs SQL database and working knowledge on MongoDB.</p><p>Implementing automated testing platforms and unit tests with Karma+Jasmin or Mocha+Chai</p><p>User authentication and authorisation between multiple systems, servers, and environments</p><p>Good understanding on multithreading CPU and concurrency programming</p><p>Implement and Improve application-logging services</p><p>Proficient understanding of code versioning tools, such as Git</p><p>Understanding fundamental design principles behind a scalable application</p><p>Good understanding on building CI/CD pipeline for end-to-end build and deployment of the application</p><p>Work with the product and design and development teams to understand end-user requirements, formulate definitions of done, and translate that into an effective technical solution</p><p>Years of experience: 3-8 Year of work experience.</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3477240187"},
{"title": "Data Scientist - Customer Analytics", "location": "\n              United States\n            ", "company_name": "\n                US Tech Solutions\n              ", "position_name": "Data Scientist - Customer Analytics", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting, Banking, and Accounting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Title: Data Scientist - Customer Analytics</strong></p><p><strong>Location: Remote(CST)</strong></p><p><strong>W2 Contract</strong></p><p><strong>Job Description:</strong></p><p>The primary responsibilities of this role, Data Scientist – customer analytics are to:</p><p> Develop &amp; Deliver:</p><p>· Deliver best-in-class analytics solutions for the customer-centric commercial operations of client. Topics include but not limited to: customer analytics, segmentation analysis, predictive cross-sell, churn prediction, and agronomic recommendation. Results will drive business decisions and significant revenue.</p><p>· Develop practical, interpretable, and automated solutions for these business problems through expertise in feature engineering, statistical analysis, predictive modeling (classification and regression), simulation, and optimization methodology by working in a highly interactive, team-oriented environment.</p><p>· Write model documentation to detail problem formulation, modeling approach, validation, data requirements and implementation steps.</p><p>· Support stakeholder requests for model development, implementation, and feature improvements, be able to communicate results to a broad range of audience in a clear, interpretable manner.</p><p>· Research new and innovative technical methodologies to support enhancement and expansion of existing work.</p><p>Collaborate &amp; Communicate:</p><p>· Work closely with research data science teams and business partners to break down complex business problems, gather requirements to build feasible solutions that are impactful, accurate and validated.</p><p>· Collaborate with system integration and data warehouse engineers on data extraction and data cleaning (ETL).</p><p>· Be creative, resourceful, detail-oriented, able to take initiatives and exercise critical thinking when it comes to problem solving.</p><p>· Be a proactive member of a global data science team to adopt and advocate for coding best practice and documentation.</p><p>Required Qualifications:</p><p>· Bachelor’s degree with at least 4 + of experience, Master’s degree with 2+ years of experience or a PhD in one of the following areas: Data Science, Economics, Electrical/Industrial Engineering, Applied Mathematics, Statistics, Computer Science or Any other discipline with strong quantitative skills or research experience.</p><p>· Applied experience conducting statistical inferences, time-series analysis, statistical simulation, analysis and building machine learning models using disparate sources of data.</p><p>· Advanced programming skills in R or Python or both employing object-oriented programming, good programming practices, use of IDEs, adherence to code style and good documentation for machine-learning tasks, working knowledge of version-control tools (such as git and git workflows including CLI).</p><p>· Passionate about data driven story telling using data visualization tools and appropriate supporting media (such as interactive dashboard, presentation slides, research report)</p><p>· Excellent work ethic, and a strong desire to learn new skills for technical and professional growth.</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3477149100"},
{"title": "Azure ML/Data Scientist", "location": "\n              Seattle, WA\n            ", "company_name": "\n                Xoriant\n              ", "position_name": "Azure ML/Data Scientist", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Required Candidate Skills and Experience: </strong></p><ul><li>Machine Learning - working with ML frameworks such as SKLearn or other ML libraries</li><li>BS or MS in Engineering, Math, Statistics, Analytics, or Finance</li><li>5-8+ years of experience working in a fast-paced environment as a data scientist.</li><li>Hands on experience with Azure.</li><li>Hands on experience with modeling, optimization, and simulation</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3477679595"},
{"title": "Data Scientist", "location": "\n              Redmond, WA\n            ", "company_name": "\n                Aditi Consulting\n              ", "position_name": "Data Scientist", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong><u>Job Details:</u></strong></p><p><strong>Title: </strong>Data Scientist</p><p><strong>Location:</strong> Remote</p><p><strong>Duration: </strong>6 Months Contract (Only on W2)</p><p> </p><p><strong><u>Required Skills:</u></strong></p><p>· 3-5 years of experience</p><p>· Apply knowledge of machine learning techniques and concepts, including the design and implementation of advanced artificial intelligence, computational algorithms, and data science techniques.</p><p>· Participate in and lead the running of experiments and documentation of results in technical or research whitepapers.</p><p>· Communicates data findings to both business and IT leaders to influence how an organization approaches and meets business challenges of an evolving customer base and changing marketplace, using strong business acumen.</p><p>· Collaborates with database engineers and other scientists to develop, refine, and scale data management and analytics procedures, systems, workflows, best practices, and other issues.</p><p>· Conduct statistical modeling and experiment design, test and validate predictive models.</p><p>· Conducts scalable data research, on and off the cloud.</p><p>· Develop custom algorithms to solve analytical problems with data sets.</p><p>· Implement automated processes for scaling models.</p><p>· Build and maintain data pipelines.</p><p> </p><p><strong><u>Must have Skillsets:</u></strong></p><p>· Adobe analytics &amp; SQL - 4 to 5 years experience</p><p><br></p><p><strong><u>REQUIREMENTS:</u></strong></p><ul><li>3-5 years of experience</li><li>Apply knowledge of machine learning techniques and concepts, including the design and implementation of advanced artificial intelligence, computational algorithms, and data science techniques.</li><li>Participate in and lead the running of experiments and documentation of results in technical or research whitepapers.</li><li>Communicates data findings to both business and IT leaders to influence how an organization approaches and meets business challenges of an evolving customer base and changing marketplace, using strong business acumen.</li><li>Collaborates with database engineers and other scientists to develop, refine, and scale data management and analytics procedures, systems, workflows, best practices, and other issues.</li><li>Conduct statistical modeling and experiment design, test and validate predictive models.</li><li>Conducts scalable data research, on and off the cloud.</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3468551283"},
{"title": "Data Scientist", "location": "\n              Missouri, United States\n            ", "company_name": "\n                Envision\n              ", "position_name": "Data Scientist", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting and Biotechnology Research\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>***W2 Candidates Only***</p><p><br></p><ul><li>MS Computer Science, Engineering, Technology, Mathematics, Statistics, or related field with 3+ years of industry experience or BS + 5 years' experience </li><li>Hands on coding experience with Python building end-to-end systems as an MLOps Engineer, Machine Learning Engineer, Software Engineer, or equivalent </li><li>Experience in ML model development, orchestration, deployment, monitoring, support and creating and maintaining deployment pipelines with CI/CD tools </li><li>Experience with cloud computing platforms like AWS, GCP, or other cloud providers developing with containers (e.g., Docker, Kubernetes) in cloud computing environments </li></ul><p><br></p><p>***W2 Candidates Only***</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3477350784"},
{"title": "Senior Scala Engineer", "location": "\n              Austin, Texas Metropolitan Area\n            ", "company_name": "\n                Signify Technology\n              ", "position_name": "Senior Scala Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          Staffing and Recruiting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>Senior Scala Engineer - Fully Remote - 12 months Contract</p><p><br></p><p>This is a brand new and highly sought-after Scala Engineering contract position (can extend or convert to fulltime), one of the hottest jobs on the market right now, working for an extremely interesting fintech company. They are particularly very well positioned against the economy, so any downturn in the market will not effect this company! A real selling point for this position! Great benefits, great money and great culture!</p><p><br></p><p>You will be a senior developer where, as well as the technical work, you will mentor junior staff and be a real technical point of contact for the team.</p><p><br></p><p><u>Responsibilities</u></p><ul><li>Writing clean, high-quality, high-performance, maintainable code</li><li>Develop and support software including applications, database integration, interfaces, and new functionality enhancements</li><li>Coordinate cross-functionally to insure project meets business objectives and compliance standards</li><li>Support test and deployment of new products and features</li><li>Participate in code reviews</li></ul><p><br></p><p><u>Qualifications</u></p><ul><li>Minimum of 5+ years of relevant professional work experience</li><li>Excellent professional experience in Scala (any Scala tech stack would be suffice)</li><li>Experience working individually or within a team to complete projects</li><li>All Scala stack experience are welcomed! i.e. Lightbend Akka, FP, Cats, Zio etc</li></ul><p><br></p><p><br></p><ul><li>Key Words: Scala, Functional Programming, FP, Akka, Cats, Zio, Scala, Functional Programming, FP, Akka, Cats, Zio, Scala, Functional Programming, FP, Akka, Cats, Zio, Scala, Functional Programming, FP, Akka, Cats, Zio, Scala, Functional Programming, FP, Akka, Cats, Zio, Scala, Functional Programming, FP, Akka, Cats, Zio,</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3420140840"},
{"title": "Machine Learning Engineer", "location": "\n              United States\n            ", "company_name": "\n                InterEx Group\n              ", "position_name": "Machine Learning Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>Our client is a Fortune 500. The ideal candidate's favourite words are learning, data, scale, and agility. You will leverage your strong collaboration skills and ability to extract valuable insights from highly complex data sets to ask the right questions and find the correct answers.</p><p><br></p><p><u>Responsibilities</u></p><ul><li>Analyze raw data: assessing quality, cleansing and structuring for downstream processing</li><li>Design accurate and scalable prediction algorithms</li><li>You will be collaborating closely with our Data Science org</li><li>Collaborating with the engineering team to bring analytical prototypes to production</li><li>Generate actionable insights for business improvements</li></ul><p><br></p><p><u>Qualifications</u></p><ul><li>Bachelor's degree or equivalent experience in a quantitative field (Statistics, Mathematics, Computer Science, Engineering, etc.)</li><li>At least 4 years' of experience in quantitative analytics or data modelling</li><li>Deep understanding of predictive modelling, machine learning, clustering and classification techniques, and algorithms</li><li>Fluency in a programming language (Python, C,C++, Java, SQL)</li><li>Familiarity with Big Data frameworks and visualization tools (Cassandra, Hadoop, Spark, Tableau)</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3476847767"},
{"title": "Full Stack Engineer", "location": "\n              Los Angeles Metropolitan Area\n            ", "company_name": "\n                STAND 8 Technology Services\n              ", "position_name": "Full Stack Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>STAND 8 is a global leader providing end-to-end IT Solutions. We solve business problems through PEOPLE, PROCESS, and TECHNOLOGY and are looking for individuals to help us scale software projects designed to change the world!</p><p>We are hiring for a <strong>Full Stack Engineer </strong>for a top banking partner leading their field. If you are ready to create an impact in a collaborative and fast-paced environment, this could be a great opportunity for you!</p><p>Will help design and development of cross-functional, multi-platform application systems. Writing great quality code with a drive for automated testing and validation based on the You Build You Own (YBYO) model. Perform complex engineering activities for performance tuning, monitoring, deployment and production support. Research, influence and implement vendor dependency to simplify the architecture. Implement, maintain and update CI/CD pipelines on a cloud environment. Work with business partners, architects and other groups to identify technical and functional needs of systems based on priority. Collaborate with multiple, enterprise-wide distributed performing teams to deliver new capabilities in business applications. Design and develop API’s for Omni-channel clients.</p><p><strong><u>Required</u></strong></p><ul><li>Minimum of 1-2 years of software development experience</li><li>Minimum of 1-2 years of experience in frontend JavaScript development frameworks and tooling: VueJS, React, Angular (VueJS preferred) &amp; NPM, Gulp, Grunt, Yarn, etc.</li><li>Minimum of 1-2 years working on UI/UX development &amp; design systems: CSS, Web Components, Less, Sass</li><li>Minimum of 1-2 years of experience in object oriented programming: Java, .NET, Python</li><li>Minimum of 1-2 years of API development experience: Node, .NET, Java, Python</li><li>Minimum of 1-2 years of experience managing software development projects through complete release cycles</li><li>Minimum of 1-2 years of experience in build and CICD technologies: GitHub, BitBucket, Azure DevOps, Maven, Jenkins, Nexus or Sonar</li><li>Minimum of 1-2 years of experience in quality assurance technologies: ATDD, Selenium, Cucumber, JUnit, NUnit, SoapUI or Postman</li></ul><p><strong><u>Preferred</u></strong></p><ul><li>1-2 years in full stack development for cloud solutions (Azure or AWS) - Azure preferred</li><li>1-2 years of experience in cloud technologies: Azure(big plus), AWS, GCP</li><li>1-2 years of experience with containers and orchestration: Docker, Kubernetes, etc.</li><li>1-2 years of Scaled agile experience</li></ul><p><strong><u>Nice to have</u></strong></p><ul><li>Experience in Unix Shell scripting</li><li>Certified in .Net, Java, Spring or cloud technologies</li><li>Exposure of data management methodologies</li></ul><p><br></p><p>The US base salary range for this contract position is $70-$80/hour. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target for new hire salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training.</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3367313400"},
{"title": "Sr Data Scientist", "location": "\n              New York, United States\n            ", "company_name": "\n                InterEx Group\n              ", "position_name": "Sr Data Scientist", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology and Engineering\n          ", "company_sector": "\n          Staffing and Recruiting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>My client are a Global Retail Brand, with over 30,000 employees and just shy of $300 Billion in revenue for 2022.</p><p><br></p><p>I am currently working closely with their Vice President of Data and Analytics, he has recently joined the business to further grow out their Data Science and Machine Learning organization.</p><p><br></p><p>Data &amp; Analytics is a strategic focus area for the company currently and they are investing heavily.</p><p><br></p><p>They are currently searching for 1 Senior Data Scientist to drive the team and to support their organizations goals for the rest of 2022 and 2023.</p><p>Responsibilities</p><ul><li>Ability to run and prioritize multiple tracks of work, ensuring high-quality output on- time delivery</li><li>Identify and improve the execution of the full Analytics &amp; Data Science team</li><li>Proven experience building positive working relationships in cross-functional teams,</li><li>Collaborate with engineering team to bring analytical prototypes to production.</li><li>Expertise in in metric development, statistical analysis, and intuitive reporting.</li></ul><p><br></p><p><br></p><p>Qualifications</p><ul><li>Master’s or Bachelor's degree in Math, Statistics, Psychology, Economics, Computer Science, or similarly quantitative fields.</li><li>Applied Machine Learning experience (regression analysis, time series, probabilistic models, supervised, classification and/or unsupervised learning).</li><li>Strong skills in statistics/machine learning languages and packages such as Python, R, Azure ML.</li><li>2+ years Building Data Scientist models</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3431317441"},
{"title": "Senior Scala Engineer - 12 months remote contract", "location": "\n              Austin, Texas Metropolitan Area\n            ", "company_name": "\n                Signify Technology\n              ", "position_name": "Senior Scala Engineer - 12 months remote contract", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          Staffing and Recruiting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong><u>Senior Scala Engineer - 12 months extendable contract - Fully remote</u></strong></p><p><br></p><p><strong>NOTE: WE CANNOT USE A THIRD PARTY AGENCIES FOR THIS. </strong></p><p><br></p><p>Wow, what a great opportunity this is! A very long term Scala project here, working for a global specialized manufacturing company who are looking to hire excellent engineers to help build out their platforms and services. A very exciting and new project centred around Scala, Akka (steams, actors), AWS, and large data sets. This would be a position for mid-senior level engineers and/or senior-lead level engineers. There are multiple positions available here!</p><p><br></p><p><strong>Responsibilities</strong></p><p>You will be writing clean and high performing code for services using Scala. You will be responsible for performing all programming responsibilities without being heavily micromanaged. You will drive development activities for business-critical applications and services. You will interact with internal and external users to be able to deliver efficient solutions, as well as make adjustments to existing services to optimize their performance/usage. Above all, you will work in a fun and collaborative working environment.</p><p><br></p><p><strong>Qualifications</strong></p><ul><li>3+ years of professional work experience in Scala</li><li>Expertise in Akka, Akka Streams, Akka Actors</li><li>Heavy experience working with AWS or similar cloud environment</li><li>Excellent experience working with large data sets and structures</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3455346974"},
{"title": "Remote Firmware Engineer", "location": "\n              United States\n            ", "company_name": "\n                Insight Global\n              ", "position_name": "Remote Firmware Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          Staffing and Recruiting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Desired Skills and Experience </strong></p><p><br></p><p>- 4 year degree or equivalent experience (software development preferably)</p><p>- 2-8 years of experience with C++11 or later programming</p><p>- 2-8 years of experience with Linux development tool suites</p><p>- Experience with embedded application development</p><p>- Experience with: Wifi, Bluetooth BLE, Z-Wave, 4G LTE, Zigbee</p><p>- Experience with Serial Device Communication Protocols: SPI, UART, USB &amp; Linux Networking Programming: TLS, SSL, DTLS, TCP/IP</p><p>- Skilled in Vagrant, VirtualBox, Jenkins, Git</p><p><br></p><p><strong>Day-to-Day </strong></p><p><strong><span class=\"ql-cursor\"> </span></strong></p><ul><li>A large technology company is seeking a Jr to Mid-Level Firmware Engineer to join their team. This employee will play a key role in the development by designing, executing, and supporting software application designs throughout project life cycles. You will be responsible for developing Linux kernel drivers, tools to help with firmware development, applications to interact with LTE modem, Z-Wave, Bluetooth BLE, Dect/ULE, and/or Zigbee devices. Additionally, you will support the Products, DevOps, QA, and Hardware teams to develop requirements, unit testing, and software applications.</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3467835379"},
{"title": "Senior Statistical Programmer", "location": "\n              United States\n            ", "company_name": "\n                Clindata Insight Inc\n              ", "position_name": "Senior Statistical Programmer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Analyst, Information Technology, and Consulting\n          ", "company_sector": "\n          Biotechnology Research and Pharmaceutical Manufacturing\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>The Statistical Programmer contractor will be responsible for high quality, traceability, reproducibility, and timeliness of statistical analyses. This is an unique opportunity to join a growing Biometrics team investigating a diverse portfolio of immuno-oncology therapeutics in early development. The ideal candidate will be a highly experienced SAS programmer with years of solid industry experience working in a regulated global environment while also demonstrating know-how, flexibility to shift between projects, ability to seek solutions proactively, and work independently. </p><p><br></p><p><strong>Responsibilities</strong></p><ul><li>Solid, demonstrated experience with CDASH and CDISC data standards (SDTM, ADaM) as well as health authority reporting requirements</li><li>In-depth knowledge of data standards and demonstrated experience in the handling data in diverse types.</li><li>Handles multiple projects or assignments with similar priorities simultaneously. Collaborates with statisticians, internal programming team to perform data analysis and reporting.</li><li>Provides programming support for development or verification of data and analysis.</li></ul><p><br></p><p><strong>Qualifications</strong></p><ul><li>Bachelor’s or Master’s degree in a data science field, e.g., statistics, mathematics, epidemiology, computer science, bioinformatics, or another field with commensurate levels of experience.</li><li>Minimum 6+ years of biotechnology or pharmaceutical experience, with (immuno-) oncology experience preferred.</li><li>Proficient in SAS and SAS macro in validated environments is a must.</li><li>In-depth knowledge in the analysis of clinical trial data, including integrated analysis of clinical trial data with other data types (biomarker, PK/PD, etc.).</li><li>Solid understanding of industry standards such as CDISC, specifically SDTM and controlled terminology and/or ADaM.</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3438943630"},
{"title": "Sr Machine Learning Engineer", "location": "\n              United States\n            ", "company_name": "\n                Burtch Works\n              ", "position_name": "Sr Machine Learning Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering\n          ", "company_sector": "\n          Software Development\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>Senior Machine Learning Engineer</p><p><br></p><p>As a Senior Machine Learning Engineer, you will develop cutting-edge algorithms and</p><p>production machine learning systems for consumer product innovations. You will work with</p><p>design and engineering teams to create intelligent workflows on the platform. Your</p><p>work will translate into new products on the shelf, and ultimately it will benefit millions of</p><p>people’s lives.</p><p><br></p><p>You will:</p><p>● Research, prototype and productionize state-of-the-art machine learning algorithms and</p><p>systems in AI platform.</p><p>● Work on probabilistic graphical models, bayesian inference, optimization, explainable AI</p><p>and causal inference.</p><p>● Automate data analysis, data visualization and build data pipelines.</p><p>● Build and maintain the infrastructure for data and model management.</p><p>● Collaborate with product, engineering and design teams to build intuitive workflows for</p><p>consumer product innovation.</p><p>You are a good fit if you:</p><p><br></p><p>● Have 5+ years of professional experience in machine learning or have a Ph.D. in</p><p>Computer Science, Statistics, Mathematics, or Physics.</p><p>● Have experience in probabilistic graphical models, bayesian inference and optimization.</p><p>● Are proficient with Python and R.</p><p>● Have experience with Python data science stack (e.g., SciPy, NumPy, Pandas, PyTorch).</p><p>● Have demonstrated end-to-end ownership of projects.</p><p>● Have worked in a fast-paced team environment.</p><p>● Can communicate proactively and effectively.</p><p>● (Bonus) Have experience with deep learning, especially transformers and graphical</p><p>neural networks.</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3184133160"},
{"title": "Application Developer", "location": "\n              United States\n            ", "company_name": "\n                EPITEC\n              ", "position_name": "Application Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology and Health Care Provider\n          ", "company_sector": "\n          Insurance\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>Epitec</p><p> </p><p>POSITION:</p><p>Application Developer III</p><p><br></p><p>JOB TYPE:</p><p>Full-time, Contract, Onsite</p><p><br></p><p>LOCATION:</p><p>Detroit, MI</p><p><br></p><p>JOB SUMMARY FOR APPLICATION DEVELOPER:</p><ul><li>API, Java, Spring, SQL</li></ul><p><br></p><p>RESPONSIBILITIES FOR APPLICATION DEVELOPER:</p><ul><li>Code development, maintenance, and deployment</li><li>Leading or assisting application solution design</li><li>Creating unit test cases, creating unit test plans, conducting and/or participating in code reviews, and executing unit testing</li><li>Creating or updating technical documentation from functional documentation</li></ul><p><br></p><p>REQUIRED EXPERIENCE FOR APPLICATION DEVELOPER:</p><ul><li>Bachelor degree required – Computer Science or Equivalent</li></ul><p><br></p><p>SKILLS AND QUALIFICATIONS FOR APPLICATION DEVELOPER:</p><p><em>Top 4 Required Skills/Experience:</em></p><ul><li>Java - Java 7/8</li><li>Must have experience with Spring batch, Maven and its archtypes</li><li>Web Services, REST API</li><li>SQL, Must have experience in writing complex SQL Queries and Stored Procedures</li></ul><p><em>Required Skills/Experience – 7+ years:</em></p><ul><li>Understanding and working knowledge of basic UNIX/Linux commands.</li><li>SDLC methodology</li><li>Developing and executing unit testing</li><li>Code version control</li><li>Written and verbal communication</li><li>Ability to conform with established coding standards</li></ul><p><em>Preferred Skills/Experience – 7+ years:</em></p><ul><li>Application integration solutions</li><li>Batch and real-time solutions</li><li>Relational databases including SQL and stored procedures</li><li>Object-oriented design and development</li><li>Experience with Provider or Payer Health care systems</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3469874626"},
{"title": "High Jump Developer - Remote (202314)", "location": "\n              New Jersey, United States\n            ", "company_name": "\n                Bull City Talent Group\n              ", "position_name": "High Jump Developer - Remote (202314)", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>Our Client is looking for a HighJump Developer to assist with enhancement and roll-out project over the next year.</p><p><br></p><p><strong><em><u>General Summary:</u></em></strong> Must have robust functional and technical understanding of Highjump, operations, processes and data flow with host systems. Must be familiar with SDLC approaches and documentation requirements for SOX compliance. </p><p><br></p><p><strong><em><u>Position Responsibilities: </u></em></strong></p><ul><li> Leverage experience of the HighJump application and the integration to the material handling and ERP Systems</li><li>Must have strong Microsoft platform development skills including around SQL</li><li> Write code as is necessary to support critical WMS functions and to ensure a comprehensive understanding of all technical aspects of the application and integration points </li><li> Review and analyze existing applications’ effectiveness and efficiency, and then develop technical strategies for improving or leveraging these systems</li><li> Develop, maintain and support in-house custom applications</li><li> Follow the required system development life cycle</li><li> Ability to work independently or within a defined project team</li><li> Ability to interact with all levels of management</li><li> Strong communication, interpersonal and problem solving skills</li></ul><p><br></p><p><strong><em><u><span class=\"ql-cursor\"> </span>Position Requirements: </u></em></strong></p><ul><li> 5+ years of Application Development experience with High Jump. A significant portion of this experience must be as a developer, fluency in SQL, Webwise, HighJump Architect Coding</li><li>Familiarity with SSRS Reporting</li><li>Retail Industry experience preferred</li><li> Experience using MS SQL Server 2016 or equivalent; .NET, C# and/ or J2EE or similar technologies (.NET preferred)</li><li> BA/BS degree is required – Or the equivalent in work experience</li><li> Must be able to write MS SQL stored procedures and user-defined functions</li><li> MS SQL Server administration &amp; query performance optimization skills preferred</li><li> Working knowledge of Visual Studio and IIS preferred</li><li> Experience managing source code repository and maintaining a version control system (experience with Aldon or TFS a plus)</li><li> Strong technical skills </li><li> Effective time management and organization skills</li><li> Experience working in a team-oriented, collaborative environment</li></ul><p></p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3311931599"},
{"title": "Senior Software Engineer", "location": "\n              Urbandale, IA\n            ", "company_name": "\n                American Technology Consulting - ATC\n              ", "position_name": "Senior Software Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>Hello Folks,</p><p><br></p><p>Greetings,</p><p><br></p><p>In the era of layoffs, we are looking to fill the Senior Software Engineer role based out of Urbandale, IA (Remote). Duration of the engagement is a 12+ month contract with good market rate. </p><p><br></p><p>Here’s the Job Description &amp; related details for the role.</p><p><br></p><p><strong>Title: Senior Software Engineer</strong></p><p><strong>Location: Urbandale, IA (Remote) </strong></p><p><strong>Duration: 12+ months</strong></p><p><br></p><p><strong>Note:</strong> Client is looking for W2 candidates only</p><p><br></p><p><strong>Relevant work experiences:</strong> Type and amount of experience necessary to perform the essential functions of the job. May include specific roles and/or an understanding of a particular function, organization, industry or product line.</p><ul><li>Product design, test and/or analysis experience. (4 - 7 years)</li><li>Previous experience in programming/software development. (4 - 7 years)</li><li>Software development processes experience. (4 - 7 years)</li><li>Participating in Agile Development (4 - 7 years)</li><li>Experience working in an Agile Environment (4 - 7 years)</li></ul><p><br></p><p><strong>This is specifically targeting Golang and Scala candidates.</strong></p><ul><li><strong>At least five (5) years of experience designing and developing enterprise API solutions and services</strong></li><li>Comfortable developing in Scala and/or Golang</li><li>3+ years’ experience working with AWS based services and infrastructure setup using Infrastructure as Code.</li><li>Experience in AWS Kinesis or Kafka, Lambdas, EC2, ECS architecture, SQS, S3</li><li>Familiarity with microservices concepts</li><li>Experience working on Agile / Scrum teams.</li><li>Experience working with mapping and raster technology is a plus.</li><li>Experience working with Monix is a plus.</li></ul><p><br></p><p><br></p><p><br></p><p>Thanks</p><p>Karan Singh Rawat</p><p>karan.rawat@american-technology.net</p><p>515-309-1851</p><p>Sr. Technical Recruiter || ATC</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3468520817"},
{"title": "Senior Biostatistician", "location": "\n              United States\n            ", "company_name": "\n                Clindata Insight Inc\n              ", "position_name": "Senior Biostatistician", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Science and Research\n          ", "company_sector": "\n          Biotechnology Research and Pharmaceutical Manufacturing\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>We are hiring a Senior Biostatistician who will support multiple projects simultaneously. This is a lead role for the statistical analysis of a clinical project or study in conjunction with other Biometrics functions (DM, programming etc.). This is a with a collaborative team that challenges and generates new ideas.</p><p><br></p><p>Responsibilities</p><ul><li>Works collaboratively with Statistical Programmers, Biostatisticians, Clinical Research Associates, Clinical Data Managers and other Clinical, Global Drug Safety, Regulatory and Project Management staff to meet project deliverables and timelines for statistical data analysis and reporting.</li><li>Provides statistical consultation on trial design and study endpoints, calculates sample sizes and authors statistical analysis plans, utilizes knowledge of Regulatory requirements and guidance documents to provide statistical advice with respect to creating a clinical development program, and uses knowledge of literature to provide data analysis and presentation methods to support publications/presentations.</li><li>Works on 4-6 clinical trials/projects as well as other tasks as assigned by the supervisor.</li><li>Leads a specific component of a departmental strategic initiative.</li><li>Excellent verbal and written communication skills and interpersonal skills are required.</li><li>Must have scientific programming capability with statistical software packages.</li><li>Analyzes and utilizes complex information.</li><li>Anticipates change and reacts quickly and proactively to accommodate business need.</li><li>Proactively solicits views from others to gain common understanding and agreement.</li><li>Leads by example and resolves conflict; manages processes for maintaining team cohesiveness.</li><li>Uses statistical expertise to demonstrate effective persuasion.</li><li>Understands strategic value of information and knows when and when not to communicate it.</li><li>Understand the operations of the Clinical Data Science function with clear expectation of the responsibility from other functional groups.</li></ul><p><br></p><p>Qualifications</p><ul><li>8 years of experience and a BS degree in Biostatistics or equivalent degree.</li><li>5+ years of experience and an MS degree in Biostatistics or equivalent.</li><li>3+ year of experience and PhD degree in Biostatistics or equivalent.</li><li>Industry experience in the statistical analysis of biomedical data using SAS® software is necessary.</li><li>Experience in oncology clinical trials is strongly preferred.</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3424424439"},
{"title": "Senior Machine Learning Engineer", "location": "\n              New York, United States\n            ", "company_name": "\n                InterEx Group\n              ", "position_name": "Senior Machine Learning Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          Staffing and Recruiting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong><u>Senior Role</u></strong></p><p><br></p><p>The ideal candidate's favourite words are learning, data, scale, and agility. You will leverage your strong collaboration skills and ability to extract valuable insights from highly complex data sets to ask the right questions and find the correct answers.</p><p><br></p><p><strong>Responsibilities</strong></p><ul><li>Analyze raw data: assessing quality, cleansing, and structuring for downstream processing</li><li>Design accurate and scalable prediction algorithms</li><li>Collaborate with the engineering team to bring analytical prototypes to production</li><li>Generate actionable insights for business improvements</li></ul><p><br></p><p><strong>Qualifications</strong></p><ul><li>Bachelor's degree or equivalent experience in a quantitive field (Statistics, Mathematics, Computer Science, Engineering, etc.)</li><li>At least 4 years of experience in quantitative analytics or data modelling</li><li>Deep understanding of predictive modelling, machine-learning, clustering and classification techniques, and algorithms</li><li>Fluency in a programming language (Python, CC++, Java, SQL)</li><li>Familiarity with Big Data frameworks and visualization tools (Cassandra, Hadoop, Spark, Tableau)</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3476849156"},
{"title": "100% Remote - Sr. Data Scientist / Data Engineer (Minimum 10+ Years and Must have Big Query, Stack Driver, Postgres, Prometheus, Firebase experiences)", "location": "\n              United States\n            ", "company_name": "\n                Dice\n              ", "position_name": "100% Remote - Sr. Data Scientist / Data Engineer (Minimum 10+ Years and Must have Big Query, Stack Driver, Postgres, Prometheus, Firebase experiences)", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          Technology, Information and Internet\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        Dice is the leading career destination for tech experts at every stage of their careers. Our client, TechAffinity Inc, is seeking the following. Apply via Dice today!<p><br></p><strong>Title: Sr. Data Scientist/ Data Engineer</strong><p><br></p><strong>Location: 100% Remote</strong><p><br></p><strong>Duration: 1 Year</strong><p><br></p>Looking for a Data Scientist/Data Engineer with the ability to do queries for the following.<p><br></p><ul><li>Big Query</li><li>Stack Driver</li><li>Postgres</li><li>Prometheus</li><li>Firebase</li></ul><p><br></p><strong> An example of a solution </strong><p><br></p>We have debug data feeding from our mobile application into stack driver which shows the sequence of a user is traversing. It is hard to compute a percentage of successful configuration attempts by our customers.<p><br></p>Looking at how the data is coming in and passing from stack driver to Big Query I would expect this person to:<p><br></p><ul><li>Talk to the engineers to understand the application flow and current data being passed up to the cloud.</li><li>Look at the data being received into cloud</li><li>Ensure right tools are being used for the task: Stack Driver vs Firebase etc.</li><li>Request any additional information needed from the app developers</li><li>Generate the new queries to solve the question</li><li>Graph the data over time</li></ul><p><br></p><strong>Details of the role:</strong><p><br></p>We are looking for a senior level Data Scientist/Data Engineer . The successful candidate will work with the client leadership team to brainstorm data analytics opportunities, develop reports, and potentially stand up a data science team served from our India development center.<p><br></p><strong>Key responsibilities:</strong><p><br></p><ul><li> Managing master data, including creation, updates, and deletion.</li><li> Managing users and user roles.</li><li> Provide quality assurance of imported data, working with quality assurance analysts if necessary.</li><li> Commissioning and decommissioning of data sets.</li><li> Processing confidential data and information according to guidelines.</li><li> Helping develop reports and analysis.</li><li> Managing and designing the reporting environment, including data sources, security, and metadata.</li><li> Supporting the data warehouse in identifying and revising reporting requirements.</li><li> Supporting initiatives for data integrity and normalization.</li><li> Assessing tests and implementing new or upgraded software and assisting with strategic decisions on new systems.</li><li> Generating reports from single or multiple systems.</li><li> Troubleshooting the reporting database environment and reports.</li><li> Evaluating changes and updates to source production systems.</li><li> Training end-users on new reports and dashboards.</li><li> Providing technical expertise in data storage structures, data mining, and data cleansing.</li></ul><p><br></p><strong>Required Skills:</strong><p><br></p><ul><li> B.S. or equivalent in Computer or Data Science.</li><li> 10+ years work experience as a data analyst or in a related field.</li><li> Ability to analyze existing tools and databases and provide software solution recommendations.</li><li> Ability to translate business requirements into non-technical, lay terms.</li><li> High-level experience in methodologies and processes for managing large-scale databases.</li><li> Demonstrated experience in handling large data sets and relational databases.</li><li> Understanding of addressing and metadata standards.</li><li> High-level written and verbal communication skills.</li><li> Experience with Data Analytics Tools such as Excel, Python, R, Jupyter, Spark, and Tableau.</li><li> Cloud experience in Google Cloud Platform</li><li> provided by Dice</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3478375375"},
{"title": "Data Engineer", "location": "\n              United States\n            ", "company_name": "\n                Vectorsoft\n              ", "position_name": "Data Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Consulting and Business Development\n          ", "company_sector": "\n          Software Development and Consumer Services\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>We're Looking for Data Engineer</strong></p><p><strong>4+ Years</strong></p><p><strong>Remote-Onsite</strong></p><p><strong> Note: We're Filing For H1 Visa as well</strong></p><p><strong>Filing H1 for OPTEAD, STEM OPT, CPT, H1b Transfer.</strong></p><p><strong>Contract- W2 / C2C</strong></p><p><strong> </strong></p><p><strong>Job Description:</strong></p><ul><li>Partner with leadership, engineers, program managers and data scientists to understand data needs.</li><li>Gathering technical requirement from customer and enable the right team to develop and implement it.</li><li>Experience designing and building scalable and robust data pipelines to enable data-driven decisions for the business.</li><li>Understand business processes, logical data models and relational database implementations for data analysis.</li><li>Build data expertise and implement own data quality test cases for required areas.</li><li>Expert knowledge of SQL and of relational database systems and concepts.</li><li>Expert knowledge in Azure Data Factory, Data bricks Script, Scope Scripts, Cosmos etc.</li><li>Demonstrated strength in data modeling, ETL development, and data warehousing</li><li>Develop, implement and tune ETL processes.</li><li>Experience analyzing data to discover opportunities and address gaps.</li><li>Develop and maintain data pipelines including solutions for data collection, management, and usage.</li><li>Develop and implement solutions for data quality validation and continuous improvement.</li><li>Drive our data platform and help evolve our technology stack and development best practices</li><li>Develop and unit test assigned features to meet product requirements.</li><li>Working knowledge of data quality approaches and techniques.</li><li>Programming language experience (C#, Python, Scala Spark.) is a plus.</li><li>Build visualizations in Power BI to help derive meaningful insights from data.</li><li>Maintain and enhance our data and computation platform up and running.</li><li>Accountable for ensuring that project tasks are accomplished to schedule at acceptable level of quality; or that appropriate contingencies are implemented.</li><li>Ensure documentation of all project artefacts are accurate and current.</li><li>Ensure all projects are delivered successfully and according to Engagement statement of work process, methodology, and quality standards.</li></ul><p><br></p><p><strong>Solid familiarity on the following tools:</strong></p><ul><li>SQL Azure, Synapse (SQL Data warehouse)</li><li>Azure Data Factory</li><li>Kusto</li><li>Scope Scripts, Cosmos</li><li>Power BI</li><li>Azure Data Lake, Blob Storage</li><li>Databricks</li><li>Data Quality management. Test Cases etc.</li><li>Data Studio Job</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3477962639"},
{"title": "Sr DevOps Engineer", "location": "\n              United States\n            ", "company_name": "\n                JPMorgan Chase & Co.\n              ", "position_name": "Sr DevOps Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <ul><li>10+ years of experience in DevOps.</li><li>A degree in Computer Science or equivalent Engineering degree</li><li>Experience with Networking, Linux administration</li><li>Experience with Docker</li><li>Experience with CI/CD system such Jenkins/GitLab</li><li>System monitoring and centralized logging platform (Prometheus, ELK)</li><li>Installing and maintaining: Configuration Management tools and Infrastructure as Code: (Terraform, Ansible)</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3476927190"},
{"title": "Software Development Engineer", "location": "\n              United States\n            ", "company_name": "\n                Eliassen Group\n              ", "position_name": "Software Development Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology and Engineering\n          ", "company_sector": "\n          IT Services and IT Consulting and Staffing and Recruiting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>100% Remote</p><p><br></p><p>We have a great opportunity for a Software Development Engineer to design, develop, and deliver a company-wide reporting system for a large healthcare organization.</p><p><br></p><p><em>This opportunity is not available to c2c contractors. Due to client requirement, applicants must be willing and able to work on a w2 basis. For our w2 consultants, we offer a great benefits package that includes Medical, Dental, and Vision benefits, 401k with company matching, and life insurance.</em></p><p><br></p><p><strong>Requirements of the Software Development Engineer:</strong></p><p><br></p><ul><li>Bachelor’s degree from a four-year university or college; or related work in technical school; or relevant experience</li><li>5+ years of software development experience</li><li>2+ years of experience with SQL Server with the ability to design and develop databases, write T-SQL stored procedures, troubleshoot slow queries, and create table indexes</li><li>Experience with C#, Blazor, JavaScript, CSS, HTML5, Entity Framework, MVS, jQuery and Bootstrap</li><li>ASP.NET Framework and .NET Core development experience</li><li>Experience working with Visual Studio</li><li>Ability to write, maintain, test and debug code in C#</li><li>Ability to design enterprise scale solutions</li><li>Advanced proficiency with HTML</li><li>Ability to successfully manage numerous projects simultaneously</li></ul><p><br></p><p><em>Please be advised- If anyone reaches out to you about an open position connected with Eliassen Group, please confirm that they have an Eliassen.com email address and never provide personal or financial information to anyone who is not clearly associated with Eliassen Group. If you have any indication of fraudulent activity, please contact InfoSec@eliassen.com.</em></p><p><br></p><p><em><span class=\"ql-cursor\"> </span></em>Job ID: 375273</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3471574524"},
{"title": "Machine Learning Ops Engineer", "location": "\n              Austin, TX\n            ", "company_name": "\n                Wimmer Solutions\n              ", "position_name": "Machine Learning Ops Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          Machinery Manufacturing\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Machine Learning Ops Engineer- Remote</strong></p><p><strong>Client Location: Austin, TX</strong></p><p><strong>PLEASE READ- At this time we may only process US Citizens and Green Card Holders (Permanent Residence) no EAD</strong></p><p><strong>Must be able to work for a US based company without requiring visa sponsorship.</strong></p><p><br></p><p>We’re seeking a MLOps data Engineer specializing in data and cloud infrastructure to join our team. Our machine learning platform helps manage the various components of the ML application development life cycle, starting from data ingestion, annotation, exploration to model training, deployment, and monitoring. All these components are interdisciplinary, so you will be working closely with roboticists, ML researchers and Safety &amp; Perception teams.</p><p>A well-qualified candidate for this position will be a problem-solver who is capable of exhibiting deftness to handle multiple simultaneous competing priorities and deliver solutions in a timely manner. You like to automate anything which you do, and you document it for the benefit of others. The candidate should be adept at prioritizing multiple issues and have strong expertise in troubleshooting complex production issues.</p><p><br></p><p>WHAT YOU GET TO DO</p><p>• Monitor, investigate and fix issues of data ingestion and training pipeline as L1 support.</p><p>• Identify patterns of data ingestion and pipeline issues, propose short- and long-term solutions and actively participate in developing the solutions.</p><p>• Provide data and infra support to internal Jupiter teams and work collaboratively with other developers in Jackson, IT and Platform team to figure out a resolution.</p><p>• Provide guidance to improve the stability, security, efficiency, and scalability of systems.</p><p>• Help improve our code quality through writing unit tests, automation and performing code reviews.</p><p>WHAT YOU BRING</p><p>• A BSc. or MSc. degree in Computer Science / Software engineering is required.</p><p>• 3+ years of professional backend software development experience.</p><p>• Experience in supporting highly scalable data systems and services written in Python.</p><p>• Strong communication skills and ability to work effectively across multiple technical teams.</p><p>• Experience building ETL workflows and Data Warehouse solutions.</p><p>• Solid understanding of relational and non-relational database systems</p><p>• Experience with Docker, CI/CD build systems like Jenkins/Team city, AWS services like S3, DynamoDB, EC2, ECR, lambda, SQS, SNS etc.</p><p>• Have a passion for automation by creating tools using Python.</p><p>• Bachelor's Degree or higher in Computer Science, Math, or another quantitative field</p><p>• Bonus points if you have expertise in migrating, supporting the applications on Kubernetes &amp; services on third party clouds.</p><p>• Bonus points if you have experience with Cloud workflow platforms such as Kubeflow.</p><p>• Bonus points if you have familiarity with ML Frameworks such as TensorFlow, PyTorch.</p><p>• Bonus points if you have experience in Infrastructure templating tools like Terraform or CloudFormation.</p><p><br></p><p><strong>Must be able to work for a US based company without requiring visa sponsorship.</strong></p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3348098378"},
{"title": "C# Developer + React", "location": "\n              United States\n            ", "company_name": "\n                KORE1\n              ", "position_name": "C# Developer + React", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          Staffing and Recruiting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Qualifications</strong> </p><p> 8+ years of experience implementing effective solutions. Hands on experience using the following technologies: </p><p> C#, React </p><p> REST APIs </p><p> SQL, SSIS </p><p>NHibernate </p><p> Entity Framework, EF Core, Dapper</p><p> </p><p><br></p><p>ABOUT KORE1 Specializing in professional and technical recruiting, KORE1 is committed to supporting top IT, Engineering, Creative, Scientific, Accounting and Finance professionals in their career paths. We build deep relationships with leading companies, connecting them to exceptional talent every day. With extensive industry expertise and unmatched opportunities, our goal is to provide a unique experience for our contractors and consultants as they prepare for their next role. We are passionate about matching the right people with the right companies. Kore1 provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Kore1 complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training. Kore1 expressly prohibits any form of workplace harassment based on race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability, or veteran status. Improper interference with the ability of Kore1's employees to perform their job duties may result in discipline up to and including discharge. In accordance with Pay Transparency Laws, salary ranges are provided, and compensation will be determined using the hiring range listed below and factors including, but not limited to, skillset, level of experience, education, and physical work location, to the extent consistent with applicable law.</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3455161036"},
{"title": "Data Engineer", "location": "\n              United States\n            ", "company_name": "\n                SoftStandard Solutions\n              ", "position_name": "Data Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>Job Brief</p><p><br></p><p>We are looking for an experienced data engineer to join our team. You will use various methods to transform raw data into useful data systems. For example, you’ll create algorithms and conduct statistical analysis. Overall, you’ll strive for efficiency by aligning data systems with business goals.</p><p>To succeed in this data engineering position, you should have strong analytical skills and the ability to combine data from different sources. Data engineer skills also include familiarity with several programming languages and knowledge of learning machine methods.</p><p>If you are detail-oriented, with excellent organizational skills and experience in this field, we’d like to hear from you.</p><p><br></p><p>Responsibilities:</p><ul><li>Analyze and organize raw data</li><li>Build data systems and pipelines</li><li>Evaluate business needs and objectives</li><li>Interpret trends and patterns</li><li>Conduct complex data analysis and report on results</li><li>Prepare data for prescriptive and predictive modeling</li><li>Build algorithms and prototypes</li><li>Combine raw information from different sources</li><li>Explore ways to enhance data quality and reliability</li><li>Identify opportunities for data acquisition</li><li>Develop analytical tools and programs</li><li>Collaborate with data scientists and architects on several projects</li></ul><p><br></p><p>Requirements and skills:</p><ul><li>Previous experience as a data engineer or in a similar role</li><li>Technical expertise with data models, data mining, and segmentation techniques</li><li>Knowledge of programming languages (e.g., Java and Python)</li><li>Hands-on experience with SQL database design</li><li>Great numerical and analytical skills</li><li>Degree in Computer Science, IT, or similar field; a Master’s is a plus</li><li>Data engineering certification (e.g IBM Certified Data Engineer) is a plus.</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3477157664"},
{"title": "Lead DevSecOps/OpenShift (Kubernetes) Engineer..............Lansing, MI", "location": "\n              Lansing, MI\n            ", "company_name": "\n                Software People Inc.\n              ", "position_name": "Lead DevSecOps/OpenShift (Kubernetes) Engineer..............Lansing, MI", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Other\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <strong>Client: State of MI<br><br></strong><strong>Phone/Skype Hire. Candidates will need to be onsite 2 days a week. No exceptions. Please list the candidates' CURRENT location and SIGN hybrid work agreement.<br><br></strong><strong>Location: Lansing, MI<br><br></strong><strong>Duration: 12+ months<br><br></strong><strong><u>Responsibilities<br><br></u></strong>This positions functions as lead DevSecOps/OpenShift (Kubernetes) engineer responsible for the supporting large projects. Contributes considerable business and technical knowledge to complex IT projects. The DevSecOps/OpenShift (Kubernetes) Engineer will provide leadership and direction, mentoring team members to drive organizational maturity. The DevSecOps/OpenShift (Kubernetes) Engineer will also consult with development teams to ensure platform fit aligned to the business application requirements. Additionally, understanding of APIs, micro-services development, containers and supporting platform technologies is also required.<br><br><strong><u>Skills Needed<br><br></u></strong>8+ years of experience working on Kubernetes/OpenShift.<br><br>8+ years of experience in Linux shell scripting<br><br>5 years as in expert in application containerization management<br><br>Experience in DevSecOps practices, infrastructure, scripting/programming<br><br>5 Plus years of experience with following skill sets<br><ul><li>OpenShift</li><li>Azure DevOps</li><li>ELK Stack</li><li>Docker</li><li>SonarQube</li><li>Linux</li><li>Bash</li><li>Shell</li><li>S2I</li><li>Python</li><li>NGINX</li><li>WebSphere</li><li>LDAP<br></li></ul><strong><em>Thanks <br><br></em></strong><strong><em>Neeraj Singh</em></strong>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3476237726"},
{"title": "Python Developer", "location": "\n              United States\n            ", "company_name": "\n                Feuji Inc\n              ", "position_name": "Python Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Title: Python Developer </strong></p><p><strong>Duration: Very Long Term</strong></p><p><strong>Location: 100% Remote</strong></p><p><br></p><p><strong>Note: Only W2, No Corp - Corp</strong></p><p><strong> </strong></p><p><strong> </strong></p><p><strong>Job Description</strong></p><ol><li>Sound knowledge of B/E technology stack such as Python/Node.JS/Ruby/Java. </li><li>Practical understanding of HTML, CSS, and JavaScript. </li><li>Experience working on architectures involving one or more of the following concepts and their implementation: XML/JSON message processing, REST API, GraphQL, Object Relational Mapping, asynchronous web services and distributed message queues. </li><li>Growth mindset - motivated by experimentation, moving metrics and delivering an outstanding user experience </li><li>Experience working on scalable architecture which can handle high volumes of data required for building out of our cloud-based platform </li><li>Experience writing tests for written code (unit tests, regression tests, integration tests etc.) </li><li>Experience with SAS platform. </li><li>Quick learner and keen to learn new tools, languages, and technologies 8. Professional experience working with Django, React or Ember.js is preferred</li></ol><p><br></p><p><br></p><p><strong>Best regards,</strong></p><p><strong>Arun Sharma</strong></p><p><strong>Talent Acquisition Lead</strong> | <strong>Feuji, Inc</strong></p><p><strong>Direct: (972) 656-1798, 703-420-7916</strong>| arun.s@feuji.com</p><p>105 Decker court, Suite # 850, Irving, TX, 75062</p><p><strong>USA | Costa Rica | India</strong></p><p><strong>Core Values:</strong> Wow the customer | Simpler is better | Walk the talk | Spread the cheer | Pay it forward</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3478123082"},
{"title": "100% Remote UX Engineer with Thriving Fortune 10", "location": "\n              Greater Minneapolis-St. Paul Area\n            ", "company_name": "\n                Modis\n              ", "position_name": "100% Remote UX Engineer with Thriving Fortune 10", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          Hospitals and Health Care\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Akkodis is seeking a UX Engineer for a 100% remote contract position with our thriving Fortune 10 health client. </strong></p><p><br></p><p><strong>Pay Range: $50-60/hr W2</strong></p><p><br></p><p><strong>Responsibilities:</strong></p><p>• This position is opened to support engineering teams, working on Clinical Product Platform (CPP)</p><p><strong> </strong>• Solicits for understanding and clarifying of business requirements by asking probing questions and helping in prioritization</p><p><strong> </strong>• Leads end to end business requirements gathering process ; Conduct sessions utilizing collaboration boards like Miro</p><p><strong> </strong>• Gather insights and test concepts with users in order to inform design decisions</p><p><strong> </strong>• Reuse templates, patterns and design standards to solve problems</p><p><strong> </strong>• Identify UX issues in designs, products and services</p><p><strong> </strong>• Assist with training for peers and clients</p><p><strong> </strong>• Experience in combining with Agile methodology and scrum teams.</p><p><strong> </strong>• Plan and estimate efforts for UX design activities and projects</p><p><strong> </strong>• Understand and design products following on accessibility compliant guidelines like WCAG, 508 compliance.</p><p><strong> </strong></p><p><br></p><p><strong> Of the required skills listed, which would you consider the top 3?</strong></p><p><strong> </strong>• Experience in AxureXP or Figma</p><p><strong> </strong>• Skilled in HTML; CSS</p><p><strong> </strong>• Experienced in creating modern UI; Capturing Journey Maps, Personas, Story boards and PowerPoint presentations</p><p><strong> </strong></p><p><strong><span class=\"ql-cursor\"> </span></strong></p><p><strong> What experience will set candidates apart from one another?</strong></p><p><strong> </strong>• Solicits for understanding and clarifying of business requirements by asking probing questions and helping in prioritization</p><p><strong> </strong>• Leads end to end business requirements gathering process ; Conduct sessions utilizing collaboration boards like Miro</p><p><strong> </strong>• Gather insights and test concepts with users in order to inform design decisions</p><p><br></p><p>If you are interested in this UX Engineer job then please click APPLY NOW. For other opportunities available at Akkodis go to<strong> </strong>www.akkodis.com. If you have questions about the position, please contact Scott Berman at 914-960-2777 or scott.berman@modis.com.</p><p><br></p><p>Equal Opportunity Employer/Veterans/Disabled</p><p><br></p><p>Benefit offerings include medical, dental, vision, term life insurance, short-term disability insurance, additional voluntary benefits, commuter benefits and 401K plan. Our program provides employees the flexibility to choose the type of coverage that meets their individual needs. Available paid leave may include Paid Sick Leave, where required by law; any other paid leave required by Federal, State or local law; and Holiday pay upon meeting eligibility criteria. <em>Disclaimer: These benefit offerings do not apply to client-recruited jobs and jobs which are direct hire to a client</em></p><p><em> </em></p><p>To read our Candidate Privacy Information Statement, which explains how we will use your information, please visit<strong> </strong>https://www.modis.com/en-us/candidate-privacy/</p><p><br></p><p>The Company will consider qualified applicants with arrest and conviction records.</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3469827046"},
{"title": "DevOps Engineer", "location": "\n              Tampa, FL\n            ", "company_name": "\n                Burtch Works\n              ", "position_name": "DevOps Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering, Information Technology, and Design\n          ", "company_sector": "\n          Software Development, Computer and Network Security, and Consumer Services\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Job Description: </strong></p><p><strong> </strong></p><p>Seeking a driven, passionate DevOps Engineer experienced with developing solutions for various platforms, on-prem, Azure and AWS. The ideal candidate has a site reliability engineer mindset, has technical depth and hands-on experience of DevOps practices, and works well within a team. The DevOps Engineer provides solutions and support to the entire delivery pipeline to facilitate improved collaboration, version control, standardization of environments, continuous integration, continuous deployment, continuous delivery with an emphasis on using automation to improve quality checks and deployment efficiencies, to support faster and more reliable delivery and development cycles. You demonstrate a high degree of accuracy and quality, understand, and pursue current and emerging technologies. </p><p><br></p><p><strong>Functions: </strong></p><p><br></p><ul><li>Design and implement solutions to automate the CI/CD pipelines for applications.</li><li>Build systems that dynamically scale</li><li>Version Control and Merging</li><li>Infrastructure provisioning, configuration, management, and monitoring</li><li>Administer internal tools - Azure DevOps toolset, JIRA, TeamCity</li><li>Develop accurate time and effort estimates for self and team</li><li>Identify, troubleshoot, and resolve system and deployment issues</li><li>Collaborate with multiple feature development teams to identify infrastructure needs and requirements for building and deploying their applications into shared environments.</li><li>Work closely with development teams as SME to ensure deployable solutions that support best practices</li><li>Ability to work in a fast-paced, collaborative team environment </li><li>Evaluate and recommend new tools, software, or practices that contribute to overall improvement</li></ul><p>Perform maintenance and upgrade to internal tools</p><p><br></p><p><strong>Required Skills &amp; Competencies</strong></p><p><br></p><p>· Experience in AWS, Azure, Virtualized technology</p><ul><li>Experience building CI/CD pipelines</li><li>Experience with Azure Repos, Pipelines and Artifacts</li><li>Experience with JIRA, Confluence, TeamCity, Azure Boards</li><li>Experience in Configuration Management</li><li>Experience in installing, configuring, and administering Version Control (TFS, Git)</li><li>Experience in Infrastructure provisioning on-Prem and in Cloud</li><li>Experience in Infrastructure as Code leveraging tools like Terraform</li><li>Relational Database Experience</li><li>Fluency with test runners, scripting, TFS, Xamarin Test Cloud</li><li>Coding/Scripting experience (i.e Python, Groovy, PowerShell, Bash, C#)</li><li>Fluency in WiX and SetupBuilder to support package setup</li><li>Assist in planning, organizing, and coordinating technical activities and work assignments</li><li>Excellent analytical and problem-solving skills with a high aptitude to learn</li><li>Excellent written and verbal communication skills</li><li>Strong interpersonal and presentation skills</li><li>Strong organizational skills, with the ability to effectively prioritize and multi-task</li></ul><p>Experience implementing Application Security Testing tools preferred</p><p><br></p><p><strong>Education / Prior Work Experience</strong></p><p><br></p><ul><li>Bachelor’s degree or 4 more years of work-related experience</li><li>3+ years of deep, practical expertise installing, configuring, and maintaining enterprise-scale software products and solutions</li></ul><p><br></p><p> </p><p><strong>Keywords: </strong>DevOps, Engineer, Azure, AWS, CI/CD pipelines, terraform, infrastructure, JIRA, cloud, SetupBuilder, Python, Bash, C#, security, software products and solutions.</p><p><strong>Resumes to:</strong> trichman@burtchworks.com</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3443312547"},
{"title": "AWS Cloud Engineer", "location": "\n              United States\n            ", "company_name": "\n                DataEdge Consulting\n              ", "position_name": "AWS Cloud Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Cloud Engineer / Remote / Long term Contract</strong></p><p><strong> </strong></p><p><strong><em><u>Key Skills:</u></em></strong></p><p>CloudFormation / EC2 / S3 / IAM / VPC / CICD / SSM / SG / CloudWatch / EBS</p><p><br></p><p><strong><em><u>Qualifications:</u></em></strong></p><ul><li>AWS Certifications highly desired</li><li>5 years’ experience developing infrastructure and platform pipelines for agile delivery to application teams.</li><li>Experience with AWS, VPC, AZs, Subnets, Route53, ALB/NLB, WAF, Stacksets, Security Groups, NACLs, EC2, Systems Manager, Azure Devops, Ansible, Jenkins</li><li>Strong knowledge of Windows and Linux operating systems. RHEL 6.x/7.x, CentOS, SUSE and Windows Server 2008 R2 and greater.</li><li>Fundamental networking/distributed computing environment concepts</li><li>(Routing protocols, DHCP, DNS, TCP/IP)</li><li>Understanding of Monitoring tools like Splunk, CloudWatch and Zabbix</li><li>Server virtualization technologies (VMware/vCenter, Hyper-V)</li><li>Troubleshooting software and hardware issues including root cause analysis</li><li>Strong developer mindset with experience developing in CloudFormation, Terraform, Python, YAML, JSON.</li><li>Strong platform engineering background automating provisioning of resources in AWS.</li><li>Experiences building infrastructure as code CICD pipelines using CloudFormation, Gold Images, configuration management automation.</li><li>Engineering automated, repeatable platform solutions on AWS that allow easy to use self-service capabilities for application teams.</li><li>Strong understanding of security constructs in AWS including LoadBalancers, WAF, SGs, NACLs, Patching, CloudTrail, Guard Duty, etc.</li><li>Strong background building automated self service capabilities in AWS</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3477055747"},
{"title": "Webfocus Developer", "location": "\n              United States\n            ", "company_name": "\n                Marchon Partners\n              ", "position_name": "Webfocus Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology, Engineering, and Analyst\n          ", "company_sector": "\n          IT Services and IT Consulting, Insurance, and Hospitals and Health Care\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>Description:</p><p>We are seeking a self-motivated and self-directed analyst/developer to drive the design and development of data analytics tools and reports. This position requires excellent data analysis skills, tools development, and a big-picture perspective. Strong interpersonal and communication skills are a must as this position involves collaboration with teams across the organization.</p><p> </p><p> • Minimum of 3 years of design and development experience working with WebFOCUS 8.x in the following: AppStudio, ReportCaster, master file/metadata development, Cascading Style Sheets, synonym creation, managed reporting, ad hoc reports, dashboards, customization, and portal development</p><p> • Prior experience supporting BI tool migration efforts/change management administration</p><p> • Minimum of 2 years of experience working large data environments with SQL and Relational Databases such as DB2 and SQL Server</p><p> • Strong SQL programming skills</p><p> • Applied knowledge of Java Script, jQuery, HTML5</p><p> • Experience developing parameter driven compound reports using WebFOCUS (8.0 or higher) and document the various steps taken during all phases of development and implementation</p><p> • Creates esthetically engaging data visualizations and user interfaces using the power of color theory and user-centered design thinking</p><p> • Strong verbal and written communication skills</p><p> • Proven analytical and problem solving skills</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3477218826"},
{"title": "Workday Integration Developer", "location": "\n              United States\n            ", "company_name": "\n                Robert Half\n              ", "position_name": "Workday Integration Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Project Management and Information Technology\n          ", "company_sector": "\n          Staffing and Recruiting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Workday Integration Developer</strong></p><p><strong>LOCATION: Remote – EST hrs</strong></p><p><strong>Start Date: 2/27</strong></p><p><strong>LOA: 3-6 months</strong></p><p><br></p><p>Job Description:</p><p>A current Robert Half client is looking for a Workday Integration developer. This person will support the Business Systems and HRIS teams focusing in development, configuration, maintenance and testing. They will be monitoring Workday integrations and reports for their global workforce. They like this person to be able to proactively identify blockers to their work and engage the help needed. This candidate will also be expected to deliver the documentation with the above. They’ll need to design, develop, modify and test integration solutions using Workday Integration tools (RaaS, EIB, Cloud Connect for Benefits. PECI, Core Connectors, XSLT, Studio). The candidate will also need to create, maintain and support a variety of reports or queries utilizing appropriate reporting tools; assist in development of advanced reports for ongoing customer needs. They’ll be configuring and testing integration security related to their integration work. They will also be configuring, advising on best practices and testing configuration changes in areas like Global Time and Absence and Global Benefits. This person will need to understand and follow integration/development standards and best practices and also create detailed integration specifications, field mapping and testing scenarios to support the integration life cycle. They will need to communicate and collaborate with IT team members, end users and stakeholders during testing and configuration changes, along with any application problems and issues. This candidate will need to ensure that any new integration into the organization systems meets functional requirements, system compliance, security standards and other specifications. This person will monitor and triage the scheduled Workday integrations; Research integration failures, perform root cause analysis and develop plans to mitigate and avoid future system issues.</p><p> </p><p><strong>MUST have skills:</strong></p><p>RaaS development (advanced custom reports/calculated fields, ISU/ISSG configuration, Client API configuration) </p><p>Web Services (Soap/Rest API) , XML, XSLT</p><p>Workday Studio </p><ul><li>Excellent written and verbal communication</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3472327529"},
{"title": "Data Engineer", "location": "\n              United States\n            ", "company_name": "\n                Advantis Global\n              ", "position_name": "Data Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          Software Development\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><em><u>2 Senior Level Roles (5-7 years of experience required)</u></em></p><p><br></p><p><strong>NO C2C</strong></p><p><br></p><p><em><u>Can sit within 200 miles of the following locations: Menlo Park, CA, Seattle, WA, Denver, CO, Washington, DC, New York, NY, Houston, TX, Austin, TX, Chicago, IL Los Angeles, CA, and San Diego, CA</u></em></p><p><br></p><p><strong>Summary</strong>:</p><p>The main function of the Data Engineer is to develop, evaluate, test and maintain architectures and data solutions within our organization. The typical Data Engineer executes plans, policies, and practices that control, protect, deliver, and enhance the value of the organization’s data assets.</p><p><br></p><p><strong>Job Responsibilities:</strong></p><p>• Design, construct, install, test and maintain highly scalable data management systems.</p><p>• Ensure systems meet business requirements and industry practices.</p><p>• Design, implement, automate and maintain large scale enterprise data ETL processes.</p><p>• Build high-performance algorithms, prototypes, predictive models and proof of concepts.</p><p><br></p><p><strong>Required Skills:</strong></p><p>• Ability to work as part of a team, as well as work independently or with minimal direction.</p><p>• Excellent written, presentation, and verbal communication skills.</p><p>• Strong Python/SQL experience</p><p>• Experience with ETL processes</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3467851216"},
{"title": "aem developer", "location": "\n              United States\n            ", "company_name": "\n                TA Digital\n              ", "position_name": "aem developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong><u>Role: AEM developer( with some Sitecore basic experience)</u></strong></p><p><strong> Location: </strong>REMOTE</p><p>Experience- 6 to 12 years</p><p>Description</p><p><br></p><p>Bachelor's degree in Computer Science or related field</p><p>The Full Stack Developer codes software applications based on business requirements. Work assignments will involve moderately complex to complex issues where the analysis of situations or data requires an in-depth evaluation of variable factors. The Full Stack Developer will develop fully fledged platforms which do not need other applications to function.</p><p>Job Description</p><p>We are looking for a Full Stack Developer to produce scalable software solutions. You’ll be part of a cross-functional team that’s responsible for the full software development life cycle, from conception to deployment. As a Full Stack Developer, you should be comfortable around both front-end and back-end coding languages, development frameworks and third-party libraries. You should also be a team player with a knack for visual design and utility.</p><p>• Work with development teams and product managers to ideate software solutions</p><p>• Build the front-end of applications through appealing visual design</p><p>• Write effective APIs</p><p>• Test software to ensure responsiveness and efficiency</p><p>• Troubleshoot, debug and upgrade software</p><p>• Create security and data protection settings</p><p>• Build features and applications with a mobile responsive design</p><p>• Write technical documentation</p><p>• Work in a Scrum/Agile type environment and deliver upon assigned work in a timely manner over the course of an iterative project time-table.</p><p>• Be available for execution or support of production turns.</p><p>• Provide expertise to influence project, initiative, and maintenance technical direction during discovery, planning, and implementation stages.</p><p>• Maintain modern development standards with best-practice approaches and development processes.</p><p>Requirements</p><p>• HTML, CSS, JavaScript, jQuery</p><p>• C#, .NET / Java (Required)</p><p>• <strong>AEM (Required) and some Sitecore (Preferred)</strong></p><p>• Angular, React or Vue.js with Cloud experience</p><p>• Typescript</p><p>• NPM/Node.js (Advanced)</p><p>• SASS</p><p>• W3C Web Standards</p><p>• Accessibility</p><p>• Web performance</p><p>• Cross-browser compatibility</p><p>• Content Management</p><p>• Advanced understanding of modular design patterns</p><p>• Content Management (advanced experience and best-practices)</p><p>• Technical writing/communication skills</p><p>• Unit and Experience Testing (Advanced)</p><p>• Webpack (Advanced)</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3478192004"},
{"title": "Site Reliability Engineer", "location": "\n              California, United States\n            ", "company_name": "\n                The Intersect Group\n              ", "position_name": "Site Reliability Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology and Engineering\n          ", "company_sector": "\n          Entertainment Providers and Media Production\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>About You:</strong></p><p>You have a passion for data, and seek to quantify all things! You thrive on designing systems with an eye towards scale, self-healing, and automation as your guiding principles. You love the challenges of monitoring at large scales, and are compelled by problems of analysis, and large-scale data collection. You are at home with system-engineering challenges and service-based architecture. You have experience with being on-call, and seek-out ways to improve the on-call rotation for the team. You can plan project lifecycles and can evangelize best practices across teams. You are passionate about mentorship and seek to promote a culture of collaboration.</p><p><br></p><p><strong>Your Day-to-Day:</strong></p><p><strong> </strong></p><ul><li>Provide support and guidance of the Observability platform, integrations, and best practices across multiple engineering teams.</li><li>Build and manage Observability infrastructure for a global scale.</li><li>Build self-healing and automated systems on Kubernetes.</li><li>Design and build systems to collect, visualize, and store service health indicators.</li><li>Design Observability tooling utilizing a hybrid of open-source and enterprise solutions.</li><li>Additional other duties and responsibilities, as assigned.</li></ul><p><br></p><p><br></p><p><strong>Key Projects: </strong></p><p><br></p><ul><li>Implementing log collection and storage via Elasticsearch.</li><li>Building visualizations for multiple services, utilizing different types of data sources.</li><li>Working with Prometheus time-series data, producing metrics and integrations.</li><li>Building and supporting robust event queues via Kafka.</li><li>Work with our development teams to instrument their applications and capture events that support our global product deployment.</li></ul><p><br></p><p><br></p><p><strong>Qualifications:</strong></p><p><br></p><ul><li>Bachelor's degree or equivalent experience</li><li>5+ years managing and monitoring Linux systems</li><li>2+ years leading the design and implementation of Cloud systems in AWS/GCP using tools like Terraform, and Kubernetes.</li><li>CI/CD tooling such as Jenkins.</li><li>4+ years’ experience working with monitoring, logging, and visualization tooling, such as Prometheus, Elasticsearch, and Grafana.</li><li>2+ years’ experience programming in a programming language such as Java, Python, Go</li><li>On call experience</li><li>Ability to manage the lifecycle of multiple projects</li><li>Ability to collaborate across teams</li><li>Experience mentoring junior engineers and writing onboarding documentation</li></ul><p><br></p><p><br></p><p><strong>You may also have:</strong></p><p><br></p><ul><li>Experience with Thanos, ArgoCD, Kafka, and/or Kibana</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3468542932"},
{"title": "Jira Developer", "location": "\n              United States\n            ", "company_name": "\n                IDR, Inc.\n              ", "position_name": "Jira Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          Primary and Secondary Education\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong><em><u>JIRA DEVELOPER - OPEN TO C2C - FULLY REMOTE*********</u></em></strong></p><p>Please Attach Your Resume!</p><p><br></p><p>One of our top clients is requesting a new Jira Developer! This specific project will be working with Migration of Jira (on-prem) projects (including workflows, forms, scripts, automations, notifications, permissions, and data) to the Jira (cloud) platform. You will develop and implement enhancements for Jira Software (cloud) and JSM (cloud).</p><p><br></p><p><strong><em><u>JIRA DEVELOPER REQUIRED SKILLS:</u></em></strong></p><ul><li><strong>8 + years experience with Atlassian Jira Implementations(On-prem/ or Cloud)</strong></li><li><strong>4 + years experience with Data Migrations - from Jira platform</strong></li><li><strong>2 + years experience with Adaptivist Scriptrunner (Cloud)</strong></li><li><strong>2 + years experience with Jira API integration to external systems</strong></li></ul><p><br></p><p><strong>Why IDR? </strong></p><ul><li>20+ Years of Proven Industry Experience in 4 major markets</li><li>Employee Stock Ownership Program</li><li>Dedicated Engagement Manager who is committed to you and your success</li><li>Medical, Dental, Vision, and Life Insurance</li><li>ClearlyRated’s Best of Staffing® Client and Talent Award winner 10 years in a row</li></ul><p></p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3471560937"},
{"title": "Senior Cloud Engineer", "location": "\n              Durham, NC\n            ", "company_name": "\n                Vector Technologies LLC\n              ", "position_name": "Senior Cloud Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          Financial Services and Investment Banking\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        Title: Senior Cloud Engineer<br><br>Location: Hybrid from Durham, NC, Westlake, TX (Candidate must be local to location)<br><br>Duration: 12+ Months<br><br>**No H1b, OPT, CPT**<br><br>**Must have Financial domain experience and all required skill**<br><br><strong><u>Required Experience And Skills<br></u></strong><ul><li>Hands-on experience in 2 or more languages (Python, Java, Go etc.).</li><li>Hands-on experience designing and building scalable and resilient applications in the cloud.</li><li>Serverless hands-on development and architecture experience implementing Lambda, API Gateway, Step Functions, etc</li><li>Experience delivering software using engineering best practices and principles.</li><li>Extensive knowledge of infrastructure as code (Terraform, CFT, CDK, etc.).</li><li>Hands-on experience with continuous integration and continuous delivery/deployment.</li><li>Passion for new technologies and cloud trends.<br></li></ul><strong><u>Bonus Skills<br></u></strong><ul><li>Cloud Certifications in AWS.<br></li></ul><strong><u>MUST Have Soft Skills And Technical Skills<br><br></u></strong>(For Dev/Engineering roles) What coding languages are required for this job? What specifically will they need to develop using these? (API's, UI, Integration, Migration, etc.):<br><br>Skills are secondary, they should know their project very well and should be able to speak about the project. Someone who can pick things up very quickly.<br><br>Any AWS or Azure experience will do python<br><br><strong><u>Kubernetes Experience (containers And Dev Ops Skills As Well)<br><br></u></strong>They will be developing within the platform that sits on top of the cloud.<br><br>**We are an Equal Opportunity Employer**<br><br>https://vectortechsol.com/jobs\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3473341199"},
{"title": "C++ Developer", "location": "\n              United States\n            ", "company_name": "\n                Orion Innovation\n              ", "position_name": "C++ Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Science, Information Technology, and Engineering\n          ", "company_sector": "\n          IT Services and IT Consulting, Computer and Network Security, and Government Administration\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>Job Description:</p><p>Software Engineer</p><p><br></p><p>Responsibilities:</p><p>Looking for an experienced software engineer with strong programming skills to help research, build, and enhance systems implementing distributed operations. </p><p>- The successful candidate will have a track record of working effectively in teams, proactively identifying issues, and independently solving problems. </p><p>- The candidate will have demonstrably good communication skills that facilitate collaboration on large systems development efforts. </p><p>- Projects within the lab will typically involve technologies such as microservices, container-based orchestration, machine learning, natural language processing, cyber security, virtualization, HTTPS/TCP/IP networking and operating system internals, thus experience with some or all of these would be a significant plus. </p><p>- Projects will involve a mix of research and development, and will range from applied research to advanced prototyping and demonstrations. </p><p>- The ideal candidate will be one who enjoys learning new skills and is able to work independently.</p><p><br></p><p>QUALIFICATIONS</p><p>BS 10-12, MS 8-10, Phd 5-7</p><p><br></p><p>- Degree in Computer Science, ECE, or a related field</p><p>- Ability to solve problems designing and implementing complex systems independently</p><p>- Strong system skills (Linux, Windows, shell scripting, VM technologies)</p><p>- Experience demonstrating implemented capabilities to customers</p><p>- Strong software development skills (C/C++, Java)</p><p>- Experience with TensorFlow, PyTorch is a plus.</p><p>- Experience with source control tools such as “git”</p><p>- Experience with working in DevSecOps environment</p><p>- Familiarity with networking using PubSub systems, HTTPS, TCP/UDP/IP</p><p>- US citizenship is required. Must be able to get a public trust clearance</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3367187914"},
{"title": "Study Lead Statistician ", "location": "\n              Thousand Oaks, CA\n            ", "company_name": "\n                Aditi Consulting\n              ", "position_name": "Study Lead Statistician ", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Research\n          ", "company_sector": "\n          Medical Equipment Manufacturing, Biotechnology Research, and Pharmaceutical Manufacturing\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Job Title: Study Lead Statistician – Centralized Statistical Monitoring (CSM)</strong></p><p><strong>Location: Remote</strong></p><p><strong>Duration: 6+ Months Contract (Potential to extend)</strong></p><p><strong> </strong></p><p><strong>Description:</strong></p><p><strong>REMOTE</strong></p><p><strong> </strong></p><p><strong>The skillset that we seem to be missing from many of the candidates is the grounding in statistics. Several of the candidates appeared more statistical programmers with limited theoretic knowledge, than the statisticians that we require.</strong></p><p><strong>-------------------</strong></p><ul><li>The Study Lead Statistician / Data Analyst - Centralized Statistical Monitoring (CSM) will work as a key member of the Centralized Statistical Monitoring (CSM) team.</li></ul><p><br></p><ul><li>The ideal candidate will build machine learning and other statistical models, as well as support their implementation and deployment through a good understanding of the Software Development Life Cycle (SDLC). Develop business requirements thru collaborations with cross-functional stakeholders and the use of excellent communication skills.</li><li>Functional requirements, prototype code, good documentation, testing, and relevant visualizations will be expected as deliverables when producing new algorithms as required by the stakeholders. Excellent programming skills required.</li><li>Experience with clinical trials and its data collection process, storage, and quality, are highly desirable.</li><li>The ideal candidate must enjoy the challenge of analyzing disparate data, and program innovative ways to approach it. They must possess good handling of a wide variety of tools to tackle these challenges while exhibiting creativity as well as analytical rigor in so doing. Excellent organization skills will be needed. These will be important when managing information, data sources, and/or user documentation. This person will be able to adapt and abide by controlled processes (SOPs), as they will be working under regulatory requirements from official sources. The candidate must be self-motivated, independent, a fast learner, and demonstrate good time-management skills. Good reporting skills are a plus. Preparation of reports and presentations will be part of their job.</li></ul><p><strong> </strong></p><p><strong>Responsibilities will include among others:</strong></p><p><strong>• Ability to perform data analysis in a wide range of data and analytics solutions, from descriptive to predictive, using advanced statistical and machine learning models</strong></p><p><strong>• Leverage large data sets to conduct end-to end analytics that will include data gathering, requirements specifications, processing, analytics, ongoing deliverables, and presentations</strong></p><p><strong>• Interact cross-functionally with a wide variety of people and teams. Work closely with subject matter experts to deliver value by developing novel, practical, scientific data-driven solutions to meet business needs</strong></p><p><strong> </strong></p><p><strong>Experience:</strong></p><p><strong>• PhD in Statistics or in a related subject with substantial statistical knowledge</strong></p><p><strong>OR</strong></p><p><strong>• Master's degree in Statistics or in a related subject &amp; 2+ years of directly related experience</strong></p><p><strong>OR</strong></p><p><strong>• Bachelor's degree in Statistics or in a related subject &amp; 4+ years of directly related experience</strong></p><p><strong> </strong></p><p><strong>Preferred Qualifications:</strong></p><ul><li>Experience working with large data sets, data mining, and machine learning tools</li><li>A good understanding of clinical data</li><li>Experience working in a software development environment</li><li>Experience constructing data visualizations of clinical data</li><li>Experience with SAS programming and/or R</li><li>Understanding of Clinical Trials</li><li>Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy</li><li>Independent, self-motivated, organized, able to multi-task in time-sensitive environments, and skilled in communication, facilitation, and collaboration</li><li>Familiarity with DevOps and software best practices (i.e., version control, continuous integration, test driven development)</li><li>Excellent communication skills (written and verbal)</li></ul><p><strong> </strong></p><p><strong>***Remote working possible if experienced***</strong></p><p><strong> </strong></p><p><strong>Top 3 Must Have Skill Sets: </strong></p><p><strong>• Limited clinical trials experience</strong></p><p><strong>• Lacked industry experience (academic research)</strong></p><p><strong>• For example a candidate with the right type of academic research (in centralized statistical monitoring) would be of interest.</strong></p><p><strong> </strong></p><p><strong>Day to Day Responsibilities: </strong></p><ul><li>Within the first 30 days a successful placement will fully understand how client performs Centralized Statistical Monitoring (CSM) and able to perform the activities independently.</li></ul><p><strong> </strong></p><p><strong>Employee Value Proposition: </strong></p><ul><li>Career growth, opportunity</li></ul><p><br></p><p><strong>Possible Extension: </strong></p><ul><li><strong>Yes</strong></li></ul><li>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3472351040"},
{"title": "Android Developer Ref 3322", "location": "\n              United States\n            ", "company_name": "\n                TDA Creative\n              ", "position_name": "Android Developer Ref 3322", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          Staffing and Recruiting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong><u>Junior Android Engineer – Contract – Remote (USA)</u></strong></p><p><br></p><p>I am looking for a motivated and ambitious Senior Android Engineer with 2 years of experience to come and join a successful project with a world-renowned client in the Oil and Gas industry. The Android native engineer will work on a native, greenfield application using Server-driven UI (SDUI) that is a modern replacement for an existing product with high user number</p><p><br></p><p>Our ideal candidate has a product mindset: who cares about customer outcomes and making data-informed decisions. Also has a strong understanding of coding standards and design principles / patterns.</p><p><br></p><p><strong><u>The ideal candidate will have:</u></strong></p><p><br></p><ul><li>Education Required: Computer Science</li><li>2 Years of Experience Needed</li><li>Design, build, and maintain high performance, reusable, and reliable Java code</li><li>Strong knowledge of Android SDK, different versions of Android, and how to deal with different screen sizes</li><li>Knowledge of the open-source Android ecosystem and the libraries available for common tasks</li><li>Strong knowledge of Android UI design principles, patterns, and best practices</li><li>Understanding of Google’s Android design principles and interface guidelines</li><li>Familiarity with RESTful APIs to connect Android applications to back-end services</li><li>Familiarity with cloud message APIs and push notifications</li><li>Proficient understanding of code versioning tools, such as Git</li></ul><p><br></p><p>If you feel like this is a role you could thrive in, please apply, as I want to speak to you!</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3460770405"},
{"title": "Contract: Senior Backend Engineer (Perl)", "location": "\n              Arizona, United States\n            ", "company_name": "\n                Upwork\n              ", "position_name": "Contract: Senior Backend Engineer (Perl)", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          Technology, Information and Internet and Human Resources Services\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        Upwork ($UPWK) is the world’s work marketplace. We serve everyone from one-person startups to over 30% of the Fortune 100 with a powerful, trust-driven platform that enables companies and talent to work together in new ways that unlock their potential.<br><br>Last year, more than $3.3 billion of work was done through Upwork by skilled professionals who are gaining more control by finding work they are passionate about and innovating their careers.<br><br>This is an engagement through Upwork’s Hybrid Workforce Solutions (HWS) Team. Our Hybrid Workforce Solutions Team is a global group of professionals that support Upwork’s business. Our HWS team members are located all over the world.<br><br>Work/Project Scope:<br><ul><li>You will be working with teams of 15+ engineers, product managers, and designers to build outstanding features for our users!</li><li>You will need to attend at least three meetings weekly (often in Eastern time, and lasting 1-2 hrs each)</li><li>Our setup requires collaborative work which includes code reviews and writing supporting documentation</li><li>You’ll share the ownership of our code domain and will actively work to increase its quality and reduce technical debt<br><br></li></ul>Must Haves (Required Skills):<br><ul><li>8+ years of software development experience</li><li>Knowledge of Perl</li><li>Good understanding of system design principles, </li><li>Experience with SQL and NoSQL databases, REST</li><li>Self-motivation, self-organization and self-education skills</li><li>English on at least an intermediate level (should be able to pass the technical interview in English)</li><li>Basic knowledge of Java, Python, Ruby, PHP, Node.js, or other server-side languages</li><li>Consistent track record of collaborating with large, distributed teams of engineers over documentation and code</li><li>A desire to learn new technologies and continually develop your professional skills</li><li>Comfortable working with AWS</li><li>Experience building / supporting high load web applications and solving scalability issues<br><br></li></ul>Upwork is proudly committed to fostering a diverse and inclusive workforce. We never discriminate based on race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical condition), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.<br><br>To learn more about how Upwork processes and protects your personal information as part of the application process, please review our Global Job Applicant Privacy Notice<br><br>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3393211935"},
{"title": "APIGEE Developer", "location": "\n              United States\n            ", "company_name": "\n                Global Pharma Tek\n              ", "position_name": "APIGEE Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          Pharmaceutical Manufacturing\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Job Description</strong></p><p>• Experience in Apigee policy and Portal Development </p><p>• Experience in Apigee Edge</p><p>• Knowledge in Apigee X and Apigee Hybrid</p><p>• Knowledge in AKS cluster</p><p>• Communication/presentation skills.</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3472302928"},
{"title": "Azure Cloud Engineer", "location": "\n              New York, United States\n            ", "company_name": "\n                naztech Inc\n              ", "position_name": "Azure Cloud Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Business Development and Sales\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Position: Azure Cloud Engineer</strong></p><p><strong>Location: Remote</strong></p><p><strong>Duration: 12 Months Contract</strong></p><p><strong>Client: BNY Mellon</strong></p><p> </p><p>Looking for someone that has</p><p>At least 2 different Clouds, one of them must be azure</p><p>Worked with both infrastructure and Applications part of Azure</p><p>Senior level 10 plus</p><p>Software Engineering Background</p><p>TERRAFORM</p><p> </p><p>COMPUTER SCIENCE DEGREE</p><p><strong> </strong></p><p><strong>Project:</strong></p><ul><li><strong>It is a Migration and Redevelopment Project to Azure. </strong></li><li><strong>Using Terraform with AZURE or GCP. </strong></li><li><strong>Creating Props and services for BNY App AND Ops teams. </strong></li><li><strong>You are not writing terraform code to use yourself. Writing designing and testing Landing Zones.</strong></li><li><strong>You are building a template, testing it, and seeing what it does.</strong></li></ul><p><strong> </strong></p><p><strong>Must have Skills:</strong></p><ul><li>AZURE OR GCP</li><li>Terraform</li><li>Product Minds</li></ul><li>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3475434937"},
{"title": "Senior Site Reliability Engineer", "location": "\n              United States\n            ", "company_name": "\n                Synergy Interactive\n              ", "position_name": "Senior Site Reliability Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong><u>Senior Site Reliability Engineer</u></strong></p><p>We are currently partnered with a Public Sector Client seeking a Senior Site Reliability Engineer. Successful candidates should have senior knowledge and hands-on experience in engineering and an innate drive to improve existing systems and processes, with the creativity to develop novel solutions to evolving challenges. In this role you will be responsible for the availability and reliability of critical platform services and applications, ensuring they meet the requirements of internal and external users. </p><p><br></p><p>In this role, you will work with the Air Force and DoD on some of the most advanced projects in the world today. </p><p><br></p><p><strong><u>What You’ll Do</u></strong></p><p>• Ensure that DevSecOps principles are followed through the entire software delivery lifecycle. </p><p>• Responsible for the availability and reliability of critical platform services and applications, ensuring they meet the requirements of internal and external users. </p><p>• Be available to respond to incidents that impact Platform One availability and provide support for service engineers with customer incidents. </p><p>• Run the infrastructure with Chef, Ansible, Terraform, GitLab CI/CD, and Kubernetes. </p><p>• Build monitoring that alerts on symptoms rather than on outages. </p><p>• Document every action so your findings turn into repeatable actions and then into automation. </p><p>• Use the GitLab product to run GitLab.com as a first resort and improve the product as much as possible. </p><p>• Improve operational processes (such as deployments and upgrades) to make them as boring as possible. </p><p>• Design, build, and maintain the core infrastructure that enables GitLab scaling to support hundreds of thousands of concurrent users. </p><p>• Debug production issues across services and levels of the stack. </p><p><br></p><p><strong><u>Who You Are</u></strong></p><p>• A US Citizen and possess a Secret Security Clearance. </p><p>• 3 plus years of hands-on experience in a Senior Site Reliability Engineer role. </p><p>• 3 plus years of experience providing technical guidance to other engineers. </p><p>• Advanced understanding of agile and DevSecOps methodologies. </p><p>• Possess and applies a comprehensive knowledge across key tasks and high-impact assignments. </p><p>• Effectively work with cross-functional teams to get a grasp of a product and/or program's overall state of health. </p><p>• Ability to evaluate performance results and recommend major changes affecting short-term project growth and success. </p><p>• Expert on the CI/CD process and the overall vision of the program. </p><p>• Experience collaborating with business leaders to build and run sustainable production systems.</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3475073995"},
{"title": "Azure Developer / .NET Core", "location": "\n              United States\n            ", "company_name": "\n                Optomi\n              ", "position_name": "Azure Developer / .NET Core", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting and Retail\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>Optomi, in partnership with a multi-billion dollar retailer, is looking for a talented Azure Developer / .NET Core!</p><p><br></p><p>What the right candidate will enjoy...</p><ul><li>A fully remote schedule!</li><li>The ability to work with cutting-edge technologies!</li><li>A long term contract (24+ months)</li><li>The ability to work for a company that takes care of their people and has a culture of respect!</li><li>The ability to work for one of the largest privately owned company in the United States!</li></ul><p><br></p><p>Responsibilities:</p><ul><li>Designs, develops, tests, and implements applications. Microsoft Azure (Function Apps, Cosmos Db, Durable Function Apps, Event Grid, Azure Data Factory, Logic Apps, Service Bus, Storage Accounts, etc.).</li><li>Works within the SAFe Agile framework and utilizes CI/CD best practices.</li><li>Interfaces with the Technical Product Owner and IT partners to develop acceptance criteria for features and user stories and ensures acceptance criteria are met.</li><li>Performs unit tests, monitors results, and takes required corrective actions as needed.</li><li>Optimizes and enhances applications and interfaces to meet SLA/functional requirements.</li><li>Assists product owners in systems analysis and creation or updating of documentation for all business processes.</li><li>Participates with other IT members, customers and other stakeholders in new product reviews, tests and pilots.</li><li>Performs feasibility studies/proofs of concept to evaluate solutions.</li><li>Participates in structured walk-throughs, secure coding, and technical reviews ensuring application coding and design follows secure coding and design principles.</li><li>Assists in the production support and maintenance of applications.</li><li>Actively participates in all team Agile ceremonies.</li></ul><p><br></p><p><br></p><p>Must have Qualifications:</p><ul><li>Bachelor’s degree or equivalent combination of education, training, and experience.</li><li>Experience on Agile teams in Agile development environment. SAFe certification or training is preferred.</li><li>Minimum of 5 years of industry experience in systems development and programming.</li><li>Minimum 3 years of experience in .NET, C#, SQL, RESTful APIs development and programming.</li><li>Experience building PaaS applications in Microsoft Azure.</li><li>We are looking specifically for folks that have experience designing/developing these systems and not simply supporting from a DevOps/Cloud Maintenance perspective</li><li>Within Microsoft Azure we are looking for experience with: Function Apps, Cosmos Db, Durable Function Apps, Event Grid, Azure Data Factory, Logic Apps, Service Bus, Storage Accounts, etc.</li><li>Ability to work with ambiguous requirements and think critically about how to solve a business problem</li><li>Experience using Git in a highly distributed team asynchronously.</li><li>SAFe / agile certifications or relevant work experience</li><li>Experience with Postman, Swagger, and experience with a variety of design patterns.</li><li>Experience developing unit test cases required</li><li>Knowledge and understanding of structured analysis and technical design techniques.</li><li>Strong technical communication and collaboration skills.</li><li>Knowledge of agile practices in a cross-functional environment preferred.</li><li>Ability to effectively adapt to rapidly changing technology and apply it to business needs.</li><li>Ability to establish and maintain a high level of customer trust and confidence.</li><li>Ability to provide high level of quality and productivity.</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3433814663"},
{"title": "User Experience Researcher", "location": "\n              New York, NY\n            ", "company_name": "\n                US Tech Solutions\n              ", "position_name": "User Experience Researcher", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Research, Strategy/Planning, and Management\n          ", "company_sector": "\n          Market Research, Research Services, and Entertainment Providers\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong><u>Job Details:</u></strong></p><p><strong>Title: UX/Qualitative Researcher V</strong></p><p><strong>Location: New York, NY</strong></p><p><strong>Duration: 12 Months Contract</strong></p><p><strong>Pay Range: $80-85/hr on W2 without benefits</strong></p><p><br></p><p>Day to Day Responsibilities:</p><ul><li>Help the identify strategic opportunities by connecting the dots between cross-company research studies and efforts</li><li>Design research studies that address behavior, attitudes, and needs of consumers &amp; businesses</li><li>Employ creative and innovative research methods to understand needs of businesses and consumers</li><li>Generate insights that fuel ideation and evaluate designs</li><li>Manage vendors to help augment the work of the team</li><li>Work cross-functionally with design, product management, content strategy, engineering and marketing</li><li>Communicate results and illustrate suggestions in compelling and creative ways</li></ul><p><br></p><p>Qualifications:</p><ul><li>Command of qualitative and user-centered design methods, from ethnographic to usability to survey design and analysis. </li><li>Familiarity with remote usability research</li><li>Ability to identify, as well as answer, business decisions</li></ul><p><br></p><p><strong>\"U.S. Tech Solutions, Inc. is an Affirmative Action, Equal Opportunity Employer. Our employment decisions are made without regard to race, color, religion, gender, national origin, age, disability, marital status, veteran or military status, or any other legally protected status.\"</strong></p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3476429924"},
{"title": "Azure .Net Developer", "location": "\n              Indianapolis, IN\n            ", "company_name": "\n                Precision Technologies\n              ", "position_name": "Azure .Net Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Project Management and Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>Hi,</p><p><br></p><p>Hope you are doing great.</p><p> </p><p>We have an immediate need for the below position. If you are available and interested. Please reply to me with your best number to reach and update your resume in word format.</p><p><br></p><p><strong>Job Title:Azure .Net Developer</strong></p><p><strong>Location: Remote</strong></p><p><strong>Duration:Contract</strong></p><p><strong>Mode Of Interview:Webcam</strong></p><p><br></p><p><strong>Job Description:</strong></p><p>Essential Duties/Responsibilities:</p><ul><li>Lead the technical implementation of client requested software.</li><li>Problem solving real world issues through usage of existing libraries, packages and/or frameworks.</li><li>Ability and knowledge of when to create new libraries based on client needs.</li><li>Possess a client focused approach via in-person meetings with the client through the project lifecycle.</li><li>Actively listen to the client.</li><li>Apply their technical expertise to solve real world problems on time and on budget.</li><li>Manage tasks and report progress while adhering to industry standard style guidelines.</li><li>Work with the client(s) and UI/UX developer to develop feature rich, elegant software solving solutions.</li><li>Troubleshoot, debug, maintain, and improve existing software.</li><li>Develop technical documentation to guide future software development projects.</li></ul><p><br></p><p><strong>Required Skills:</strong></p><ul><li>C#- Required 5 Years</li><li>.NET back- end REST API development- Required 5 Years</li><li>Angular front-end development- Required 4 Years</li><li>.NET Framework- 4+ - Required 5 Years</li><li>.NET Core- Required 5 Years</li><li>ASP.NET using C#- Required 5 Years</li><li>T-SQL -Desired 3 Years</li><li>HTML/CSS- Required 4 Years</li><li>AWS Lambda- Required 3 Years</li><li>Azure App Service- Required 3 Years</li><li>Azure DevOps Boards - Required 3 Years</li><li>Azure DevOps Repos- Required 3 Years</li><li>Azure DevOps Build Pipelines- Required 3 Years</li><li>Azure DevOps Release Pipelines - Required 3 Years</li><li>Git flow strategy- Required 3 Years</li><li>IOS development- Nice to have 2 Years</li><li>Android development -Nice to have 2 Years</li></ul><p></p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3471553077"},
{"title": "Winforms Developer - REMOTE", "location": "\n              United States\n            ", "company_name": "\n                Pivotal Solutions\n              ", "position_name": "Winforms Developer - REMOTE", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          Appliances, Electrical, and Electronics Manufacturing\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>· <strong>C# WinForms</strong> – At least 5 years of developing WinForms applications using the C# language.</p><p>· <strong>SQL</strong> – At least 5 years of working with Microsoft SQL Server, including writing TSQL scripts.</p><p>· <strong>Entity Framework </strong>– At least 5 years of working with the Entity Framework.</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3474464570"},
{"title": "WPF Software Engineer", "location": "\n              Dallas, TX\n            ", "company_name": "\n                Jobot\n              ", "position_name": "WPF Software Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting and Software Development\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        Want to learn more about this role and Jobot? Click our Jobot logo and follow our LinkedIn page!<p><br></p>Job details<p><br></p><strong>Fully remote opportunity with Medical Device Company!!!</strong><p><br></p>This Jobot Job is hosted by Garrett Mathison<p><br></p>Are you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume.<p><br></p>Salary $92,000 - $125,000 per year<p><br></p><strong>A Bit About Us</strong><p><br></p>Highly innovative software company specializing in FDA compliant Software for medical devices.<p><br></p><strong><br><br><strong>Why join us?<br></strong></strong><p><br></p>This company is rapidly growing as healthcare providers expand their medical device needs. As a part of this company you will be working with industry experts helping build the next generation of FDA compliant medical device software. This company provides a competitive compensation plan, a flexible work environment and great benefits.<p><br></p><strong>Job Details</strong><p><br></p>We are looking for a Sr WPF/C# Software Engineer with expertise in C#, WPF and SQL. Added consideration will be given to those with JavaScript and/or Azure/AWS experience.<p><br></p>Must have<p><br></p><ul><li> Minimum 5 years experience</li><li> Expert in C++, C#, WPF and SQL</li><li> Experience developing Graphic User Interface using XAML</li><li> Proven experience in a highly regulated environment</li></ul><p><br></p>Nice to have<p><br></p><ul><li> Experience building Medical Device Software</li><li> Understanding of FDA compliance</li><li> Proficiency in JavaScript</li><li> Experience with Serial Communications </li></ul><p><br></p>This client is looking to review candidates and start the interview process within the week.<p><br></p>Interested in hearing more? Easy Apply now by clicking the \"Apply\" button.<p><br></p><strong>Want to learn more about this role and Jobot?</strong><p><br></p>Click our Jobot logo and follow our LinkedIn page!<p><br></p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3473974962"},
{"title": "Teamcenter Developers", "location": "\n              United States\n            ", "company_name": "\n                ACS Solutions\n              ", "position_name": "Teamcenter Developers", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>Innova Solutions is filling several Teamcenter Developer positions on a 3 years contract for a large manufacturing client. Position is 100% remote from anywhere in the U.S. and requires U.S. Citizenship based on the nature of the work. If interested please submit your resume for immediate consideration.</p><p><strong> </strong></p><p><strong>Teamcenter PLM / Application Software Developers</strong></p><p>Must be highly proficient in C and C++ as well as ITK customization</p><p>Must be highly proficient in Teamcenter 11x Rich Client Development (5+ years)</p><p>Experience using Siemens Teamcenter data conversion tools (for example, <em>Site Consolidation Tools:</em> Bulk Loader, IPS Data Upload)</p><p>Highly proficient with Oracle SQL, XSLT, CSV<strong><em> </em></strong>or scripting languages such as Perl and PowerShell.</p><p>Highly proficient writing &amp; running scripts on Windows Servers (*nix Servers is a plus).</p><p>Knowledge of Siemens Teamcenter Product Data Management application and data model.</p><p>XML, TCXML, or PLMXML, Transfer Mode / Transfer Option Set, Agile Software development methodology.</p><p><br></p><p><u>Preferred Qualifications: </u></p><p>Highly proficient in SOA Development</p><p>Highly proficient in Active Workspace version 5x or higher</p><p>HTML and CSS</p><p>Web Services</p><p>JSON</p><p>TFS-VC / GIT</p><p><u>Agile Development</u></p><p>SAFe (Scaled Agile Framework)</p><p>AZURE DevOps (aka ADO)</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3476415408"},
{"title": "Frontend Angular developer", "location": "\n              Charlotte, NC\n            ", "company_name": "\n                Modis\n              ", "position_name": "Frontend Angular developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>Akkodis is seeking a <strong>UI Angular Developer</strong> for a <strong>12 Month </strong>Contract position with a client located in <strong>Charlotte, NC/Jersey City, NJ (Remote until offices open, Post Hybrid Remote)</strong>. Ideally looking for applicants with a solid financial services background and strong experience in Angular development, JavaScript, and Design Patterns.</p><p> </p><p> <strong>Pay Range:</strong> $60-68/hour on W2 </p><p><br></p><p><strong>Job Title: UI Angular Developer</strong></p><p><strong>Location: Charlotte, NC/Jersey City, NJ (Remote until offices open, Post Hybrid Remote)</strong></p><p><strong>Duration: 12M Contract with possible extension</strong></p><p><br></p><p><strong>Required Skills:</strong></p><ul><li>Developer with strong hands-on experience in Angular or related UI frameworks, with 7 plus years of overall experience in UI development</li><li>Should have hands-on Web Application development using advanced HTML designing and Java scripting.</li><li>Knowledge of the banking domain preferably Global Markets, Financial Risk, Treasury etc.</li></ul><p><br></p><p><strong>Good to have:</strong> Ag-Grid, HighchartJS, NgRx, Node.js</p><p><br></p><p>Equal Opportunity Employer/Veterans/Disabled </p><p> </p><p>Benefit offerings include medical, dental, vision, term life insurance, short-term disability insurance, additional voluntary benefits, commuter benefits, and a 401K plan. Our program provides employees the flexibility to choose the type of coverage that meets their individual needs. Available paid leave may include Paid Sick Leave, where required by law; any other paid leave required by Federal, State, or local law; and Holiday pays upon meeting eligibility criteria. </p><p> </p><p><em>To read our Candidate Privacy Information Statement, which explains how we will use your information, please visit https://www.modis.com/en-us/candidate-privacy/ </em></p><p><em> </em></p><p><em>The Company will consider qualified applicants with arrest and conviction records.</em></p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3469096265"},
{"title": "Application Security Engineer - SQL Queris", "location": "\n              Kissimmee, FL\n            ", "company_name": "\n                US Tech Solutions\n              ", "position_name": "Application Security Engineer - SQL Queris", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology and Other\n          ", "company_sector": "\n          Staffing and Recruiting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Title: GIS Security Engineer Identity Protection</strong></p><p><strong>Location: Celebration FL 34747 - Onsite</strong></p><p><strong>Duration: 8 Months Contract</strong></p><p><br></p><p><strong>Top Must have skills</strong>-</p><p>1. SQL Queries</p><p>2. AWS- how to use</p><p>3. some experience w/Splunk</p><p>4. IAM is a nice to have</p><p>5. coding - will code in Python</p><p><br></p><p><strong>Description/Comment: </strong></p><p>This Security Engineer, IAM role will be responsible for strategy &amp; engineering support of the entire Identity Management Domain, with a focus on workforce Identity. In this role, they will provide architecture guidance, design and implementation consultation as well as security controls and policy criteria and support. Key areas of focus will include Authentication &amp; Authorization, Federation, Privileged Access Management, provisioning &amp; governance of identity and identity data. They will also be responsible for participating in cross organizational and department interactions on engineering and architecture use cases for services and technologies. This role will also be directly responsible for engaging and partnering with multiple groups across client to advance the Identity Protection strategy.</p><p><br></p><p><strong>Key Responsibilities</strong></p><ul><li>Partner and support the practice around Identity security engineering, and a strategy to achieve it.</li><li>Engage in BUs in engineering design, strategy, and reviews of both technical and process design and implementations</li><li>Drive policy definitions and enhancements, as well as risk identification and remediation direction for identified identity security gaps</li><li>Support direction of the company wide strategy with a security focus that aligns to the identity business and technical strategy as well as adapts to growing industry changes</li><li>Provide subject matter expertise and consultative services across the technology and business environments in the practices and design requirements around IAM</li><li>Provide technical support to the broader Identity engineering teams</li></ul><p><br></p><p><strong>Basic Qualifications </strong></p><ul><li>Minimum 5 years in technology organizations with demonstrable experience in delivering projects and other initiatives</li><li>Minimum 2 years in an Identity Management oriented area of expertise</li><li>Minimum 5 years demonstrable experience with technical reporting and analytics.</li><li>Minimum 5 years’ experience performing complex data analysis</li><li>Knowledge in security or Identity related areas.</li><li>Understanding of data management &amp; database structures</li><li>Ability to understand and write complex MS SQL queries</li><li>In Depth knowledge of multiple SIEM technologies.</li><li>Knowledge of cloud environments.</li></ul><p><br></p><p><strong>Preferred Qualifications </strong></p><ul><li>Experience with BI Tools such as Tableau</li><li>Experience with SIEM platforms such as Splunk and New Relic.</li><li>Knowledge of AWS and GCP.</li><li>CISSP, ITIL</li></ul><p></p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3445215850"},
{"title": "Frontend Engineer - Vue - Remote", "location": "\n              San Francisco, CA\n            ", "company_name": "\n                Motion Recruitment\n              ", "position_name": "Frontend Engineer - Vue - Remote", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          Staffing and Recruiting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        This premier software consulting company specializes in offering end-to-end e-commerce solutions to enterprise organizations of all shapes and sizes. In this case, the design team works autonomously and in direct collaboration with clients who are set up into teams to work on specific projects. You'll be able to work on distinct projects with a range of clientele.<br><br>They need a seasoned UI lead to manage a group of 10 developers in a quick-paced, dynamic workplace. This position will support the team with routine chores, best practices, and code reviews. You will create a brand-new component for this e-commerce project. A high-end department store with 510 locations will be your client. The environment was built using Javascript, Vue, and React.<br><br><strong><u>Required Skills &amp; Experience<br></u></strong><ul><li>Javascript</li><li>Vue</li><li>React</li><li>HTML/CSS<br></li></ul>The Offer<br><br><strong><u>You Will Receive The Following Benefits<br></u></strong><ul><li>Medical, Dental, Vision Insurance </li><li>401k</li><li>Paid sick leave <br></li></ul>Applicants must be currently authorized to work in the US on a full-time basis now and in the future.<br><br><strong>Posted By:</strong> Bianca Lagamon\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3455999439"},
{"title": "Senior Programmer Unreal Game", "location": "\n              United States\n            ", "company_name": "\n                Ardent Blue Technologies\n              ", "position_name": "Senior Programmer Unreal Game", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          Software Development, Entertainment Providers, and Computer Games\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>SENIOR UNREAL ENGINEER</p><p>Ardent Blue Technologies is a software development and staff augmentation company doing business since 2011. We have secured well recognized Fortune 500 clients in a number of domains including game development, game/film/architecture tools, game anti-cheat, IoT, VR and others.</p><p><br></p><p>We are looking to hire a Senior Unreal Engineer for our client, a VR technology studio that is presently developing a AAA first person shooter VR game like no other.</p><p><br></p><p>As a Senior Unreal Engineer, you will be responsible for developing gameplay and social features for the title. This is a full time remote position requiring at least 6 hours of overlap with the EST zone.</p><p><br></p><p>RESPONSIBILITIES</p><p><br></p><ul><li>Create and sustain game infrastructure, such as streaming or DLC pipelines</li><li>Develop tools and systems for monitoring and maintaining performance across platforms</li><li>Research and develop guidelines for feature implementation within Unreal Engine</li><li>Act as a mentor for other engineers</li></ul><p><br></p><p>REQUIREMENTS/QUALIFICATIONS</p><p><br></p><ul><li>Deep Unreal 4 experience a minimin of 2 years </li><li>Has shipped two or more commercial titles (does not have to be VR)</li><li>Deep experience in toolset either C++ or art software</li><li>5+ years in game development</li></ul><p><br></p><p>A PLUS TO HAVE/ BONUS QUALIFICATIONS</p><ul><li>BSN or higher in Computer Science, Computer Engineering, Software Engineering, Math, or related field</li><li>Experience with the technical challenges unique to VR game development</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3479935777"},
{"title": "Dotnet Developer", "location": "\n              United States\n            ", "company_name": "\n                ZETTALOGIX INC\n              ", "position_name": "Dotnet Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Job Title: Senior Dot Net Full Stack Developer </strong></p><p><strong>Location: 100% Remote </strong></p><p><strong>Duration: 12+ Months Contract</strong></p><p><strong>Visas: USC, GC Only.</strong></p><p><br></p><p><strong>Code Assessment Before the Interview</strong></p><p><br></p><p><strong>Job Description: </strong></p><p>1st-2nd roles: </p><p><strong>Must haves: </strong></p><p>1st: Lead experience - Portfolio Rebalancing </p><p>2nd: Backend focused - Specific Wealth / Asset Management experience required</p><p>Tech Stack: </p><p>• Front: Angular, CSS, TypeScript</p><p>• Middle: C#, .Net, APIs, Microservices, REST</p><p>• Backend: TSQL</p><p>• Advance Azure Services; Functions, Service Bus, Cosmos DB, Data Factory, Blob Storage, AKS</p><p><br></p><p>3rd-4th roles: </p><p><strong>Must haves: </strong></p><p>• Both Full Stack - General financial services domain; banking</p><p>• Full Stack: </p><p>• Front: Angular, CSS, TypeScript</p><p>• Middle: C#, .Net, APIs, Microservices, REST</p><p>• Backend: SQL (noSQL is a plus)</p><p>• 1-2 years with Azure Services: Functions, Service Bus, Cosmos DB, Data Factory, Blob Storage, AKS </p><p><br></p><p><strong>REQUIRED EDUCATION</strong></p><p>Bachelor's Degree or relevant work experience</p><p></p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3476245725"},
{"title": "RSA Archer Developer", "location": "\n              United States\n            ", "company_name": "\n                Baanyan Software Services, Inc.\n              ", "position_name": "RSA Archer Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Job Description</strong></p><p>Lead complex technology initiatives including those that are companywide with broad impact. Act as a key participant in developing standards and companywide best practices for engineering complex and large scale technology solutions for technology engineering disciplines. Design, code, test, debug, and document for projects and programs. Review and analyze complex, large-scale technology solutions for tactical and strategic business objectives, enterprise technological environment, and technical challenges that require in-depth evaluation of multiple factors, including intangibles or unprecedented technical factors. Make decisions in developing standard and companywide best practices for engineering and technology solutions requiring understanding of industry best practices and new technologies, influencing and leading technology team to meet deliverables and drive new initiatives. Collaborate and consult with key technical experts, senior technology team, and external industry groups to resolve complex technical issues and achieve goals. Lead projects, teams, or serve as a peer mentor. Required Qualifications: 5+ years of Software Engineering experience, or equivalent demonstrated through one or a combination of the following: work experience, training, military experience, or education.</p><p> </p><p> The RSA Archer Developer</p><p> </p><p> - Software Senior Engineer (SE) will have a technical developer role with the team responsible for design and development for Internal Audit utilizing RSA Archer. The current use cases include Audit Engagement and Workpapers, Audit Planning &amp; Quality, Control Assurance Program Management, Issues Management and Risk Catalog. In addition to multiple On Demand Applications. This is will be a cohesive platform offering end-to-end automation for Internal Audit, in support of annual planning, issue management, resource &amp; time management, system &amp; data integration and producing related reports &amp; dashboards. This SSE will be actively engaged in overall technical design and implementation using RSA Archer 6.x along with other technology and integration tools. The success of the role will require focusing on delivering the solution per requirements with a quick turnaround time without compromise to quality. This role requires a strong ability to work independently to complete development task and work closely with the business team to ensure delivery per requirements and alignment with technology standards and best practices.</p><p> </p><p> - 10 – 20 % Meeting</p><p> - 10 – 20 % Analysis</p><p> - 60-80 % Development</p><p> </p><p> Required Skills:</p><p> - 8+ years of application development experience</p><p> - 4+ years of experience with Archer 5.2 or above</p><p> - 5+ years of experience with Archer core solutions</p><p> - 5+ years of experience with on-demand application development experience in Archer</p><p> - 3+ years of experience with data feed setups in Archer</p><p> - 3+ years of Archer experience using calculated fields and data driven events</p><p> BS/BA degree or higher</p><p> </p><p> Preferred:</p><p> - Excellent verbal, written, and interpersonal communication skills</p><p> - Ability to work effectively, as well as independently, in a team environment</p><p> - Experience identifying key issues, involve affected parties, design solutions, obtain buy-in, and communicate effectively through resolution</p><p> - 3+ years of audit experience</p><p></p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3467846463"},
{"title": "Senior Software Engineer (.Net, Terraform)", "location": "\n              Nashville Metropolitan Area\n            ", "company_name": "\n                Insight Global\n              ", "position_name": "Senior Software Engineer (.Net, Terraform)", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          Hospitals and Health Care\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong><u>Requirements </u></strong></p><ul><li>5+ years of Software Engineer/Software Development Experience</li><li><strong>3-5+ years of .Net</strong></li><li><strong>2+ years of Terraform experience</strong></li><li>Strong Azure DevOps experience (GitHub, Jenkins, TFS- experience building pipelines/ doing pipeline maintenance)</li><li><strong>React or other JavaScript frameworks (Angular 5+, Vue, AngularJS) </strong></li><li>Experience/exposure to architecture tools, patterns, designing code using best architecture tools and practices</li><li>Enjoys talking about architecture, designing code/applications, able to sit down with the team to discuss best architectural patterns/practices.</li><li>Azure </li><li>Experience writing unit tests </li><li>Strong leadership and collaboration capabilities. </li></ul><p><br></p><p><strong><u>Day-to-Day </u></strong></p><p>A client in the Nashville, TN area is looking for a Senior Software Engineer to join their team. This team is looking for a resource who is able to be a part of all areas of the SDLC. They are looking for someone who is interested in architecture and enjoys walking through best design patterns, practices and tools to implement in the code. They are also looking for this person to be their “go-to resource” when it comes to terraform. This person will need to be able to answer questions, ensure that best practices and approaches are being implemented within terraform. This team also doesn’t have a DevOps or QA team so this person will need to be able to get hands on with DevOps tools (github, tfs, Jenkins.) to work within CICD. They also practice extreme ownership so they will need to write unit tests to test code, and any code these engineers write, they are responsible for maintaining it and overseeing production support for their code since it’s a team-owned domain.</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3472340871"},
{"title": "Dotnet Developer", "location": "\n              United States\n            ", "company_name": "\n                Urbane Systems LLC\n              ", "position_name": "Dotnet Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          Staffing and Recruiting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Job Responsibilities:</strong></p><ul><li>Work in an agile product team and across cross-functional teams to design, develop, test, and support complex software systems using Microsoft .NET Core and open source full-stack technologies.</li><li>Work with product owners and stakeholders to understand desired application requirements.</li><li>Taking ownership and responsibility for essential system design and integration decisions and communicating decisions to the team.</li><li>Learn and share knowledge of new technologies to support technically challenging projects and interested in assuming various responsibilities. </li></ul><p><strong>Required Qualifications:</strong></p><ul><li>4+ years of related technical development experience required </li><li>Hands-on experience with .NET Core 2.0 or above, ASP.net MVC, WebAPI, Typescript, Angular 2 or above</li><li>Hands-on experience with both SQL and NoSQL database</li><li>Practical knowledge of OOPs concepts and SOLID desing priciples</li><li>Good understanding of design patterns</li><li>.NET unit testing using NUnit, XUnit and Moq</li><li>Good understanding of package distribution tools like NPM, Nuget, GitHub, etc.</li><li>Experience with source control, CI and build tools such as GitHub</li><li>Familiarity with DevOps tools such as Azure DevOps, TFS</li><li>Excellent communication skills</li></ul><p><strong>Preferred Skills:</strong></p><ul><li>Familiar with Microservice architectures</li><li>Hands on experience with multi-threaded applications</li><li>Prior exposure to Authentication/Authorization standards like OAuth 2.0 and OpenID Connect</li><li>Experience with online API Documentation like Swagger</li><li>Knowledge on Containerization technologies like Docker, Kubernetes is a plus</li><li>Experience with AWS or Azure cloud</li><li>Healthcare Informatics (DICOM, HL7, FHIR) is a plus</li></ul><p></p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3475618084"},
{"title": "Senior Full Stack NodeJS Engineer (10+ Years of experience)", "location": "\n              Reston, VA\n            ", "company_name": "\n                Kellton\n              ", "position_name": "Senior Full Stack NodeJS Engineer (10+ Years of experience)", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Position: Senior Full Stack NodeJS Engineer - AWS </strong>(10+ Years of experience)</p><p><strong>Job Location: REMOTE</strong></p><p><strong>Job Duration: 12+ Months (Contract)</strong></p><p><strong> </strong></p><p>As a Senior Full Stack NodeJS Engineer, candidate will be responsible for complex software development including coding, managing small sections of ongoing projects and closely adhering to deadlines. Candidate will also take responsibility for creating design specifications, unit testing, and preparing technical documentation. Candidate will ensure relationships with customers and cross-team members and are professional and meet expectations.</p><p><br></p><p>The ideal candidate will have designed, developed, implemented and tested serverless software solutions in support of data quality and automation. The candidate will also possess technical skills and experience in the data management domain that will help their ability to design and develop elegant and efficient data processes and systems. Experience with automated testing of frontend and/or backend using Selenium or similar will be an advantage.</p><p><strong> </strong></p><p><strong>Required Skills: </strong></p><p>• Minimum 7+ years demonstrated experience with software development.</p><p>• Strong and evolving competence in several programming languages and technologies, working knowledge of multiple tool sets, technologies and implementation environments</p><p>• Strong practical experience in NodeJS and scripting experience in a Cloud based environment</p><p>• Demonstrated experience with AWS Lambda, SNS/SQS, S3, RDS/DynamoDB/Neptune, CloudWatch, AWS CLI</p><p>• Possess technical skills and experience in the virtual infrastructure domain, specifically Amazon Web Services.</p><p>• Design and development experience in building and monitoring microservices</p><p>• Working experience on CI/CD using Jenkins/AWS Code pipeline</p><p>• Demonstrated experience in developing full stack solutions using NodeJS</p><p>• Fundamentals in OO and computer science foundation principles.</p><p>• Working knowledge of distributed architectural design patterns</p><p>• Working knowledge of automated testing</p><p>• Knowledge of systems analysis and design (including OOAD and UML), and database design</p><p>• Knowledge of software development lifecycle and modern software engineering principles and practices</p><p><strong> </strong></p><p><strong>Preferred Skills: </strong></p><p>• High analytical skills and knack to develop tools for monitoring high frequency data services.</p><p>• Experience working on Agile teams with the scrum team member attitude – willingness to support the Team to be successful in any area necessary</p><p>• Demonstrated experience with AWS cloud supported programming languages like Java, React JS, Angular JS or Python development.</p><p>• Ability to use: KMS, ALB/ELB, Route 53, VPC</p><p>• Fluency with CI/CD toolsets such as: CloudFormation, BitBucket, Jenkins, Ansible</p><p>• Experience with relational and NoSQL databases</p><p>• Experience building infrastructure as code using AWS CloudFormation or similar scripting techniques</p><p>• Appetite to Learn new things</p><p>• Some knowledge in data science and/or machine learning</p><p><strong> </strong></p><p><strong>Education/Certifications: </strong></p><p>• Bachelor’s degree and/or other advanced degree(s)</p><p>• Relevant AWS or other professional certifications</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3448056675"},
{"title": "Sr. API Developer", "location": "\n              United States\n            ", "company_name": "\n                Pyramid Consulting, Inc\n              ", "position_name": "Sr. API Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Design\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Title:</strong> Sr API Developer</p><p> <strong>Location: </strong>Remote </p><p><strong>Duration: </strong>Contract Position </p><p> </p><p>Note: 12+ years experience required with semi conductor industry background</p><p> </p><p> <strong>Job Description:</strong> </p><p><br></p><ul><li>Developer will be responsible for work API's (commonly called System API) that would interface with a variety of devices, Software Applications, and 3rd party Software Applications. </li><li>Developer will participate in any planning or collaboration meetings that are required to ensure the successful delivery of the work. </li><li>Client will be responsible for defining, prioritizing, and assigning tasks to the Developer.</li></ul><p><br></p><p><strong>Required skills: </strong></p><ul><li>Advanced Typescript in a Node.JS Environment (Type Algebra, Generics) </li><li>Experience with GraphQL (ideally designing/implementing APIs) </li><li>Experience designing REST APIs</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3477999107"},
{"title": "Lead Data Scientist", "location": "\n              United States\n            ", "company_name": "\n                Revolution Technologies\n              ", "position_name": "Lead Data Scientist", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          Staffing and Recruiting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>RevUp Your Career as a Data Scientist</strong></p><p><strong> </strong></p><p><strong>Job Title:</strong> Lead Data Scientist</p><p><strong>Job Location: </strong>Remote </p><p><br></p><p><strong>Summary</strong></p><p>Revolution Technologies is hiring a Lead Data Scientist for our leading Technology client! Launch your career to the next level in the technology industry with this top-rated employer!</p><p><br></p><p><strong>Key Skills and Experience Required </strong></p><ol><li>Strong SQL and Python background</li><li>6 years of data development experience </li></ol><p><br></p><p><strong>Job Description</strong></p><ul><li>Identifies requirements, creates, validates, and distributes analyses to support strategic engineering initiatives for a nimble SaaS org where priorities can shift quickly.</li><li>Creates and manages data pipelines against first-party and third-party data sources to create infrastructure for analysis &amp; automation, leveraging industry standard version control best practices when working with peer developers.</li><li>Maintains and generates Python-based scripts, notebooks, API integrations, etc. to support data development processes. Automates these processes where possible.</li><li>Develops models and dashboards to measure and track performance and help with forecasting future performance based on data.</li></ul><p><br></p><p><strong> Qualifications</strong><em>:</em></p><ul><li>5-6 years of experience in an analytical/data science/data engineering role and a track record of successful application of diverse analytical approaches.</li><li>Strong SQL &amp; Python background.</li><li>Data development experience – specifically generating new data structures from existing sources for the purposes of analysis.</li><li>Demonstrated experience of data pipeline development to support automation.</li><li>Experience with version control tools and systems (Git, Bitbucket).</li></ul><p><br></p><p><br></p><p><br></p><p><strong>Why Revolution Technologies?</strong></p><p><strong> </strong></p><p><strong>About the company</strong></p><p><em>Revolution Technologies - Making a difference across the nation with premier consulting, staffing, and hiring services.</em></p><p>Revolution Technologies, founded in 1993, provides best-in-class services that make a positive difference in the lives of our clients <em>and</em> our talent. We provide strategic management consulting; ERP and EA consulting; staff augmentation, contract, and contingent staffing; contract-to-permanent and permanent placement; as well as payrolling, recruitment process outsourcing, and human resources advisement services.</p><p><br></p><p><strong>Let’s talk about benefits</strong></p><p>Revolution Technologies is proud to offer some of the best rates in the market. Revolution is also pleased to provide a comprehensive benefits package including medical, dental, vision, short term disability, access to a health savings account, tuition reimbursement, scholarship opportunities, 401k, life insurance, supplemental insurance, and paid time off.</p><p><strong> </strong></p><p><strong>Equal Opportunity Employer</strong></p><p>Revolution Technologies, LLC is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.</p><p><br></p><p><strong><em>Revolution Technologies: Turn to us!</em></strong></p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3475123003"},
{"title": "Contract: Senior Backend Engineer (Perl)", "location": "\n              Florida, United States\n            ", "company_name": "\n                Upwork\n              ", "position_name": "Contract: Senior Backend Engineer (Perl)", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          Technology, Information and Internet and Human Resources Services\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        Upwork ($UPWK) is the world’s work marketplace. We serve everyone from one-person startups to over 30% of the Fortune 100 with a powerful, trust-driven platform that enables companies and talent to work together in new ways that unlock their potential.<br><br>Last year, more than $3.3 billion of work was done through Upwork by skilled professionals who are gaining more control by finding work they are passionate about and innovating their careers.<br><br>This is an engagement through Upwork’s Hybrid Workforce Solutions (HWS) Team. Our Hybrid Workforce Solutions Team is a global group of professionals that support Upwork’s business. Our HWS team members are located all over the world.<br><br>Work/Project Scope:<br><ul><li>You will be working with teams of 15+ engineers, product managers, and designers to build outstanding features for our users!</li><li>You will need to attend at least three meetings weekly (often in Eastern time, and lasting 1-2 hrs each)</li><li>Our setup requires collaborative work which includes code reviews and writing supporting documentation</li><li>You’ll share the ownership of our code domain and will actively work to increase its quality and reduce technical debt<br><br></li></ul>Must Haves (Required Skills):<br><ul><li>8+ years of software development experience</li><li>Knowledge of Perl</li><li>Good understanding of system design principles, </li><li>Experience with SQL and NoSQL databases, REST</li><li>Self-motivation, self-organization and self-education skills</li><li>English on at least an intermediate level (should be able to pass the technical interview in English)</li><li>Basic knowledge of Java, Python, Ruby, PHP, Node.js, or other server-side languages</li><li>Consistent track record of collaborating with large, distributed teams of engineers over documentation and code</li><li>A desire to learn new technologies and continually develop your professional skills</li><li>Comfortable working with AWS</li><li>Experience building / supporting high load web applications and solving scalability issues<br><br></li></ul>Upwork is proudly committed to fostering a diverse and inclusive workforce. We never discriminate based on race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical condition), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.<br><br>To learn more about how Upwork processes and protects your personal information as part of the application process, please review our Global Job Applicant Privacy Notice<br><br>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3393213853"},
{"title": "Jira Developer - Remote - 8+ Years", "location": "\n              United States\n            ", "company_name": "\n                My3Tech\n              ", "position_name": "Jira Developer - Remote - 8+ Years", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <strong><u>Minimum Requirements<br><br></u></strong>Candidates that do not meet or exceed the <strong>minimum</strong> stated requirements (skills/experience) will be displayed to customers but may not be chosen for this opportunity.<br><br>Years<br><br><strong><u>Required/Preferred<br><br></u></strong>Experience<br><br>8<br><br><strong><u>Required<br><br></u></strong>Atlassian Jira implementations (On-prem and/or Cloud)<br><br>4<br><br><strong><u>Required<br><br></u></strong>Data migrations - from Jira platform<br><br>2<br><br><strong><u>Required<br><br></u></strong>Adaptivist Scriptrunner (Cloud)<br><br>2<br><br><strong><u>Required<br><br></u></strong>Jira API Integration to external systems\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3477041656"},
{"title": "Software Engineer Senior (Formworks) - REMOTE ", "location": "\n              United States\n            ", "company_name": "\n                Harvey Nash USA\n              ", "position_name": "Software Engineer Senior (Formworks) - REMOTE ", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Consulting and Information Technology\n          ", "company_sector": "\n          Staffing and Recruiting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Req#</strong> 127023-1</p><p><br></p><p><strong>Role:</strong> Software Engineer Senior - Formworks</p><p><strong>Location:</strong> Remote</p><p><strong>Duration:</strong> 6+ Months </p><p><strong> </strong></p><p><strong>Job Description:</strong></p><ul><li>The Senior Software Engineer will help Enhance and support the Formworks application. Along with writing effective code, the position will be responsible for designing, building, delivering and maintaining a highly scalable functionality in the Formworks application. The incumbent will use industry best practices and work collaboratively with a cross-functional team of product managers, UX designers, architects, principal engineers, software engineers, the test automation team, and DevOps engineers.</li><li>Builds configure, customizes, and supports products that provide innovative solutions to challenging business use cases, existing systems, and operational problems.</li><li>A key contributor to an engineering team that builds and supports exceptional products that provide innovative solutions to challenging business use cases, existing systems,s, and operational problems.</li><li>Leads the architectural design, system analysis, and programming activities on application software; this may often require independent research and study.</li><li>Leads teams that develop high-quality and production-ready software by using best-practice data structures, algorithms, design patterns, and frameworks that are maintainable, scalable, responsive, and secure.</li><li>Scopes effort identifies risks, and clearly communicates trade-offs with team members and other stakeholders.</li><li>Foresees and assesses impact assessment of product (hardware, software) upgrades.</li><li>Maintains knowledge, and ensures competency and compliance with policies and procedures, in order to be the technical expert while collaborating with cross-functional teams.</li><li>This list is not all-inclusive and you are expected to perform other duties as requested or assigned.</li></ul><p><br></p><p><strong>Required Skills: </strong></p><ul><li>Degree in Computer Science and/or equivalent technical education and experience.</li><li>Minimum seven years of experience designing and developing high-performing and secure Applications.</li><li><strong><em>Experience with Optical Character Recognition (OCR), ie. FIS FormWorks, Mavro, OPEX, impira, etc.</em></strong></li><li>Expertise in OCR editor configuration and batch support.</li><li>Expertise in 834 EDI file format and processing.</li><li>Knowledge of current trends and best practices enabling sound technology choices and strategic decisions.</li><li>Spearheads the development of innovative approaches to detect, respond to, and eradicate tech debt, anti-patterns, and advanced threats.</li><li>Ability to research and apply innovative methodologies, the latest industry trends, and design patterns.</li><li>Recognizes underlying problems, opportunities, or the political forces affecting the organization. </li><li>Subject matter expert responsible for sharing expertise and insight with other engineers. </li><li>Identifies significant internal and external stakeholders and builds partnerships as part of an influencing strategy.</li><li>Demonstrates mastery in their area of expertise and are recognized as an authority on it by their peers and leaders. </li><li>Evaluates and generate options that scan the entire spectrum of software reliability, ease of adoption, scalability, operational ease, and skillset availability.</li><li>Mentors and champions cultural as well as process change.</li><li>Knowledge of agile development methodologies.</li><li>Ability to develop and maintain key vendor relationships</li></ul><p></p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3476602859"},
{"title": "ServiceNow Developer", "location": "\n              United States\n            ", "company_name": "\n                Apex Systems\n              ", "position_name": "ServiceNow Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          Financial Services\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Apex Systems</strong> is looking to hire a <strong>ServiceNow Developer </strong>for one of their reputable Financial Clients.</p><p><br></p><p><strong>Location: </strong><u>Mainly Remote</u><strong>- </strong>may be needed onsite <u>MAXIMUM </u>2x per month in the following locations:</p><p><br></p><p> Charlotte, NC </p><p> Chandler, AZ </p><p> Atlanta, GA </p><p> Chicago, IL </p><p> Minneapolis, MN </p><p> Summit, NJ </p><p> Columbus, OH </p><p> NYC </p><p> San Fran</p><p> </p><p><strong>Contract length:</strong> 6-12 month contract to hire </p><p><br></p><p><strong>**<u>We cannot work corp to corp and we cannot provide sponsorship</u>**</strong></p><p><br></p><p><strong>Description: </strong></p><p><br></p><p>5+ years of ServiceNow Development</p><p><em> </em>Must be able to do scripting within ServiceNow specific scripting for integration work</p><p><em> </em>Strong API Integration experience – REST API</p><p><em> </em>Large enterprise environment – large scale experience with ServiceNow</p><ul><li><em> </em>Solution Design understanding – being able to give an example of a ServiceNow solution they’ve worked on i.e. what was the need from the business partner and how did they use out of the box features to align/customize as needed to provide practical solutions on how to implement </li></ul><p><br></p><p><strong>Please send your resume to bparsons@apexsystems.com or apply directly today.</strong></p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3467870178"},
{"title": "(100% remote job) COBOL/IDMS Developer", "location": "\n              United States\n            ", "company_name": "\n                VSV WINS, INC\n              ", "position_name": "(100% remote job) COBOL/IDMS Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Other\n          ", "company_sector": "\n          Computer and Network Security, Banking, and Computer Games\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        We are seeking for an IDMS Developer Mainframe Developer/Analyst to analyze/develop/test/migrate code for our legacy Mainframe System (COBOL, JCL, ADSO/IDMS).<br><br>IDMS DEVELOPER - Candidates without recent/extensive IDMS experience will not be considered for this position. Be certain that the candidates that you submit are IDMS developers, not simply COBOL. Thanks!<br><br>Mainframe Developer/Analyst to analyze/develop/test/migrate code for our legacy Mainframe System (COBOL, JCL, ADSO/IDMS).<br><br><strong><u>Required Skills<br><br></u></strong>Demonstrated through prior experience the ability to:<br><br>The role is more of a technical analyst/developer.<br><br>Trace and document data system logic and flows by reading &amp; analyzing JCL, COBOL programs, CICS definitions, ADSO/IDMS programs, and 3rd party utility control cards, IDCAMS, SYNCSORT, and other common mainframe data manipulation processes.<br><br>Extracting and documenting Business Rules embedded in Mainframe programs, third-party utilities, and other data manipulation products. This includes both business and functional aspects of the business rules.<br><br>Understanding, analyzing, and documenting current Mainframe logic and flows and work with the users and business teams to correlate the same with how the systems support the current business, Federal, and State requirements.<br><br>Must complete assigned tasks; communicate accurate and useful status updates; follow quality standards; Ability to work in a team environment; strong communication skills; written and spoken.<br><br>Perform on-call duties for nightly and weekend batch cycles<br><br>Attention to details is a must since the documentation generated would be the basis of system rewrites.<br><br>Very clear, strong, and precise verbal and written communication skills are needed in order to work and coordinate with multiple teams.<br><br>Prior DHS experience would be a plus.<br><br>Work independently with little supervision or guidance.<br><br>Demonstrates a willingness to independently dive in and learn new systems, processes, and business functionality.<br><br>A minimum of 5 years experience REQUIRED for the following:<br><br>IDMS<br><br>MVS JCL and Procs<br><br>COBOL<br><br>Implement data models as needed using IDMS relational database.<br><br>Use of File Aid for Analysis of Files<br><br>Familiarity with Panavalet or another Source Control repository on the mainframe<br><br>Defining and documenting existing Business Processes<br><br>Proficient in Microsoft Office Suite, including Outlook, Word, Excel, PowerPoint, and Visio. etc.<br><br>Build solutions within the specified project timelines<br><br>Accurately prepare written correspondence that is coherent, grammatically correct, effective, professional, and engaging.<br><br>Demonstrated ability of high levels of interpersonal and communication skills.<br><br>Demonstrated ability of self-motivation, self-direction, and able to work with little or no supervision.<br><br><strong><u>Highly Desired<br><br></u></strong>Use of Adobe Experience Manager<br><br><strong><u>Previous Experience With Scheduling Software (Control-M Preferred)<br><br></u></strong>Understanding and experience in building consumable Web Services with Mainframe Technology<br><br>Demonstrate ability documenting and proposing architecture for Mainframe Systems\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3476227864"},
{"title": "Citrix Engineer", "location": "\n              United States\n            ", "company_name": "\n                The Judge Group\n              ", "position_name": "Citrix Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          Banking, Financial Services, and Investment Banking\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>Our Client is currently seeking a <strong>Citrix Engineer</strong></p><p><br></p><p><strong>W2 only</strong></p><p><br></p><p><strong>Description:</strong></p><p>On an Agile infrastructure team, you are responsible for all aspects of the software development lifecycle for client workstation and application virtualization solutions. Core competencies include but are not limited to: <strong>Citrix Technologies both on prem and in the cloud including XenDesktop and XenApp. Experience with cloud migrations are a plus</strong>. VDI, Software Deployment, PowerShell scripting/automation. Works independently as well as part of a tight-knit team, provides forward thinking solutions that drive both infrastructure and business solutions in a highly available and highly regulated environment. Interfaces with Solution Architects and other corresponding teams (network, security, appdev, hardware) on feature enrichment or problem solving of issues relating to the full system architecture stack. </p><p><strong>Work Experience:</strong></p><ul><li>8+ Years’ Experience working/engineering Virtualized environments (<strong>Citrix</strong>, VMware, Nutanix etc.) utilizing innovative and automated solutions.</li><li>In depth knowledge of related infrastructure technologies and landscape (hardware, software, network, security, etc.)</li><li>Demonstrated incident, problem, and escalation management for own area of responsibility with a strong customer focus.</li><li>Familiarity with compliance standards such as PCI-DSS is preferred</li><li>Demonstrated strong presentation and communication skills and the capability to address and interact with individuals or groups at varying levels of the organization.</li><li>Familiar with Agile methodologies a plus</li></ul><p><strong>Tools/Software Experience</strong></p><ul><li>Virtualization Technologies: Citrix primarily, VMWare, Azure, others a plus.</li><li>Operating Systems: </li><li>Microsoft Windows </li><li>Linux</li><li>PowerShell Scripting</li><li>SCCM or equivalent experience with configuration management solutions</li><li>Group Policy Management</li><li>Vulnerability Management</li><li>Audit/Compliance</li></ul><p><strong>Requirements</strong></p><p><strong>Candidate must possess at least a bachelor’s degree in Computer Science/Information Technology.</strong></p><ul><li>Must be well organized, self-motivated, and able to prioritize and multi-task in high-pressure situations</li><li>Will be part of a 24x7 on call rotation</li><li>Able to work independently with strong interest on current planning techniques and technologies</li><li>Able to communicate effectively at all levels</li><li>Create and Maintain Documentation both internally and customer facing</li><li>Exceptional at troubleshooting, thinking out of the box</li><li> 8+ years Citrix experience, with both on premises and cloud implementations.</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3477151019"},
{"title": "Angular Front-End Developer", "location": "\n              United States\n            ", "company_name": "\n                ERPMARK INC\n              ", "position_name": "Angular Front-End Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <strong><u>Job Summary<br></u></strong><ul><li>A client of ours in Remote is looking for a Angular Front-End Developer for a Contract opportunity.<br></li></ul><strong><u>Job Description<br></u></strong><ul><li>looking for dynamic and driven professionals to join a rapidly growing high-performance team. </li><li>It is an excellent opportunity to grow and add value to your career, by being a part of the transformation journey of one of the most renowned telecommunications companies in the world. Following are the job<br></li></ul><strong><u>Responsibilities<br></u></strong><ul><li>Full Stack Developer with hands on experience Node.js(V 14+), Typescript and Angular(V 5+)/React </li><li>Experience in fixing security vulnerabilities in application code </li><li>Experience with using REST API's </li><li>Experience working cloud AWS and Kubernetes</li><li>Relational DB knowledge </li><li>Exposure to Agile working environment.<br></li></ul><strong><u>Qualifications<br></u></strong><ul><li>Experience level: Experienced</li><li>Minimum 10+ years of Angular Front-End Developer Experience.</li><li>Education: Bachelors (required) <br></li></ul><strong><u>Job Type:</u></strong> <strong>Contract<br><br></strong><strong><u>Location:</u></strong> Preferred location is <strong>Remote.</strong>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3477138771"},
{"title": "[REMOTE in CST] Senior Full Stack Software Engineer - C#/.NET, Angular, SQL", "location": "\n              Austin, TX\n            ", "company_name": "\n                Technology Navigators\n              ", "position_name": "[REMOTE in CST] Senior Full Stack Software Engineer - C#/.NET, Angular, SQL", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering, Information Technology, and Consulting\n          ", "company_sector": "\n          Legal Services\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>No sponsorship available. No third-party candidates.</strong></p><p><br></p><p>A small but extremely powerful provider of cloud-based eDiscovery software and services, our client remains top of mind when professionals and corporations need high speed, reliable technology.</p><p><br></p><p>As they create brand new positions within the company to keep up with growth, they need an experienced<strong> Senior Full-Stack Software Engineer</strong> to join their technical team.</p><p><br></p><p><strong>Please note, this role is 100% REMOTE. Must reside in Central Time Zone (CST) to be eligible for consideration.</strong></p><p><br></p><p><strong>What you get to do:</strong></p><ul><li>Be a key contributor to the creation of dynamic web applications as a member of this rapidly growing team</li><li>Work on both the front-end and back-end as you utilize cutting-edge technologies and frameworks</li><li>Put your troubleshooting skills to work as you diagnose and resolve technical issues</li><li>Collaborate with other internal teams to support both new and existing clientele</li></ul><p><br></p><p><strong>What you need to succeed:</strong></p><ul><li>Bachelor’s degree in Computer Science or closely related field of study</li><li>3-6 years of full-stack software development experience working with C#/.NET and Angular</li><li>Working knowledge of SQL Server and REST APIs</li><li>Debugging experience is a major plus!</li></ul><p><br></p><p><strong>What’s in it for you:</strong></p><p>As a valuable new member of the team, you will have access to our amazing client list, the support of a tenured team, and the opportunity to enroll in a variety of health benefits, including medical, dental, and vision insurance plans. We also have a top-notch support staff on-hand to assist you with any questions you may have throughout your tenure.</p><p><br></p><p><strong>Don’t wait – apply online today to learn more about this new opportunity!</strong></p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3447024510"},
{"title": "Sr. Cloud Engineer ", "location": "\n              United States\n            ", "company_name": "\n                CRG\n              ", "position_name": "Sr. Cloud Engineer ", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting and Food and Beverage Services\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Sr. Cloud Engineer</strong></p><p><strong>Location:</strong> Remote</p><p><strong>Duration:</strong> 6+ Month, Contract to Hire</p><p><strong>Pay:</strong> $70.00+/hr</p><p><br></p><p><strong>JOB DESCRIPTION</strong></p><p>Our global client, headquartered in Charlotte, NC, is a world class food service provider with a top notch, state of the art technology stack. This innovative company provides employees with excellent work-life balance and prioritizes safety, health, and environment first. This company provides an excellent benefits package and is recognized for their great culture.</p><p><br></p><p><strong>RESPONSIBILITIES</strong></p><ul><li>Demonstrate critical thinking skills to help lead efforts to diagnose and troubleshoot issues</li><li>Coordinate with the support service teams to identify common issues and develop appropriate documentation, training, and automation</li><li>Establish working partnerships with IT teams and external partners to coordinate problem resolution for operational issues and analyze root cause issues to address underlying infrastructure problems</li><li>Lead problem solving exercises by understanding the current state, conducting root problem analysis, solution identification, and then planning implementation and delivery activities</li><li>Develop “as is” and “to be” diagrams to visually represent challenges, risks, and opportunities for improvements</li><li>Create tickets for 100% of support requests</li><li>Acknowledge assigned tickets/issues in alignment with established SLAs but no longer than within 1 business day to communicate to users that the ticket has been assigned and identify the steps and timeline that will be taken to pursue resolution</li><li>Resolve most assigned tickets/issues within 3 business days</li><li>In the event a ticket/issue cannot be resolved within 3 business days, provide customer updates at least weekly to manage customer expectations and communicate the steps and timeline that will be taken to pursue resolution</li><li>Serve as an escalation point for associates</li><li>Use sound judgement to determine the need to escalate issues/tickets to management awareness</li></ul><p><strong>QUALIFICATIONS</strong></p><ul><li>3 years of AWS experience</li><li>3-5 years of experience developing infrastructure and platform pipelines for agile delivery to application teams</li><li>AWS Certifications highly desired</li><li>Experience with AWS, VPC, AZs, Subnets, Route53, ALB/NLB, WAF, StackSets, Security Groups, NACLs, EC2, Systems Manager, Azure DevOPs, Ansible, Jenkins</li><li>Strong knowledge of Windows and Linux operating systems. RHEL 6.x/7.x, CentOS, SUSE and Windows Server 2008 R2 and greater</li><li>Fundamental networking/distributed computing environment concepts (Routing protocols, DHCP, DNS, TCP/IP)</li><li>Understanding of Monitoring tools like Splunk, CloudWatch and Zabbix</li><li>Server virtualization technologies (VMware/vCenter, Hyper-V)</li><li>Troubleshooting software and hardware issues including root cause analysis</li><li>Strong developer mindset with experience developing in CloudFormation, Terraform, Python, YAML, JSON</li><li>Strong platform engineering background automating provisioning of resources in AWS</li><li>Experiences building infrastructure as code CICD pipelines using CloudFormation, Gold Images, configuration management automation</li><li>Engineering automated, repeatable platform solutions on AWS that allow easy to use self-service capabilities for application teams</li><li>Strong understanding of security constructs in AWS including Load Balancers, WAF, SGs, NACLs, Patching, CloudTrail, Guard Duty, etc.</li><li>Strong background building automated self service capabilities in AWS</li><li>Strong communication skills</li><li>Can-do attitude a must</li></ul><p><strong>MUST HAVES</strong></p><p><strong>Education</strong></p><ul><li>Bachelor’s degree in Computer Science, or combination of education and experience</li><li>AWS certification highly preferred</li></ul><p><strong>Must-have Hands-on – at least intermediate – experience with:</strong></p><ul><li>CloudFormation</li><li>EC2</li><li>S3</li><li>IAM</li><li>VPC</li><li>CICD of infrastructure</li><li>SSM</li><li>SG</li><li>CloudWatch</li><li>EBS</li></ul><p>Category Code: JN008</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3477109323"},
{"title": "Sr. Java RPA Developer", "location": "\n              United States\n            ", "company_name": "\n                Synergy Interactive\n              ", "position_name": "Sr. Java RPA Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Project Management and Information Technology\n          ", "company_sector": "\n          Staffing and Recruiting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Looking for a Sr. RPA Developer for a global technology consulting firm. The ideal candidate will serve as a SME in the field of RPA development and technologies, especially around UIPath. Position is starting off as a 3 month contract likely to extend.</strong></p><p><br></p><p><strong>**Public Trust Clearance will be required upon acceptance of offer**</strong></p><p><br></p><p>Expertise Bachelor's degree, preferably in Computer Science or related IT discipline;</p><p>or equivalent experience Deep subject matter expertise in RPA - to demonstrate expert knowledge and significant experience in implementation</p><p>2+ years' experience working with UIPath</p><p>4+ years' experience in application or software development and experience with a programming language (Java preferably)</p><p>Strong understanding and proven experience in API integration concepts and web services</p><p>Excellent understanding of workflow-based logic and the ability to understand a business process from a workflow diagram</p><p>Strong analytical and problem-solving skills</p><p>Fast learner in information technology with a natural ability to solve complex issues</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3478152124"},
{"title": "Progress Developer", "location": "\n              United States\n            ", "company_name": "\n                BayOne Solutions\n              ", "position_name": "Progress Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology and Engineering\n          ", "company_sector": "\n          IT Services and IT Consulting, Technology, Information and Internet, and Insurance\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Software Developer </strong></p><p><strong>Remote role </strong></p><p><strong>Contract to hire role</strong></p><p><strong>Interview- Video </strong></p><p><strong>Rate- $41/hr on W2</strong></p><p><br></p><p>**This position is Contract to Hire and Open to Remote**</p><p><br></p><p><strong>MANAGER'S NOTES:</strong></p><p>Progress 4 GL (V10 or above) GUI 3 years minimum experience must with five years overall development experience.</p><p>Working knowledge of SOAP and REST services.</p><p>Hands-on .net development/web services, Progress V12 experience, will be a preference. </p><p> </p><p>PRIMARY PURPOSE: </p><ul><li>To develop, maintain, test and debug software to meet generally defined requirements in a Windows client/server environment utilizing software development languages/environments such as PL/SQL, Oracle, Progress 4 GL Application Development Environment (ADE), .Net, Microsoft SQL, or other platforms; to formulate and define system scope and objectives through research and fact-finding for the purpose of developing or modifying moderately complex information systems; to prepare detailed specification from which programs will be written; and to design, code, test, debug, document and maintain programs.</li><li>ESSENTIAL FUNCTIONS and RESPONSIBILITIES</li><li>Becomes extremely familiar with several key modules of the application that are being supported such modules include but not limited to reports, parameters, claims management, intake services and interfaces.</li><li>Analyzes user needs as required; assists in the design of specifications to meet end user needs.</li><li>Develops and modifies software to meet the specifications outlined in data processing requests.</li><li>Develops and maintains software to meet requirements of insurance carrier and regulatory groups.</li><li>Tests and debugs assigned projects; assists in testing projects for other members of the programming staff.</li><li>Prepares documentation on new or existing software.</li><li>Investigates call escalations from the support staff; makes the necessary corrections to data and/or software.</li><li>Assists in the professional growth of programmers.</li><li>Follows departmental pre-established standards and guidelines as they pertain to design and development.</li><li>Adheres to the goal of delivering and maintaining the highest quality of customer service to our clients.</li><li>Keeps abreast of software development language revisions and technology advances.</li><li>ADDITIONAL FUNCTIONS and RESPONSIBILITIES</li><li>Performs other duties as assigned.</li><li>Supports the organization's quality program(s).</li></ul><p>QUALIFICATIONS</p><p>Education &amp; Licensing</p><ul><li>Bachelor's degree from an accredited college or university required. Information Systems or Computer Science major preferred.</li></ul><li>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3433288149"},
{"title": "RUST Engineer", "location": "\n              Sunnyvale, CA\n            ", "company_name": "\n                Xoriant\n              ", "position_name": "RUST Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology and Finance\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Essential job functions and responsibilities:</strong></p><ul><li>RUST programming language (C/C++ history preferable)</li><li>Experience working on an Agile development team</li></ul><p><br></p><p>Xoriant reasonably expects the pay rate for this position to be within the following range: $80.00/hour-$100.00/hour.</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3478341961"},
{"title": "Vue.js & Node.js - Senior Full Stack Developer - 100% Remote - 1 Year Extendable Contract!", "location": "\n              United States\n            ", "company_name": "\n                Integris Group\n              ", "position_name": "Vue.js & Node.js - Senior Full Stack Developer - 100% Remote - 1 Year Extendable Contract!", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          Leasing Non-residential Real Estate and Real Estate\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Job Responsibilities:</strong></p><p>The Senior Full Stack Developer will be responsible for leading our project/team and work closely with the client Sponsor, Product Owner and SME. Performs complex analysis of technical issues, develops and documents patterns for development team to implement, coaches the offshore team in day-to-day development responsibilities.</p><p><br></p><p>A key responsibility is monitoring the development teams’ progress as per the plan. In addition to leading development team, the Technical Development Lead will also be responsible for his or her own development activities.</p><p><br></p><p>The ideal candidate will be a senior level developer and/or Technical Lead that has led development teams in the development of software products, including offshore developers. This person will be working with a hybrid onshore/offshore team with Scrum Master, UI/UX and business analysts on-shore and up to 10 developers and QA off-shore, either India or Philippines (limited time zone overlap).</p><p><br></p><p><strong>Technical Skills Required:</strong></p><ul><li>Web development lead experience preferred (will also consider Senior Developers as well)</li><li>Design app architecture</li><li>Review the work of other dev team members</li><li>Unit testing, integration testing</li><li><strong>Required: Full Stack developer with Vue.js, Node.js, SQL Server and Microservices experience</strong></li><li>Required: Back end API experience, both creating and consuming APIs</li><li>Required: Some Cloud experience with AWS, Azure or Google Cloud Platform (Google Cloud Platform)</li><li>Nice-to-have: AWS Lambda experience</li><li>Nice-to-have: API management experience</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3480506162"},
{"title": "Remote Oracle Warehouse Developer", "location": "\n              United States\n            ", "company_name": "\n                Insight Global\n              ", "position_name": "Remote Oracle Warehouse Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          Staffing and Recruiting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Position</strong>: Oracle Warehouse Developer</p><p><strong>Duration:</strong> 6 month contract to hire</p><p><strong>Location: </strong>Fully Remote</p><p><strong>Hours:</strong> 9 – 5PM EST </p><p> </p><p><strong>Must Haves:</strong></p><ul><li>Bachelor's Degree </li><li>3+ years of experience in Warehouse Development</li><li>3+ years of Oracle</li><li>3+ years of PL/SQL Experience</li><li>Experience with complex SQL queries using Star Schema or Snowflake schema – troubleshooting queries</li></ul><p> </p><p> </p><p><strong>Plusses:</strong></p><ul><li>Experience in Informatica</li><li>Healthcare experience </li><li>Hadoop/Trifacta</li><li>GCP with Big Query</li><li>Experience troubleshooting queries </li></ul><p> </p><p><strong>Position Summary:</strong></p><p>Supporting NextGen Data Warehouse. It includes second level production support responsibilities including performance improvements, job scheduling, and complex SQL troubleshooting. Position will assist with the creation of new data marts with leading ETL tools. Position will support the custom cache tables in addition to leadership and guidance for modifications to the data warehouse design. In addition, this position will support our archive load and reporting solutions currently in Hadoop and Trifacta. This individual will be doing warehouse development and troubleshooting queries.</p><p> </p><p>Day to Day:</p><p>The candidate will spend day split into two different focuses. Half of their day will be spent troubleshooting queries, the other half will be building Trifacta solutions in Hadoop. Other duties as assigned.</p><p></p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3469096861"},
{"title": "ForgeRock Engineer (15003)", "location": "\n              United States\n            ", "company_name": "\n                The Baer Group\n              ", "position_name": "ForgeRock Engineer (15003)", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>**Federal Projects - Applicant must be a United States Citizen with Active Secret Clearance**</strong></p><p><br></p><p><strong>The Baer Group is looking for ForgeRock Engineer for a 12+ month Federal remote project.</strong></p><p><br></p><p><strong>Title: </strong>ForgeRock Engineer</p><p><strong>Location: </strong>Remote (Must be based in US)</p><p><strong>Duration:</strong> 12 months</p><p><strong>Rate: </strong>All-Inclusive</p><p><strong>Alignment: </strong>W2 Required for this project (C2C Not Permitted)</p><p><br></p><p><strong>Opportunity</strong></p><p><br></p><p>Our client has recently been awarded a 5-year contract to execute a series of IT modernization programs to improve system and Cybersecurity infrastructure performance, extend key applications, and enable advanced analytics. Consultants engaging on this program will have long term opportunities to leverage a range of leading-edge Cloud, Data and Cyber Security tools to drive unique innovation solutions.</p><p><br></p><p><strong>Description</strong></p><p><br></p><ul><li>Review and Development of REST APIs required for integration with target applications.</li><li>Leading the integration with the various applications</li></ul><p><br></p><p><strong>Requirements</strong></p><p><br></p><ul><li>Knowledgeable in all ForgeRock products (AM, IDM, DS</li><li>Thorough understanding of SAML, OIDC and Oauth2 protocol</li><li>Experience with custom development of IAM solutions using Java, JSON, SAML, OAuth2.</li><li>Familiarity with development languages: Java, Beanshell, etc.</li><li>Experience in deploying ForgeRock stack in AWS cloud platforms</li></ul><p><br></p><p><strong>Skills &amp; Attributes</strong></p><p><br></p><ul><li>Forgerock Access Manager</li><li>ForgeRock Identity Gateway</li><li>Forgerock Identity Manager</li><li>Forgerock Openam</li><li>ForgeRock OpenIDM 3.1 Implementation</li></ul><p><br></p><p><strong>Company Overview</strong></p><p><br></p><p>The Baer Group is an Enterprise Technology Consulting firm providing job opportunities with several 1st Tier Global Systems Integrators and a wide array of Fortune 1000 clients. Consultants and Employees of TBG enjoy access to the highest profile job opportunities across leading Enterprise Technology Solutions ranging from Digital Transformation programs utilizing the latest technologies from SAP and Oracle to a wide range of emerging Cloud based infrastructure, application and AI related solutions.</p><p><br></p><p>The Baer Group prides itself on our ability to work directly with key stakeholders to create the most optimized service experience possible for our consultants and our clients. TBG’s job requirements are carefully vetted and are typically associated with mission critical programs offering tremendous opportunities to expand your skills leveraging the latest solutions. TBG focuses on representing jobs that provide streamlined response to our proposed candidates and a best in class engagement experience.</p><p><br></p><p>The Baer Group is an equal opportunity employer including disability/veteran.</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3426193817"},
{"title": "Direct Client – Power BI/ Tableau Developer", "location": "\n              United States\n            ", "company_name": "\n                The AES Group\n              ", "position_name": "Direct Client – Power BI/ Tableau Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          Restaurants, Food and Beverage Services, and Retail\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        We are looking for a Business Intelligence (BI) Developer to create and manage BI and analytics solutions that turn data into knowledge. In this role, you should have a background in data and business analysis. You should be analytical and an excellent communicator. Ultimately, you will enhance our business intelligence visualizations to help us make better decisions.<br><br><strong><u>Tops 3 Skills Needed<br><br></u></strong>1<br><br><strong>Skill</strong>: Power BI / Tableau<br><br><strong>Application</strong>: building solutions<br><br>8+ years<br><br>2<br><br><strong>Skill</strong>: Translating technical needs<br><br><strong>Application</strong>: need to create solutions<br><br>8+ years<br><br>3<br><br><strong>Skill</strong>: Collaberations<br><br><strong>Application</strong>: need to collaborate with team members<br><br>8+ years<br><br><strong><u>Years Of Experience<br></u></strong><ul><li>8+ years <br></li></ul><strong><u>Degree Or Certifications Required<br></u></strong><ul><li>BSc/BA in Computer Science, Engineering, or relevant field<br></li></ul><strong><u>Required Background/ Skills<br></u></strong><ul><li>Proven experience as a BI Developer or Data Scientist</li><li>Industry experience is preferred</li><li>In-depth understanding of database management systems, online analytical processing (OLAP) and ETL (Extract, transform, load) framework</li><li>3 years professional experience with BI technologies (e.g. Microsoft Power BI, Tableau)</li><li>Knowledge of SQL queries</li><li>Proven abilities to take initiative and be innovative</li><li>Analytical mind with a problem-solving aptitude</li><li>This role is specialized for power BI and power platform/ Tableo<br></li></ul><strong><u>Technology Requirements<br></u></strong><ul><li>Microsoft Power BI </li><li>Tableau </li><li>SQL<br></li></ul><strong><u>Daily Responsibilities<br></u></strong><ul><li>Designing, developing, and maintaining business intelligence solutions with Power BI and Tableau</li><li>Crafting and executing queries upon request for data</li><li>Presenting information through reports and visualization</li><li>Translate business needs to technical specifications</li><li>Design, build and deploy BI solutions in Power BI and Tableau</li><li>Evaluate and improve existing BI systems</li><li>Collaborate with teams to integrate systems</li><li>Develop and execute database queries and conduct analyses</li><li>Create visualizations and reports for requested projects</li><li>Develop and update technical documentation<br></li></ul><strong><u>Key Projects<br></u></strong><ul><li>Store development initiatives hub</li><li>Power platform data base tracking all the initiatives. Apart of the re intervention program </li><li>Power platform system<br></li></ul><strong><u>Dis Qualifiers<br></u></strong><ul><li>NEED POWER BI AND TABLEAU</li><li>Need to have good verbal and written communication skills</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3477139907"},
{"title": "Java Developer", "location": "\n              Englewood, CO\n            ", "company_name": "\n                Calsoft Labs - An Alten Group Company\n              ", "position_name": "Java Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Project Management, Information Technology, and Engineering\n          ", "company_sector": "\n          IT Services and IT Consulting, Renewable Energy Semiconductor Manufacturing, and Semiconductor Manufacturing\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>5 years’ experience in a similar hands-on technical Systems/Support role.</p><p>Experience in installing and supporting software products. Excellent computer and IT skills. Experience of working with radio automation systems would be useful.</p><p>Ability to take a pro-active approach to keeping internal support systems up to date (e.g. bug tracking, ticketing systems, wiki, documentation repositories)</p><p>Testing new release of our broadcast studio systems software. Helping improve and grow the product in the North American market.</p><p></p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3472335673"},
{"title": "Java Engineer", "location": "\n              United States\n            ", "company_name": "\n                Prosoft, IT Staffing and Consulting\n              ", "position_name": "Java Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting, Software Development, and Hospitals and Health Care\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Java Engineer (Backend)</strong></p><p><strong> </strong></p><p><strong>Prosoft</strong> is seeking qualified candidates for a <strong>Java Engineer </strong>role with our enterprise client in Louisville, Kentucky. </p><p> </p><ul><li>This is a<strong> full-time, long-term </strong>contract position (no end date), with the ability to convert to a permanent role at the client and we offer <strong>Medical, Dental, and Vision benefits </strong>and a <strong>401k with company match</strong> </li><li>This position is open to local, or U.S. based remote candidates able to work an Eastern or Central Time Zone schedule</li><li><strong><em>This role is not open to C2C candidates </em></strong></li></ul><p> </p><p><strong>About the Role and You:</strong></p><p><strong> </strong></p><p>As a Java Engineer you are a technical expert in backend development and have worked on building new applications and modernizing existing ones. You are someone that is up for the challenge of working in an enterprise environment for an industry leading, Fortune 100 company. You have experience working with a wide range of tools and technologies like Java, Spring Boot, Azure, Microservices, Node.js, APIs, Kafka, and Kubernetes. You have a strong understanding of all aspects of the software development life cycle, microservices architecture, security, development standards, best-practices, CI/CD, testing, and performance. As a Java Engineer you will be tasked with writing new code, testing, and debugging, providing technical decision making, and helping solve complex, enterprise-wide technical problems. </p><p> </p><p><strong>Position Responsibilities: </strong></p><p><strong> </strong></p><ul><li>The Java Engineer should be well-versed in modern development technologies</li><li>Build new systems, services, and applications focused on improving and simplifying the end-user experience, while keeping scalability and security in mind and adhering to best-practices and modern development standards </li><li>Design and develop new applications, features, and enhance existing applications</li><li>Work collaboratively as part of an Agile Scrum team</li><li>Work with Developers, Technical Leads, and Architects to implement new platforms and applications that solve complex business problems</li><li>Perform testing, troubleshooting, and debugging software as needed and maintain technical documentation</li></ul><p><strong> </strong></p><p><strong>Required Qualifications:</strong></p><ul><li><strong>5 or more years of software development experience</strong></li><li>Experience working with Java, Microservices, Spring Boot, Node.js, APIs, Kafka, Kubernetes, Azure, etc. for backend development</li></ul><p><strong> </strong></p><p><strong>Desired Qualifications:</strong></p><ul><li><strong>Experience with Content Management (CMS) tools like Sitecore or Adobe Experience Manager (AEM)</strong></li><li>Unit testing and test-driven development (TDD)</li><li>Experience with application security, authentication, and authorization, etc.</li><li>Experience with and understanding of W3C / Web Accessibility Standards</li></ul><li>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3477142246"},
{"title": "Java Developer", "location": "\n              Jacksonville, FL\n            ", "company_name": "\n                SGS Technologie\n              ", "position_name": "Java Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>We are hiring for<strong> Fullstack Java Developer</strong> for a long-term opportunity to work with one of our clients located in Jacksonville, FL.</p><p><br></p><p><strong>Fullstack</strong> <strong>Java Developer</strong></p><p><strong>Location: REMOTE 100% </strong></p><p><strong>Job Type: Contract (Long Term) - W2 </strong></p><p><br></p><p><strong>JOB SUMMARY:</strong></p><p>JAVA Developers are responsible for the development, programming, and coding of Information Technology solutions. They will engage in all phases of the software development lifecycle which include: gathering and analyzing user/business system requirements, responding to outages and creating application system models. Developers are responsible for documenting detailed system specifications and will participate in evaluating, conducting performance testing, and all planned and unplanned maintenance for both internally developed applications and purchased products. They participate in design meetings and consult with clients to refine, test and debug programs to meet business needs and interact and sometimes direct third-party partners in the achievement of business and technology initiatives. Developers are responsible for including IT Controls to protect the confidentiality, integrity, as well as availability of the application and data processed or output by the application.</p><p><br></p><p><strong>REQUIRED EXPERIENCE:</strong></p><p>3-5 years of experience as a Java Developer</p><p>Efficient knowledge in SQL and Spring Boot -Experience working in an Agile environment required -Preferred to have Kafka experience</p><p><br></p><p>Regards,</p><p>Fathima Nuzha</p><p>Senior Technical Recruiter</p><p>SGS Technologies Inc</p><p>Ph: (904) 644 3721</p><p>fathima@sgstechie.com</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3477378843"},
{"title": "Software Engineer I (Android) - Only W2", "location": "\n              United States\n            ", "company_name": "\n                Flexton Inc.\n              ", "position_name": "Software Engineer I (Android) - Only W2", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Responsibilities:</strong></p><ul><li>Design and build advanced applications for the Android platform.</li><li>Collaborate with cross-functional teams to define, design, and ship new features.</li><li>Work with outside data sources and APIs</li><li>Unit-test code for robustness, including edge cases, usability, and general reliability.</li><li>Work on bug fixing and improving application performance.</li><li>Continuously discover, evaluate, and implement new technologies to maximize development efficiency.</li></ul><p><strong> </strong></p><p><strong>Requirements and skills</strong></p><ul><li>BS/MS degree in Computer Science, Engineering, or a related subject</li><li>Proven software development experience and Android skills development</li><li>Proven working experience in Android app development and have published at least one original Android app.</li><li>Experience with <strong>Android SDK, Java, Kotlin</strong></li><li>Experience working with remote data via REST and JSON</li><li>Experience with third-party libraries and APIs</li><li>Working knowledge of the general mobile landscape, architectures, trends, and emerging technologies</li><li>Solid understanding of the full mobile development life cycle.</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3450280495"},
{"title": "Python Developer", "location": "\n              Seattle, WA\n            ", "company_name": "\n                AllSTEM Connections\n              ", "position_name": "Python Developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology\n          ", "company_sector": "\n          Banking\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Contract Length:</strong> 4 month contract with possible extensions</p><p><strong>Location:</strong> 100% remote (but manager sits in Seattle, WA)</p><p><strong>Max Pay:</strong> $65/hr.</p><p>*There will be a Python Pre-assessment test before the interview*</p><p> </p><p><strong>Responsibilities</strong></p><ul><li>Develop data pipeline to orchestrate the lifecycle of crowd grading tasks, build dashboard to monitoring and reporting the quality of tasks</li><li>Programming in one of the following languages: Java, Python, Scala</li><li>Audit a wide variety of data for correctness</li></ul><p><strong>Required Skills</strong></p><ul><li>Programming language - Python, Java, or Scala</li><li>Familiarity with Git or similar version control system</li><li>Good understanding of data processing concepts and data engineering process.</li><li>Able to frequently collaborate closely with a diverse tight-knit team</li><li>Experience investigating and/or debugging problems</li><li>Able to track, analyze, and report issues in a timely manner</li><li>Attention to detail and a commitment to quality, while delivering work on schedule</li><li>Highly organized and efficient</li><li>Flexibility to respond and react to changing priorities quickly and efficiently</li><li>Excellent oral and written communication in English</li></ul><p><br></p><p><strong>Highly Desired Skills</strong></p><ul><li>Big data processing, e.g. Spark/Hadoop</li><li>Cloud based services, e.g. AWS</li><li>Workflow management tools, e.g. Apache Airflow</li><li>SQL</li><li>UI design fundamentals</li><li>Web development technologies, such as React for JS</li><li>QA/QE</li></ul><p><br></p><p><strong>Education</strong></p><p>BA or BS degree or equivalent work experience.</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3467849346"},
{"title": "Senior Machine Learning Engineer", "location": "\n              New York, NY\n            ", "company_name": "\n                Burtch Works\n              ", "position_name": "Senior Machine Learning Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Information Technology, Engineering, and Research\n          ", "company_sector": "\n          IT Services and IT Consulting, Software Development, and Research Services\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Job Description: </strong></p><p><br></p><p><strong> </strong></p><p><strong>Senior Machine Learning Engineer</strong></p><p><br></p><p><strong> </strong></p><p><strong>At Turing Labs, we’re driven to build software that helps Consumer Packaged Goods (CPG)</strong></p><p><strong>companies create products that are safer, smarter, and leaner. Our platform uses data, AI, and</strong></p><p><strong>technology that enable CPG companies to develop new products 10x faster than the traditional</strong></p><p><strong>trial-and-error process.</strong></p><p><strong>As a Senior Machine Learning Engineer, you will develop cutting-edge algorithms and</strong></p><p><strong>production machine learning systems for consumer product innovations. You will work with</strong></p><p><strong>design and engineering teams to create intelligent workflows on the Turing Labs platform. Your</strong></p><p><strong>work will translate into new products on the shelf, and ultimately it will benefit millions of</strong></p><p><strong>people’s lives.</strong></p><p><br></p><p><strong> </strong></p><p><strong>You will:</strong></p><p><br></p><p><strong>● Research, prototype and productionize state-of-the-art machine learning algorithms and</strong></p><p><strong>systems in Turing Lab’s AI platform.</strong></p><p><strong>● Work on probabilistic graphical models, bayesian inference, optimization, explainable AI</strong></p><p><strong>and causal inference.</strong></p><p><strong>● Automate data analysis, data visualization and build data pipelines.</strong></p><p><strong>● Build and maintain the infrastructure for data and model management.</strong></p><p><strong>● Collaborate with product, engineering and design teams to build intuitive workflows for</strong></p><p><strong>consumer product innovation.</strong></p><p><br></p><p><br></p><p><strong>You are a good fit if you:</strong></p><p><br></p><p><strong> </strong></p><p><strong>● Have 5+ years of professional experience in machine learning or have a Ph.D. in</strong></p><p><strong>Computer Science, Statistics, Mathematics, or Physics.</strong></p><p><strong>● Have experience in probabilistic graphical models, bayesian inference and optimization.</strong></p><p><strong>● Are proficient with Python and R.</strong></p><p><strong>● Have experience with Python data science stack (e.g., SciPy, NumPy, Pandas, PyTorch).</strong></p><p><strong>● Have demonstrated end-to-end ownership of projects.</strong></p><p><strong>● Have worked in a fast-paced team environment.</strong></p><p><strong>● Can communicate proactively and effectively.</strong></p><p><strong>● (Bonus) Have experience with deep learning, especially transformers and graphical</strong></p><p><strong>neural networks.</strong></p><p><br></p><p><strong> </strong></p><p><strong>Perks</strong></p><p><strong><span class=\"ql-cursor\"> </span></strong></p><p><strong>● Competitive salary, bonus, and equity package.</strong></p><p><strong>● Work from home with unlimited vacation policy.</strong></p><p><strong>● Platinum level medical insurance 100% covered for individuals and 70% covered for</strong></p><p><strong>dependents.</strong></p><p><strong>● Dental and Vision insurance.</strong></p><p><strong>● 401k with 4% employer matching.</strong></p><p><strong>● $1,500 home office benefit.</strong></p><p><strong>● Reimbursement of home Internet.</strong></p><p><strong>● Professional growth education sponsorship.</strong></p><p><strong>● Mentorship program.</strong></p><p><strong>● Health and well-ness focused programs.</strong></p><p><strong>● Weekly virtual social events and annual company retreats.</strong></p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3472314248"},
{"title": "Software Engineer", "location": "\n              United States\n            ", "company_name": "\n                Aditi Consulting\n              ", "position_name": "Software Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Contract\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>MUST HAVE SKILLS: </strong></p><ul><li>10+ years of hands-on software development experience including design, development, debugging and support, building scalable software systems and software infrastructure.</li><li>Experience with programming languages (<strong>Java, Python, Go</strong>) and software debugging tools <strong>(jdb, jmx</strong>) </li><li>In-depth understanding of scale out infrastructure, distributed systems and web services technologies.</li><li>Experienced in designing and applying data structures, algorithms, and object-oriented concepts to solve challenging problems</li><li>Experience working with <strong>ODL, REST, RESTCONF and RPC</strong> services and other client/server models </li><li>Building and delivering mission critical, 24x7 production quality software systems</li><li>Transforming the monolithic software systems into micro service-oriented software systems</li><li>Experience in Linux environments with Linux automation scripting and/ or software development <strong>(Ansible, Python, Bash)</strong> </li><li>Experience with <strong>Linux networking &amp; virtualization environments/technologies (KVM, containers)</strong> and container scheduling/management platforms <strong>(Docker, Kubernetes)</strong> </li><li>Open-Source tools development, implementation, and/or collaboration experience</li><li>Strong problem-solving skills, ability to analyze and implement enhancements to existing applications/code</li><li>Strong written &amp; verbal communication skills</li></ul><p><br></p><p><strong>DESIRED SKILLS: </strong></p><ul><li>Experience using source code tracking and version control systems (Stash/GIT/GitLab)</li><li>Experience in an agile development environment as part of a team of engineers, developers and testers</li><li>Experienced in integrating and developing messaging infrastructures (Kafka, thrift, proto-buf)</li><li>Experience with open-source logging and reporting solutions (Logstash, Elasticsearch, Kibana, Grafana, Splunk)</li><li>Database development experience (MongoDB, Redis, Cassandra, SQL/NoSQL)</li><li>Open API (REST/RESTCONF/NETCONF) and data modeling (YANG) verification and development</li><li>New technology validation, prototyping and integration experience</li><li>Multi-vendor system integration experience</li><li>Developing applications using microservice architecture</li><li>High Availability and distributed software architecture development &amp; design</li><li>ODL (Open-Day-Light) controller internals and experience in developing ODL applications</li><li>Understanding of SDN architecture and technology (control plane, data plane, management plane, orchestration, etc.)</li></ul><p><br></p><p><strong>EDUCATION/CERTIFICATIONS: experience</strong></p><p>· BS/MS degree in Computer Science/Computer Engineering or equivalent engineering Discipline/ experience</p><p><strong>Compensation, Benefits and Ancillaries</strong></p><p><strong>Compensation</strong></p><p>· This is the base hourly pay range that Aditi Consulting reasonably expects to pay someone for this position $55/hr - $60/hr (compensation may vary outside of this range depending on a number of factors, including but not limited to, a candidate’s qualifications, skills, competencies, experience, location, and end client requirements).</p><p><br></p><p><strong>Benefits and Ancillaries</strong></p><p>· Medical, dental, vision, PTO benefits and ancillaries may be available for eligible Aditi Consulting employees and vary based on the plan options selected by the employee.</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3442985818"}
]