[
{"title": "Clinical Research Scientist", "location": "\n              Minnesota, United States\n            ", "company_name": "\n                Brunel\n              ", "position_name": "Clinical Research Scientist", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Full-time\n        ", "function_name": "\n            Research and Science\n          ", "company_sector": "\n          Medical Equipment Manufacturing\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>The Clinical Research Scientist will support and guide clinical studies (US and OUS) within the company's scope of medical devices. This individual will deliver sound clinical evidence generation in order to drive better patient outcomes with the use of their inventions.</p><p><br></p><p><strong>Responsibilities</strong></p><ul><li>Lead protocol development, revisions, submission, and approval, including consensus building with study steering committee and principal investigators</li><li>Support clinical patient enrollment efforts</li><li>Serve as Scientiﬁc Lead on sponsored clinical studies</li><li>Be the point person for scientific questions during execution of these clinical studies</li><li>Execute publication/presentation charter development for clinical studies</li><li>Responsible for scientific content for all trial related documents</li><li>Develop annual and final report content development, coordination of content from various stakeholders.</li><li>Perform data analysis and interpretation</li><li>Develop maintain and review periodical study reports. Review for outliers, ranges, potentially problematic data, identify and communicate root causes from input error to inadequate field edits, and suggest possible solutions, thereby documents data observations, and follow pre-established processes and procedures</li></ul><p><br></p><p><strong>Requirements</strong></p><ul><li>MD or PhD or advance degree in life sciences required</li><li>At least 3 years of Clinical Science/Research experience in Cardiology/Cardiovascular space or Clinical Science/Research experience in Med Devices</li><li>Experience with scientific contribution to large multicenter clinical trials preferred</li><li>Proficiency in Med terminology, medical writing, experience with following ICMJE guidelines</li><li>Good understanding of Biostatistics; ability to use statistical programs such as Matlab, SPSS or SAS a strong plus</li><li><span>Knowledge of healthcare ethics, compliance regulations</span></li></ul><p><br></p><p><strong>What We Offer</strong></p><p>Why work with Brunel? We are proud to offer exciting career opportunities from over 100 offices globally in 42 countries. Advancing your career takes time and effort – let us match you to your ideal position.</p><p><br></p><p><strong>About Us</strong></p><p>Brunel has a reputation for working with some of the best in the business. That’s what we continually strive for. Over 45 years, we’ve created a global network of interesting clients and talented individuals working together through a vast array of services.</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3548475770"},
{"title": "Research Scientist - Software Engineering (Remote Option)", "location": "\n              United States\n            ", "company_name": "\n                Talentify.io\n              ", "position_name": "Research Scientist - Software Engineering (Remote Option)", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Full-time\n        ", "function_name": "\n            Other\n          ", "company_sector": "\n          Human Resources Services\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        Talentify helps candidates around the world to discover and stay focused on the jobs they want until they can complete a full application in the hiring company career page/ATS.<p><br></p><strong><u>Responsibilities</u></strong><p><br></p>Peraton Labs is looking for an experienced software engineer with strong programming skills to help research, build, and enhance systems implementing distributed operations. The successful candidate will have a track record of working effectively in teams, proactively identifying issues, and independently solving problems. The candidate will have demonstrably good communication skills that facilitate collaboration on large systems development efforts. Projects within the lab will typically involve technologies such as microservices, container-based orchestration, machine learning, natural language processing, cyber security, virtualization, HTTPS/TCP/IP networking and operating system internals, thus experience with some or all of these would be a significant plus. Projects will involve a mix of research and development, and will range from applied research to advanced prototyping and demonstrations. The ideal candidate will be one who enjoys learning new skills and is able to work independently.<p><br></p><strong><u>Qualifications</u></strong><p><br></p>BS 5-7 Years, MS 3-5, PhD 0-2<p><br></p><ul><li>Degree in Computer Science, ECE, or a related field</li><li>Ability to solve problems designing and implementing complex systems independently</li><li>Strong system skills (Linux, Windows, shell scripting, VM technologies)</li><li>Experience demonstrating implemented capabilities to customers</li><li>Strong software development skills (C/C++, Java, scripting languages: Python/Perl).</li><li>Experience with TensorFlow, PyTorch is a plus.</li><li>Experience with source control tools such as \"git\"</li><li>Experience with working in DevSecOps environment</li><li>Familiarity with networking using PubSub systems, HTTPS, TCP/UDP/IP</li><li>US citizenship is required.</li></ul><p><br></p><strong><u>Peraton Overview</u></strong><p><br></p>Peraton drives missions of consequence spanning the globe and extending to the farthest reaches of the galaxy. As the world's leading mission capability integrator and transformative enterprise IT provider, we deliver trusted and highly differentiated national security solutions and technologies that keep people safe and secure. Peraton serves as a valued partner to essential government agencies across the intelligence, space, cyber, defense, civilian, health, and state and local markets. Every day, our employees do the can't be done, solving the most daunting challenges facing our customers.<p><br></p><strong>Target Salary Range</strong><p><br></p>$112,000 - $179,000. This represents the typical salary range for this position based on experience and other factors.<p><br></p><strong>EEO Tagline (Text Only)</strong><p><br></p>An Equal Opportunity Employer including Disability/Veteran.<p><br></p><em>By submitting your interest in this job, you agree to receive text notifications with additional steps to complete your job application. You will receive up to 6 messages from the number \"63879\". Message &amp; data rates may apply. Please refer to our privacy policy for more information.</em>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3555798989"},
{"title": "Senior Machine Learning Engineer, Gigster Network", "location": "\n              United States\n            ", "company_name": "\n                Gigster\n              ", "position_name": "Senior Machine Learning Engineer, Gigster Network", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Full-time\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          Software Development\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        Do you want to work on cutting-edge projects with the world’s best developers? Do you wish you could control which projects to work on and choose your own pay rate? Are you interested in the future of work and how the cloud will form teams? If so - the Gigster Talent Network is for you.<p><br></p>At Gigster, whether working with entrepreneurs to realize 'the next great vision' or with Fortune 500 companies to deliver a big product launch, we build really cool solutions that make a difference! From blockchain to AI/ML to VR and more, Gigster builds enterprise software on cutting-edge technology.<p><br></p>Suppose the following belief drives your work and you are passionate about Machine Learning and Data and have an extensive experience in Python. In that case, you'll get to shape the future by creating data models for various companies, some similar to SpaceX, Anduril, HackerOne, and Cloud9.<p><br></p>But you have to share our stand in not doing analysis just for the sake of analysis or in reporting on everything under the sun because you can. You have to be passionate about building data science applications that are actually useful. Applications that use your client's data to help them improve user acquisition. To reduce churn. To improve underwriting. In other words: to believe in data that should be directly tied to your client's business value.<p><br></p>If you want to be part of a world-class network with access to cool projects, this is the place for you!<p><br></p><strong>Responsibilities</strong><p><br></p><ul><li>Programming the Machine Learning model</li><li>Find out new insights using the data </li><li>Testing extensively.</li></ul><p><br></p><strong>Requirements</strong><p><br></p><ul><li>At least 2 years of experience with ML</li><li>Strong skills in Python</li></ul><p><br></p><strong>Nice to have</strong><p><br></p><ul><li>Big Data processing (Spark, Dask)</li><li>Quantitative finance</li><li>Time-series modeling</li><li>Leveraging NLP to extract features from text data</li><li>Deep Learning frameworks (Tensorflow or Pytorch)</li></ul><p><br></p><strong>Benefits</strong><p><br></p><ul><li>World-class network. Be part of a network with the most talented people in the world.</li><li>Amazing cutting-edge projects. Pick the projects from F500 companies that you’re interested in.</li><li>100% remote and global. Live your best life, wherever that may be, and never lose out on career opportunities because of it.</li><li>Flexible work hours. There is a time to overlap with the customer’s timezone, but most of the time we work asynchronously and don’t care when you’re online, just that you deliver great results.</li><li>Flexible offerings. Choose how many hours you want to work and how much you want to earn.</li><li>Swag! Because who doesn’t love swag?</li></ul><p><br></p>The Gigster Talent Network is a highly curated set of the best software developers in the world. It’s not easy to become part of this select network - but when you do - you will work amongst the best from Silicon Valley and around the world.<p><br></p>Our model is unique in the software development industry. We do the hard work of finding the US clients and scoping their projects - and you get to choose from a large variety of ‘Gigs’. You can choose Gigs that fit your schedule - from 10, 20, or 40 hours a week. You also get to choose your pay rate. All projects are staffed with a project manager, full stack team, QA, and DevOps.<p><br></p>All of our projects are for top-tier US companies and are delivered with the highest quality. Projects range from developing NFT marketplaces to VR imaging for medical use to large AI/ML projects. We even produce a case study for every project delivered - so you can take that with you as part of your portfolio.<p><br></p>In parallel - you will have access to an exclusive and energized network of the world’s most skilled experts. Community members collaborate inside and outside of Gigs - as well as at local community events, online hackathons, competitions, etc. The Gigster Talent Network is more than a simple marketplace - it’s truly an exclusive club.<p><br></p>Are you talented enough to be in the club?\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3552274441"},
{"title": "Senior Backend Engineer - Applied Machine Learning", "location": "\n              Boston, MA\n            ", "company_name": "\n                Notarize\n              ", "position_name": "Senior Backend Engineer - Applied Machine Learning", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Full-time\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        What is Notarize? There are 1.25 billion notarizations a year in the US alone. Home purchase, designation of beneficiaries, medical authorization for minors, powers of attorney, vehicle certification of ownership, notarizations power life’s most important transactions. At Notarize we’re leveraging industry best practices, to make these transactions easy, secure, and available. Above all Notarize is the platform that customers can trust. It is why Notarize is the industry leader in Online Notarization.<br>It is why we were able to grow over 600% the last year, raise $160M in series D funding from investors like Capitol G (Google), Citi, and Wells Fargo, why Forbes named us to their next billion dollar startup list.<br>Notarize is building a document classification system to help identify and route the millions of documents we ingest each year. As a member of the Document Automation Services team you will be building the engine that informs and optimizes many of Notarize’s current processes. You’ll work with large companies to identify their most common documents to automatically tag and process them, reducing manual intervention. You’ll work with sales to identify opportunities by looking at which documents are commonly uploaded to the platform. More than anything you will be asked what we’re missing and what can we do to make our product run more efficiently.<br><strong>Responsibilities<br></strong><strong>What you will do:<br></strong><ul><li>Design, build, and maintain our document recognition servicesIdentify and model common document types</li><li>Develop processes to identify model misses and retraining of assets</li><li>Mentor junior engineers on best practices and design principles</li><li>Lead and be led. We expect all of our senior developers to be able to lead projects as well as contribute to projects led by their peers. </li><li>Build integrations with existing document classifiers, version strategy on classification, new document tags and labels<br></li></ul><strong>Requirements<br></strong><strong>Must haves:<br></strong><ul><li>Experience and desire to work on NLP projects</li><li>Experience with Python and PyTorch3+ years of experience maintaining and developing web applications</li><li>Experience working with a team of engineers on product development</li><li>The ability to work autonomously and own problems from end to end</li><li>Effective communication and active listening skills<br></li></ul><strong>Nice to haves:<br></strong><ul><li>Experience with Ruby on Rails</li><li>Experience with SageMaker and/or TensorFlow</li><li>Experience with the development and maintenance of machine learning models in a cloud environment</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3514768811"},
{"title": "Remote Senior Machine Learning Engineer", "location": "\n              Charlotte, NC\n            ", "company_name": "\n                Jobot\n              ", "position_name": "Remote Senior Machine Learning Engineer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Full-time\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          IT Services and IT Consulting and Software Development\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        Want to learn more about this role and Jobot? Click our Jobot logo and follow our LinkedIn page!<p><br></p>Job details<p><br></p><strong>Remote Senior Machine Learning Engineer</strong><p><br></p>This Jobot Job is hosted by Samantha Lima<p><br></p>Are you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume.<p><br></p>Salary $155,000 - $185,000 per year<p><br></p><strong>A Bit About Us</strong><p><br></p>My client understands the importance of education and generations to come which is why they work to bridge the gap when it comes to virtual learning and STEM education. They work to provide an online one-stop-shop for all things STEM, from providing a deep understanding of the importance, to learning tools to better further yourself.<p><br></p><strong><br><br><strong>Why join us?<br></strong></strong><p><br></p><strong>Benefits</strong><p><br></p><ul><li> Health, Dental, Vision Employees + Dependents</li><li> 401(k)</li><li> Flexible PTO</li><li> Paid holidays</li><li> Paid Parental Leave</li><li> Advancement opportunities</li></ul><p><br></p><strong>Job Details</strong><p><br></p><strong>Job Overview</strong><p><br></p><ul><li> Deduce critical events and features of rich signals and data points required to create powerful ML algorithms</li><li> Design &amp; build ML algorithms that translate detected events and features into actionable end-user feedback</li><li> Verify algorithms by running tests on data from real-world deployments - testing will guide next iteration of testing</li></ul><p><br></p>Job Requirements (5+ years)<p><br></p><ul><li> experienced building machine learning systems at scale</li><li> Advanced in at least one language (e.g. Python) and ML/DL framework (e.g. PyTorch, TensorFlow)</li><li> SQL, AWS, Git</li><li> Architecting, building and applying dep learning models</li><li> LLM's and NLP's</li><li> Read and synthesize SOTA methods from literature</li><li> Contributed ideas and/or concepts that support the generation of intellectual property or published papers</li></ul><p><br></p>Bonus<p><br></p><ul><li> Hands on GPUs</li><li> big-data tech and distributed environments</li></ul><p><br></p>Interested in hearing more? Easy Apply now by clicking the \"Apply\" button.<p><br></p><strong>Want to learn more about this role and Jobot?</strong><p><br></p>Click our Jobot logo and follow our LinkedIn page!<p><br></p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3552093489"},
{"title": "Lead Data Scientist", "location": "\n              Dallas-Fort Worth Metroplex\n            ", "company_name": "\n                Cambium Assessment\n              ", "position_name": "Lead Data Scientist", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Full-time\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          E-Learning Providers\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>The Machine Learning Lead Data Scientist is an important role within the machine learning team at CLG. As an interdisciplinary group of mathematicians, computer scientists, psychometricians, and software engineers, we seek to provide innovative solutions to problems arising in educational assessment and measurement. Our primary focus is natural language processing, with key foci in the automated scoring of student responses for both summative and interim assessments, automated feedback for formative assessments, and automated alerting of disturbing content in student responses. Our team prototypes state-of-the-art pipelines in speech and text. We are currently seeking a Lead Data Scientist to join our team remotely or in the Washington, DC office. Our ideal candidate has a background in machine learning, pretrained transformer-based models, recurrent neural networks, and general methods in natural language processing.</p><p><br></p><p><strong>Job Responsibilities</strong></p><ul><li>Work as a member of CLG’s Assessment division on the machine learning team</li><li>Apply and develop cutting edge machine learning methods to solve problems arising in standardized tests for students</li><li>Develop prototypes and models that can be easily transitioned into production systems.</li><li>Write technical reports and/or journal papers on applications of machine learning to educational assessment</li><li>Apply appropriate metrics to validate scientific techniques and utilize information obtained from baselines or historical data</li><li>Research and develop general methods in NLP and related fields</li><li>Process large amounts of data for statistical modeling</li></ul><p><br></p><p><strong>Job Requirements</strong></p><ul><li>MS or PhD in Mathematics, Statistics, Computational Linguistics, Computer Science, Physics or Engineering.</li><li>Demonstrated ability and understanding of numerical methods and machine learning algorithms</li><li>Background in machine learning and neural networks.</li><li>Experience designing systems using Python and hands-on experience using Scikit-Learn and either PyTorch or Tensorflow.</li><li>Must possess an analytical mindset and strong programming skills</li><li>Experience working on large data sets</li><li>The ability to read and write technical reports and/or academic papers</li><li>Self-motivated with minimal oversight</li><li>Experience with pretrained transformer-based language models is a plus</li></ul><p><br></p><p><strong>Why Work With Us?</strong></p><p>When you work with Cambium Assessment, you’ll be helping to design and build inspiring solutions that make a real impact on the online testing industry, as well as the educators and students we support.</p><p><br></p><ul><li>Our systems are highly scaled and mission critical serving over a third of all students in grades 3-8 in the United States.</li><li>Our web applications are highly interactive and universally accessible.</li><li>Our machine scoring methods are driven by artificial intelligence allowing computers to perform such complex operations as grading essays with more accuracy than humans.</li><li>Our processes use intensive algorithmic computing allowing a customized experience for each student as the exam adapts real-time based upon answers given.</li></ul><p><br></p><p><br></p><p>In the 2021–2022 school year, we delivered more than 100 million online tests, successfully supported peak testing volumes exceeding 1.3 million simultaneous test takers, while ensuring an average response time of less than a tenth of a second. We have the most advanced features of any online testing system, and we continue to push boundaries to improve student performance measurement and enabling educators with actionable insights to drive better overall educational outcomes for our students. To learn more about our organization and the exciting work we do, visit www.cambiumassessment.com</p><p><br></p><p><strong>An Equal Opportunity Employer</strong></p><p><br></p><p><em>We are dedicated to fostering a culture that celebrates unique backgrounds, ideas, and experiences. All qualified applicants will receive consideration for employment without discrimination on the basis of race, color, religion, sex, gender, gender identity/expression, sexual orientation, national origin, protected veteran status, or disability.</em></p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3548476714"},
{"title": "Senior Data Scientist", "location": "\n              United States\n            ", "company_name": "\n                Fusion Risk Management\n              ", "position_name": "Senior Data Scientist", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Full-time\n        ", "function_name": "\n            Product Management\n          ", "company_sector": "\n          Software Development\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>The Role </strong></p><p>The Senior Data Scientist is a key role within the product management organization responsible for developing data strategies, proposing data platforms and products, and building prototypes of data systems that achieve business objectives for Fusion and our customers. The Senior Data Scientist is the primary expert and owner of our data approach and platform. </p><p><br></p><p><strong>Responsibilities</strong></p><ul><li>In partnership with our product managers, develop a vision for the future of our product leveraging data to deepen insights and make our products more useful </li><li>In partnership with engineering, develop a strategy for productizing data-based features and making them reliable, secure, and performant </li><li>Extract and analyze data from our products and customers using self-service tools included in the Salesforce platform, including Tableau and Tableau CRM extensions </li><li>Build prototypes and proofs-of-concept in your preferred language or tool to quickly solve a problem and provide insight or demonstrate a workable approach </li><li>Over time, develop techniques to perform analysis on the Salesforce platform for easier translation into productized features </li><li>Lead the company in selecting the appropriate statistical or machine learning technique for different circumstances and correctly communicating the strengths, weaknesses, and limitations of each </li><li>In partnership with our Sales and Professional Services teams, support high-profile customers and projects as an analytics and data science expert and analyst and see these projects through to completion </li></ul><p><br></p><p><strong>Knowledge, Skills, and Abilities</strong> </p><ul><li>Bachelor's degree in Math, Data Science, Computer Science, or related discipline. A master’s degree, Ph.D. or certifications in Math, Data Science, or Analytics will also be considered a significant plus </li><li>3+ years of relevant professional experience (data science role, data engineering, actuarial experience, or performing management activities for a data-centric product or platform) required </li><li>Consistent and effective leadership attributes </li><li>Tech Savvy and technologically curious; You enjoy tinkering with and learning new platforms and environments </li><li>Strong quantitative skills </li><li>Ability to lead others and evangelize your ideas, especially in situations when you may not have formal authority </li><li>Understand the agile product development process and can work in a fast-paced environment </li><li>Salesforce.com or Lightning experience or certification preferred </li><li>Working knowledge of the following concepts: relational databases, agile development, security/access control, and cloud computing </li><li>Strong writing skills: ability to explain in a formal document or in a business document your approach, techniques, and proper interpretation of a piece of analysis </li><li>Ability to be a self-starter; demonstrating the ability to work independently and collaborate with multiple teams </li><li>Passionate about working in a small team and fast-moving entrepreneurial environment </li></ul><p><strong>Disclaimers</strong></p><p>Fusion Risk Management, Inc. is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, disability, sex, sexual orientation, gender identity or national origin. Nothing in this job posting should be construed as an offer or guarantee of employment.</p><p><br></p><p>This position may be performed remotely anywhere within the United States except for the states of New York, California and Colorado.</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3532040221"},
{"title": "Senior Data Scientist - Telematics (REMOTE)", "location": "\n              Charlotte, NC\n            ", "company_name": "\n                The Hartford\n              ", "position_name": "Senior Data Scientist - Telematics (REMOTE)", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Full-time\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          Financial Services\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        You are a driven and motivated problem solver ready to pursue meaningful work. You strive to make an impact every day &amp; not only at work, but in your personal life and community too. If that sounds like you, then you've landed in the right place.<p><br></p><strong>Job Description</strong><p><br></p>You are a driven and motivated problem solver ready to pursue meaningful, foundational work. You strive to make an impact every day not only at work, but at home and in the community too. If that sounds like you, then you’ve landed in the right place.<p><br></p><strong>Overview Of The Position</strong><p><br></p>The Hartford seeks an energetic and passionate data scientist with experience in telematics to support the design, development, and implementation of telematics solutions that will modernize and transform our business and operations.<p><br></p>The ideal candidate brings domain expertise in telematics and a track record of excellence in validation and application of telematics data, such as data quality testing, feature engineering, loss and retention modeling, rating plan development, and driver coaching.<p><br></p>In this role, you will be part of a team working across the data stack – from tried-and-true methods to cutting edge machine learning applications – to influence the future of telematics across our business. Success will depend on your ability to work independently as well as drive collaboration with partners across technical and business teams to define and lay the foundations of telematics at The Hartford.<p><br></p><strong>Responsibilities</strong><p><br></p><ul><li>Identify and assess the value of new data sources and analytical techniques to ensure ongoing competitive advantage</li><li>Articulate the costs and value-adds of ML solutions or operational decisions</li><li>Remain current on data science and machine learning techniques and state-of-the-art tools</li><li>Engage with technical and business stakeholders to define and design solution concepts</li><li>Support and conduct the design and implementation of complex technological Proofs of Concept and data-driven products</li></ul><p><br></p><strong>What’s in it for you?</strong><p><br></p><ul><li>Experience deeper understanding of data analysis, emerging technologies and development practices. </li><li>Collaboration with multiple high-performing, forward-focused teams across technology and business operations</li><li>Opportunity to expand your communication, analytical, interpersonal, and organizational capabilities</li><li>Experience working in a fast-paced environment driving business outcomes</li><li>Enhance your entrepreneurial mindset – build your network and influence outcomes</li><li>Supportive environment fostering your can-do attitude and finding you opportunity for growth and advancement based on consistent demonstrated performance</li><li>Leverage the depth of your data experience to optimize business value</li><li>Positioned as a key telematics knowledge source to advise business and technology leadership</li><li>Mentor teammates and colleagues</li></ul><p><br></p><strong>Qualifications: </strong><p><br></p><ul><li>Proven track record of independent research and quantitative project delivery, as demonstrated by telematics industry experience or educational attainment such as a relevant Master’s or PhD in a quantitative field (for example computer science, quantitative economics, mathematics, physics, etc)</li><li>3+ years of experience in relevant analytical roles such as data science, machine learning, product analytics, etc. with at least 2 years of directly related telematics experience</li><li>Understanding of current and emerging telematics products, services, processes, and methodologies</li><li>Experience in the following disciplines: scripting languages (ex: python), SQL (ex: Oracle, PL/SQL), and big data tools and/or cloud environments (ex: AWS, GCP, Azure; Hadoop, Spark, Snowflake)</li><li>Analytical approach with a strong ability to uncover and resolve problems by delivering innovative approaches and solutions</li><li>Self-motivated, strong sense of ownership/accountability, and results oriented with the ability to manage time and schedules effectively</li><li>Natural curiosity with a strong desire to learn, maintain, and apply knowledge of emerging data technologies</li><li>Basic understanding of Agile and CI/CD</li><li>Excellent written, verbal communication and presentation skills with ability to effectively communicate with senior leadership</li></ul><p><br></p><strong>Desired Qualifications:</strong><p><br></p><ul><li>Experience with some or all of the following: data warehousing architecture, data modeling, data management, 3rd party data</li><li>Passion for learning new skills and the ability to adjust priorities on multiple projects based on changing demands/needs</li><li>Experience in innovation, producing and rapidly delivering a minimally viable product with a “fail-fast” approach</li><li>Knowledge of Property &amp; Casualty Insurance business</li></ul><p><br></p><strong>Compensation</strong><p><br></p>The listed annualized base pay range is primarily based on analysis of similar positions in the external market. Actual base pay could vary and may be above or below the listed range based on factors including but not limited to performance, proficiency and demonstration of competencies required for the role. The base pay is just one component of The Hartford’s total compensation package for employees. Other rewards may include short-term or annual bonuses, long-term incentives, and on-the-spot recognition. The annualized base pay range for this role is:<p><br></p>$104,320 - $156,480<p><br></p>Equal Opportunity Employer/Females/Minorities/Veterans/Disability/Sexual Orientation/Gender Identity or Expression/Religion/Age<p><br></p>About Us | Culture &amp; Employee Insights | Diversity, Equity and Inclusion | Benefits<p><br></p>Sr Data Scientist - GD07AE<p><br></p>Skills:\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3552293365"},
{"title": "Senior Data Scientist", "location": "\n              Lehi, UT\n            ", "company_name": "\n                MX\n              ", "position_name": "Senior Data Scientist", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Full-time\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          Financial Services\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <strong>Life at MX<br><br></strong>We are driven by our moral imperative to advance mankind - and it all starts with our people, product and purpose. We always carry a deep sense of drive and passion with us. If you thrive in a challenging work environment, surrounded by incredible team members who will help you grow, MX is the right place for you.<br><br>Come build with us and be part of an award-winning company that’s helping create meaningful and lasting change in the financial industry.<br><br>As a Senior Data Scientist, you will have the opportunity to analyze and extract insights from a world-class financial data asset. You’ll perform in-depth, consumer-level analytics, lead big data research and discovery projects, increase overall system accuracy, and automate important (but repetitive) tasks. In addition, you’ll design and execute operational tests and provide recommendations based on careful analysis, solid business acumen, and superior problem-solving skills. The ability to turn complicated analytic results into digestible and engaging stories will be important for success, as will superior ambiguity tolerance. Your strong analytic training and background, desire to create new and unique perspectives about consumer financial behavior, collaborative spirit, and hands-on approach to solving problems will mark you as an ideal candidate for this role.<br><br><strong><u>Job Duties<br></u></strong><ul><li>Ask, refine, and answer critical business questions that bolster MX’s capabilities and competitive position through the application of advanced analytic methods, logical inference, and creative problem solving</li><li>Build, enhance, and maintain predictive models and analytic strategies focused on consumer financial behavior</li><li>Lead modeling projects, operational tests (e.g., A/B and multivariate), and data mining and exploratory work to produce actionable and novel insights and recommendations</li><li>Work closely with partners and stakeholder groups to understand long-term market needs and drive data initiatives beyond our current product portfolio</li><li>Engage in independent research projects to uncover and understand new tools, methods, and approaches that can strengthen MX’s data science platform</li><li>Create new data assets to support data science project work</li><li>Develop presentations and memoranda to communicate key messages and findings to colleagues and senior leaders</li><li>Coach and mentor data analysts on analytical best practices and data visualization<br></li></ul><strong><u>Job Requirements<br></u></strong><ul><li>Master’s degree (Ph.D. preferred) in Economics, Mathematics, Statistics, Physics, Experimental Psychology, Biology, or other quantitative discipline, including significant coursework in statistics, econometrics, or a related field</li><li>5 years of advanced analytics experience focused on building monetizable products and/or improving core business performance (e.g., revenue, EBITDA, or net income); three of those years should include practical experience building large scale predictive/machine learning/statistical models and tools from complex, specialized data pools in production systems</li><li>Expertise with (a) one or more of logistic regression, generalized linear models, or categorical data analysis and (b) multiple machine learning approaches (e.g., k-means clustering, SVM, random forest, or PCA)</li><li>Skill at wrangling varied data types (e.g., numerical, text, graph, and time series) alongside ability to analyze large pools of data to identify thematic patterns, biases, and outliers</li><li>Strong knowledge of one or more structured programming languages for statistical and/or numeric computing (e.g., Python, R, or Scala) and database query languages (e.g., SQL); exposure to modern data science environments (e.g., cloud, Jupyter, and git) would also be helpful</li><li>Critical thinking skills, intellectual curiosity, and a willingness to keep looking for better solutions</li><li>Drive to tackle demanding goals with enthusiasm, tenacity in the face of stubborn obstacles, and interest in pursuing personal and technical development alongside other commitments</li><li>Commitment to client needs and satisfaction, humility in the face of constructive, well-meaning feedback, and production of high-quality work that builds trust and confidence with stakeholders</li><li>Ability to translate strategic mission objectives into an analytical framework, project plan, and action items<br></li></ul>Please note that this position does not accept sponsorship candidates at this time. Only US-based candidates who are authorized to work in US without sponsorship will be considered for this role.<br><br>The expected on-target earnings (OTE), which is comprised of a base salary and other forms of cash compensation, such as bonus or commissions is currently $132,500 to $159,000. This pay range is just one component of MX's total rewards package. MX takes a number of factors into account when determining individual starting pay, including job and level they are hired into, location, skillset, peer compensation.<br><br><strong>Work Environment<br><br></strong>Remote/Flex<br><br>At MX, we prioritize flexible working arrangements, which allows us to attract top talent, provide improved work-life balance, and increase productivity. Our remote flex philosophy is centered on trust, responsibility, and communication. Our team members enjoy a balance of remote work and monthly in-person collaboration meetings. Travel expectations are about 15%, and the company covers travel expenses for remote employees. Local employees are encouraged to utilize in-office time on a weekly basis.<br><br>Both local and remote employees can take advantage of our incredible office space with onsite perks like company-paid meals, onsite massage therapist, a golf simulator, and mediation room to name a few.<br><br>MX is proudly committed to recruiting and retaining a diverse and inclusive workforce. As an Equal Opportunity Employer, we never discriminate based on race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, military or veteran status, status as an individual with a disability, or other applicable legally protected characteristics. We particularly welcome applications from veterans and military spouses. All your information will be kept confidential according to EEO guidelines. You may request reasonable accommodations by sending an email to hr@mx.com.<br><br>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3555831569"},
{"title": "Senior Data Scientist", "location": "\n              United States\n            ", "company_name": "\n                Aptive Resources\n              ", "position_name": "Senior Data Scientist", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Full-time\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          Business Consulting and Services\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        Aptive is seeking a <strong>Senior Data Scientist</strong> for the Department of Veterans Affairs (VA), Multi-Channel Technologies (MCT), working under the Veterans Experience Office, transforming its ability to serve Veterans through modernized VA Contact Center Omnichannel, CRM and telephony systems. This role contributes to improving the VA employees and Veteran’s lives and working towards a larger mission. This is a senior position to work in our Alexandria, VA (remote) office.<br><br><strong>Primary Responsibilities<br></strong><ul><li> The ideal Data Scientist will perform tasks that support the required delivery and advice to management regarding a diverse set of project, program and operation needs. </li><li> Experience in applying Natural Language Processing (NLP)/Machine Learning (ML)/Artificial Intelligence (AI) for processing and analyzing customer interaction and conversation data. </li><li> Build data products to extract business insights. </li><li> Develop supervised and unsupervised Artificial Intelligence (AI)/ Machine Learning (ML) models using advanced Natural Language Processing (NLP) and graph techniques. </li><li> Responsible for supporting the design, development and delivery of measurement solutions that enable VA to derive actionable insights. </li><li> Ability to apply linguistic, statistical and machine learning algorithms to text to extract meaning and understanding. </li><li> Support VA and LOBS to develop AI models using natural language algorithms for sentiment analysis, intent analysis, topic modeling and clustering, named entity recognition, semantic analysis. </li><li> Leverage your technical and analytical skills to deliver thoughtful insights that inform client business decisions. </li><li> Ability to work with large volumes of data from a variety of sources to ingest, cleanse, and prepare for AI model development. </li><li> Ability to remove PII and PHI data from data sets (Data sources to include social media conversations, chat transcripts, voice transcripts, survey data, emails, documents etc.). </li><li> Familiarity with data science tools, languages and platforms like DataBricks, Tensorflow, Hugging Face, Azure Data lake, python, sql, etc. </li><li> Ability to perform lexical, syntactic, semantic and pragmatic analysis on the customer conversation data collected from different channels. </li><li> Ability to collaborate with clients to understand client business goals, define an approach, and deliver results. </li><li> Apply an analytical approach to problem-solving, troubleshooting, and understanding client needs. </li><li> Develop statistical and analytical models to drive business recommendations and insights. </li><li> Drive customer discovery sessions to gain a deep understanding of client requirements and leverage the platform to deliver results. </li><li> Prepare analytical presentations and effectively communicate statistical and technical concepts to non-technical audiences. </li><li> Identify measurement challenges and develop practical recommendations to solve business problems. </li><li> Provide mentorship and guidance to other team members where necessary. <br><br></li></ul><strong>Minimum Qualifications<br></strong><ul><li> Masters or PhD in a quantitative / applied field (Engineering, Computer Science, Data Science, Operations Research, Mathematics, Statistics, Econometrics) and 3+ years of work experience. </li><li> 1 + years’ experience with NLU NLP natural language understanding modeling experience. </li><li> 5 years of analytics experience with designing experiments, developing statistical models, and identifying opportunities for optimization and improvement or customer experience using data and analytics. </li><li> 5+ years of experience in a data science role. </li><li> Critical thinking – capable of generating consistently accurate, useful reports as well and ability to translate data into actionable insight relevant to organization objectives. </li><li> Strong quantitative and research skills with proven ability to demonstrate data interpretation capabilities in terms of reporting and dashboards. </li><li> Attention to detail and time management delivering high quality, client-ready work for multiple projects across several client engagements while meeting deadlines. </li><li> Hands-on fluency in performing data and statistical analysis using SQL, Python, BigQuery, R, Tableau, and/or others. </li><li> Proficient in integrating multiple data sources. </li><li> Practical experience with statistical modeling. </li><li> Proficient SQL skills and experience working with large data sets. </li><li> Knowledgeable with programming and modeling using Python, PySpark, Scala. </li><li> Experience applying current machine learning techniques. </li><li> Experience advising teams on innovative methodology, data science tools, and environments. </li><li> Knowledge of evolving data science concepts and best practices for NLP and unstructured data analysis. <br><br></li></ul><strong>Desired Qualifications<br></strong><ul><li> Proven communication skills with all levels of management, including executive. </li><li> 3+ Experience with ML/NLP/AI. </li><li> Experience communicating complex ideas to both a technical and non-technical audience. </li><li> Proven experience as a Data Scientist. </li><li> Strong math skills (e.g. statistics, algebra). </li><li> Technical writing skills. </li><li> Ability to communicate complex data in a simple, actionable way. </li><li> Ability to visualize data for a given project or study. </li><li> Analytical and problem-solving skills. </li><li> Familiarity with data management tools. </li><li> Experience working with DoD, VA and/or other federal agencies, is a plus. </li><li> Possession of excellent critical thinking, leadership, analysis, and data gathering skills. <br><br></li></ul><strong> Client Information <br><br></strong>The Department of Veteran Affairs (VA) mission is to care for those “who shall have borne the battle” and for their families, caregivers and survivors. Their core values focus their mission by caring and thereby guide actions toward service to others. Within the VA, the Veterans Experience Office (VEO), leverages customer experience data, tools, technology, and engagement to enable the Department of Veterans Affairs (VA) to be the leading Customer Experience (CX) organization in government, so Service members, Veterans, their families, caregivers and survivors choose VA. Within the VEO the Multi-Channel Technology (MCT) Directorate delivers easy and effective Veteran experiences through all communications channels.<br><br><strong>About Aptive<br><br></strong>Aptive is a modern federal consulting firm focused on human experience, digital services, and business transformation. We harness creativity, technology, and culture to connect people and systems to impact the world. We’re advisors, strategists, and engineers focused on people, above all else.<br><br>We believe in generating success collaboratively, leaving client organizations stronger after every engagement and building trust for the next big challenge. Our work inspires people, fuels change and makes an impact. Join our team to be part of positive change in your community and our nation.<br><br><strong> EEO Statement <br><br></strong>Aptive is an equal opportunity employer. We consider all qualified applicants for employment without regard to race, color, national origin, religion, creed, sex, sexual orientation, gender identity, marital status, parental status, veteran status, age, disability, or any other protected class.<br><br>Veterans, members of the Reserve and National Guard, and transitioning active-duty service members are highly encouraged to apply.<br><br><strong> COVID 19 Vaccine Statement <br><br></strong>This position supports a federal government contract and is subject to government vaccination mandates or other customer vaccination requirements. All new hires are required to report their vaccination status and proof of vaccination, or an adjudicated accommodation may be required for employment.\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3555841893"},
{"title": "Data Scientist- Application developer", "location": "\n              North Bethesda, MD\n            ", "company_name": "\n                Axle Informatics\n              ", "position_name": "Data Scientist- Application developer", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Full-time\n        ", "function_name": "\n            Administrative and Management\n          ", "company_sector": "\n          IT Services and IT Consulting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Axle Informatics</strong> is a bioscience and information technology company that offers advancements in translational research, biomedical informatics, and data science applications to research centers and healthcare organizations nationally and abroad. With experts in biomedical science, software engineering, and program management, we focus on developing and applying research tools and techniques to empower decision-making and accelerate research discoveries. We work with some of the top research organizations and facilities in the country including multiple institutes at the National Institutes of Health (NIH).</p><p>Axle is seeking an Application Developer ffor the development and management of a knowledge graph database that supports the Genetic and Rare Diseases (GARD) information center, and to support National Center for Translational Sciences (NCATS) Office of Rare Diseases Research (ORDR)’s rare diseases informatics initiatives. </p><p> </p><p>The National Institutes of Health (NIH) is the Nation’s leading medical research agency and the primary federal agency whose mission is to seek fundamental knowledge about the nature and behavior of living systems and the application of that knowledge to enhance health, lengthen life, and reduce illness and disability by supporting and making medical discoveries. NCATS is the only center at the NIH that focuses exclusively on all aspects of the translation of research with an innovative pipeline of treatment discoveries for all diseases. NCATS brings together a diverse group of scientists, including medicinal chemists, biologists, toxicologists, clinicians, and engineers to translate basic science conducted elsewhere into products and services that help improve people’s health and lives. NCATS’ mission is to improve health through smarter science that results in better treatments faster for all diseases, rare or common. Within that remit, the NCATS ORDR’s mission is to advance rare disease research to benefit patients.</p><p> </p><p>Currently, there are about 7,000-10,000 known rare diseases that affect people in the US, yet only a few hundred (less than 5%) have a treatment and even fewer a cure. A rare disease is defined in US law (Orphan Drug Act (ODA) of 1983,[1] Rare Diseases Act (RDA) of 2002[2]) as a disease or condition that affects fewer than 200,000 people in the US. Most rare diseases affect far fewer patients than this, with most rare diseases affecting only a few hundreds to thousands of patients. Collectively, however, rare diseases are not rare at all, and in total are estimated to affect as many as 25-30 million patients in the US, making rare diseases a large public health consideration. </p><p> </p><p>The ORDR’s GARD information center was established in 2003 under a Congressional Mandate (RDA 2002), and is a federally funded program that has an essential role in the dissemination of public health information to rare disease researchers, clinicians, and patients that is freely accessible to the public. However, obtaining accurate, comprehensive, timely, and objective information on rare diseases is often difficult, given the large number of rare diseases, rapidly evolving science (especially related to genomics), diverse data sources, and inconsistent nomenclature and ontologies for rare disease classification, among other issues. Recently, GARD has been undergoing a re-envisioning and re-design based on a Neo4j knowledge graph database that integrates rare disease data from multiple sources to keep the information on ~6,000 different rare diseases in GARD up-to-date and useful to the patient and clinical research communities. Research tools, artificial intelligent models, data visualization and informatics infrastructure based on the knowledge graph database will be developed to support rare diseases research and clinical activities, and to answer rare disease research questions likely to inform rare disease research prioritization. </p><p> </p><p>[1] Orphan Drug Act of 1983, amended for prevalence 1984. Pub.L. 97-414</p><p>[2] Rare Diseases Act of 2002, Pub.L. 107-280</p><p> </p><p>Responsibilities</p><ul><li>Develop and manage an existing database and informatics infrastructure that integrates rare disease data, such as coding, classification, genetics, description, diagnosis, treatment, etc., from multi-sources. </li><li>Integrate the knowledge graph database with other GARD-related information and data stream, and build robust pipelines to keep the data up to date and harmonized. </li><li>Develop APIs for user access to the knowledge graph database and connect it to other databases. </li><li>Work collaboratively with other data scientists and developers in informatics support for rare disease research. </li><li>Identify, collect, quality check and integrate rare disease data, such as disease characteristics, genetics and healthcare systems data from diverse resources to permit data analysis. Build standard pipelines in the data processing (above) and automate the knowledge graph database update process. </li><li>Develop computational tools, interactive visualization interface and web-based applications for users to access and utilize the data warehouse. </li></ul><p> </p><p>Qualifications</p><p> </p><ul><li>Bachelor’s or Master’s degree in Computer Science, Data Science, Bioinformatics, Information Systems or other related field.</li><li>Bachelor’s degree and 5+ years experience or Master’s degree and 3+ years of experience in database development, software development and/or web application development.</li><li>Deep understanding of object-oriented programming</li><li>Prior health data/biomedical data experience</li><li>Experience with PySpark</li><li>Work experience in Linux/Unix operating systems</li><li>Proficient in one or more programing languages, such as Python, Perl, Java, JavaScript.</li><li>Experience in database and web application development</li><li>Experience in API development is preferred</li><li>Experience in Graph, NoSQL, and/or RDBMS database, such as Neo4j, is highly preferred</li><li>Experience in containers (e.g. Docker, Singularity), version control (e.g. GitHub) and workflow management (e.g. Snakemake) is highly preferred</li><li>Ability to work independently on day-to-day tasks with minimal supervision</li><li>Willing to learn new technologies and motivated to explore new solutions to address complex rare disease research questions.</li></ul><p> </p><p><strong>Benefits</strong></p><p><br></p><ul><li>100% Medical Dental &amp; Vision Coverage for Employees</li><li>Educational Benefits for Career Growth</li><li>Paid Time Off (Including Holidays)</li><li>Employee Referral Bonus</li><li>Profit Sharing</li><li>401K Matching</li><li>Flexible Spending Accounts:</li><li>Healthcare (FSA)</li><li>Parking Reimbursement Account (PRK)</li><li>Dependent Care Assistant Program (DCAP)</li><li>Transportation Reimbursement Account (TRN)</li></ul><p><br></p><p>The diversity of Axle’s employees is a tremendous asset. We are firmly committed to providing equal opportunity in all aspects of employment and will not tolerate any illegal discrimination or harassment based on age, race, gender, religion, national origin, disability, marital status, covered veteran status, sexual orientation, status with respect to public assistance, and other characteristics protected under state, federal, or local law and to deter those who aid, abet, or induce discrimination or coerce others to discriminate</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3552844289"},
{"title": "Adtech Data Scientist - 100% Remote in US", "location": "\n              Boston, MA\n            ", "company_name": "\n                Motion Recruitment\n              ", "position_name": "Adtech Data Scientist - 100% Remote in US", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Full-time\n        ", "function_name": "\n            Engineering and Information Technology\n          ", "company_sector": "\n          Staffing and Recruiting\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        My client is at the intersection of advertising and marketing. They are using AI and Machine Learning to help advertisers understand customers feelings toward certain brands and products so they can provide them relevant ads that make sense for their target market.<br><br><strong>Posted By:</strong> Tommy Lieberman\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3554690649"},
{"title": "Research Scientist - Software Engineering - Remote | WFH", "location": "\n              Basking Ridge, NJ\n            ", "company_name": "\n                Get It Recruit - Information Technology\n              ", "position_name": "Research Scientist - Software Engineering - Remote | WFH", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Full-time\n        ", "function_name": "\n            Other\n          ", "company_sector": "\n          Human Resources Services\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        Get It Recruit - Information Technology helps job seekers connect with employers and opportunities that match their qualifications. Once connected job seekers can complete the full application process directly on the employer's website.<br><br>We are seeking a talented and motivated software engineer to join our team in researching, building, and improving systems that support distributed operations. You'll be a key player in creating solutions that are efficient, effective, and cutting-edge.<br><br>As an ideal candidate, you have a proven track record of working well in teams, proactively identifying challenges, and independently finding solutions. Your excellent communication skills allow you to collaborate effectively on complex systems development projects. You will have the opportunity to work on projects that utilize technologies such as microservices, container orchestration, machine learning, natural language processing, cybersecurity, virtualization, networking, and operating system internals. Bonus points if you have experience with TensorFlow, PyTorch, and source control tools like \"git\".<br><br>In this role, you'll be responsible for a mix of research and development projects, ranging from applied research to advanced prototyping and demonstrations. We're looking for someone who enjoys learning new skills and can work independently.<br><br>To be considered for this role, you must have a degree in Computer Science, ECE, or a related field, with 5-7 years of experience for a BS degree, 3-5 years of experience for an MS degree, and 0-2 years of experience for a PhD degree. Additionally, you should have strong system skills (Linux, Windows, shell scripting, VM technologies), the ability to design and implement complex systems, and strong software development skills (C/C++, Java, scripting languages like Python or Perl). Familiarity with networking protocols and working in a DevSecOps environment is also preferred.<br><br>Please note that US citizenship is required for this position.<br><ul><li>Please note that Get It Recruit - Information Technology is sharing this job opening on behalf of the employer. Any questions related to the job description or application process should be directed to the employer. To learn more about the position and begin the application process, please use our 'apply' button.</li></ul>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3547894946"},
{"title": "Data Scientist/Senior Data Scientist", "location": "\n              United States\n            ", "company_name": "\n                Benco Dental\n              ", "position_name": "Data Scientist/Senior Data Scientist", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Full-time\n        ", "function_name": "\n            Strategy/Planning and Information Technology\n          ", "company_sector": "\n          Medical Device\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        Nationwide/Remote<br><br>Data Scientist Position at Benco Dental<br><br>At Benco Dental, our company is our family, and we are looking for a new addition to assist us in Driving Dentistry Forward. Please review the description below carefully to ensure that this position is the perfect match for you!<br><br><strong>What’s in it for YOU?<br></strong><ul><li>Excellent Compensation Packages</li><li>Medical, Dental and Vision Benefits Effective on Day 1</li><li>401k Package, Paid Time Off Program, and Profit Sharing</li><li>Flexible/At Home Working Options</li><li>Associate Discounts and Community Giveback Programs</li><li>College Tuition Savings Program</li><li>Caring Family Culture Toward all Associates</li><li>Certified as a FORTUNE Great Place to Work</li><li>Opportunities to join resource groups that promote Diversity, Equity, and Inclusion</li><li>Family owned for 90+ years<br></li></ul><strong><u>Position Summary<br><br></u></strong>We are looking for a Data Scientist/Senior Data Scientist that will help us identify actionable insights hidden amongst vast amounts of data. Your primary focus will be to perform statistical analysis in key business areas, build Machine Learning models, perform data mining, and build high quality Algorithms. Data Scientist is a self-directed role, identifying needs across the organization and working with the leadership team to prioritize work based on impact.<br><br><strong>Do YOU Possess These Skills and Attributes?<br></strong><ul><li>In depth knowledge of ML frameworks and libraries such as Tensorflow, Keras, PyTorch, MXNet, Sci-Kit learn etc. </li><li>Experience building production grade custom ML models </li><li>Proficiency in Python and SQL </li><li>Experience with data warehousing, relational databases, NoSQL databases and Data Lakes </li><li>Experience with project documentation and Agile methodologies </li><li>Strong interpersonal and communication skills required </li><li>Strong oral and visual presentation skills <br></li></ul><strong>Do These Responsibilities Interest YOU?<br></strong><ul><li>Defining the problem statement, conducting literature review, building mechanism for data acquisition, data analysis, baseline modeling, building custom ML models, reviewing accuracy metrics, model deployment, identifying mechanisms to monitor model performance in production and defining model promotion/relegation methods. </li><li>For each use case you will be required to extract, synthesize, and analyze data from a wide variety of data sources, conducting exploratory analysis, feature engineering, write functions for data pre-processing, experiment with various deep learning methods, and determine the most appropriate method for developing a custom algorithm. </li><li>Construct thorough data testing scenarios around queries, data models, reports, and dashboards </li><li>Conduct and present detailed analysis, experiments, and suggestions to senior team leaders </li><li>Identify opportunities for advanced analytical techniques and big data technologies </li><li>Adhere to industry &amp; discipline best practices in analytical user experience, data modelling, &amp; query development <br></li></ul><strong>Do YOU Meet These Requirements?<br></strong><ul><li>Education: Bachelor’s Degree in Computer Science, Engineering, Applied Math, Statistics or any quantitative field required. </li><li>Experience: 4+ years of expertise in implementing machine learning and artificial intelligence techniques. <br></li></ul><strong>Who We Are: It’s our Mission to Drive Dentistry Forward<br><br></strong>Benco Dental, the largest privately owned, full-service dental distributor in the United States, has remained in the family since 1930—a family that now includes our more than 30,000 customers and over 1,400 associates in the 48 contiguous states.<br><br>We provide more supply and equipment options than any other full-service distributor, an offering enhanced by a comprehensive suite of services, including office design, equipment repair, practice coaching, financing and project management, wealth management and dental-specific technology solutions. These services are supported by over 400 professionally trained sales representatives and 300 factory-trained service technicians who begin every task by asking “What does the customer want?”<br><br>If you enjoy working for a progressive company, who is committed to diversity in our workforce, who values all customers and associates, who also provides the opportunity for growth and development- we encourage you to learn more about our Benco family. We are looking for driven professionals who want to play a key role in our future success, while making a positive impact within our industry. Thank you for your interest in Benco Dental. We look forward to hearing from you!\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3552856523"},
{"title": "Data Scientist", "location": "\n              Houston, TX\n            ", "company_name": "\n                OmniForce Solutions\n              ", "position_name": "Data Scientist", "experience_required": "\n            Mid-Senior level\n          ", "contract_type": "\n          Full-time\n        ", "function_name": "\n            Information Technology and Analyst\n          ", "company_sector": "\n          Oil and Gas and Utilities\n          ", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>With a diverse set of products and services, including clean energy initiatives, our Fortune 200 client is one of the nation's leaders in the retail energy sector. Take your career to the next level by working on a dynamic and innovative team at a forward-thinking and growing company!</p><p><br></p><p><br></p><p><strong>Summary for the Data Scientist</strong>:</p><p><br></p><p>Our client applies advanced analytics and modeling to address challenging business problems. They aim to promote customized offerings: the right product offered through the right channel, with the right message at the right time for each current or prospective customer. To accomplish this, they leverage our data via predictive modeling, statistical analyses, and optimization. If you love data, programming, creative problem-solving, and communicating results, you will fit right in.</p><p><br></p><p><strong>Duties/Responsibilities:</strong></p><p>- Process data using Python, PySpark, and Databricks</p><p>- Develop purchase propensity models and product recommendation models</p><p>- Learn the job while performing hands-on analytics and modeling</p><p>- Help business partners make more profitable decisions based on customer and prospect insights</p><p><br></p><p><strong>Minimum Requirements:</strong></p><p>- 2 to 3 years of experience in data analysis or related field</p><p>- Master's degree in a quantitative discipline or equivalent practical experience</p><p>- Experience with statistical software and database languages</p><p><br></p><p><strong>Preferred Qualifications:</strong></p><p>- Experience using data science to improve customer experience and business profitability</p><p>- Ph.D. in a quantitative discipline</p><p>- Proficiency in Python packages such as PySpark, NumPy, pandas, sci-kit-learn, XGBoost, Matplotlib, and lifelines</p><p>- Theoretical and practical knowledge of methods such as frequentist statistics, Bayesian statistics, forecasting, optimization, causal inference, machine learning, and natural language processing</p><p>- Proficiency with version control</p><p>- Experience with reading and writing data in S3</p><p>- Ability to collaborate effectively with teammates across functions with strong skills in persuasive and informative speaking</p>\n      </div>"], "link": "https://www.linkedin.com/jobs/view/3555871484"}
]