[
{"title": ["Senior Data Scientist"], "location": ["\n              United States\n            "], "company_name": ["\n                Tala\n              "], "position_name": ["Senior Data Scientist"], "experience_required": ["\n            Mid-Senior level\n          "], "contract_type": ["\n          Full-time\n        "], "function_name": ["\n            Engineering and Information Technology\n          "], "company_sector": ["\n          Financial Services\n          "], "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <strong><u>About Tala</u></strong><p><br></p>Tala is a global technology company building the world’s most accessible financial services. With more than $350 million raised from visionary investors, we are serving millions of customers around the world who have been overlooked by traditional financial institutions – and our plan is to serve millions more, and have been named by the <em>Fortune </em>Impact 20 list, <em>CNBC</em>’s Disruptor 50, and <em>Forbes’ </em>Fintech 50 list for four years running. We are expanding across product offerings, countries and crypto and are looking for people who have an entrepreneurial spirit and are passionate about the mission.<p><br></p>By creating a unique platform that enables lending and other financial services around the globe, people in emerging markets are able to start and expand small businesses, manage day-to-day needs, and pursue their financial goals with confidence. Currently, more than 7 million people across Kenya, the Philippines, Mexico, and India have used Tala products. Due to our global team, we have a remote-first approach, and also have offices in Santa Monica, CA (HQ); Nairobi, Kenya; Mexico City, Mexico; Manila, the Philippines; and Bangalore, India.<p><br></p>Most Talazens join us because they connect with our mission of enabling financial agency for underbanked people around the world. If you are energized by the impact you can make at Tala, we’d love to hear from you!<p><br></p>We are looking for a Senior Data Scientist interested in solving one of the world's biggest problems: financial inclusion. As a Data Scientist you will lead data science initiatives that drive improvements in customer experience, operational efficiency and recovery. You will own the modeling cycle through scoping, development, deployment and after-sale and monitoring, with keen focus on business outcomes and stakeholder management.<p><br></p><strong><u>What You'll Do</u></strong><p><br></p><ul><li>Embed with business stakeholders to identify, test and implement data science solutions that drive business and customer success. Develop a roadmap in collaboration with stakeholders to organize and prioritize initiatives.</li><li>Own full-cycle of machine learning products from ideation and training through deployment into our production environment – including real-time inference – and after sales service. Obsess over machine learning products, iterating rapidly if necessary.</li><li>Become a multiplier for data science team by sharing work, providing mentorship to junior team members, providing technical feedback and developing work into shared team tooling.</li><li>Be a thought partner for the business, leverage data insights and strong communication skills to influence company strategy.</li></ul><p><br></p><strong><u>Qualifications</u></strong><p><br></p><ul><li>4+ years of experience in a data science role or equivalent position.</li><li>2+ years in a senior / lead position leading the execution of end to end machine learning solutions for business stakeholders.</li><li>Fluency with Python and packages related to machine learning.</li><li>Comfort with SQL.</li><li>Experience with the full modeling cycle, from scoping and development through deployment, after-sale and monitoring. Demonstrated business value in previous roles. </li><li>Competency with statistics. Knowledge of experimental design and analysis basics.</li><li>Strong collaboration and communication skills. Ability to tell stories through data and effective visualization. </li><li>Ability to thrive in at times ambiguous and complex environments.</li><li>Desire to champion simple, correct, and hardy systems.</li></ul><p><br></p><strong><u>Preferred Skills &amp; Experience</u></strong><p><br></p><ul><li>Experience with causal modeling techniques such as uplift modeling</li><li>Experience deploying real-time model inference/scoring systems</li></ul><p><br></p><strong>We strive to provide Talazens and their loved ones with a holistic benefit experience! We champion your financial, physical, and mental health by offering valuable benefits and resources to help you care for the whole of you.</strong><p><br></p><ul><li>Competitive compensation programs with stock/equity program</li><li>Flexible work environments and Hybrid/Remote-first work model</li><li>Medical (HMP, PPO, HSA), Dental PPO, Vision, FSA, DC FSA</li><li>Employer paid Life w AD&amp;D, Short Term and Long Term Disability 401k and Roth 401k </li><li>Voluntary benefits like critical illness, accident, life, and pet insurance</li><li>Employee Assistance ProgramPaid Holidays, Unlimited PTO, Wellness/rest “sloth days”, Paid Parental leave, Birthday Holiday, Life Event Days off, paid sabbatical after 5 years of service, and more</li><li>Health and Wellness events and seminars</li><li>The above-noted benefits list is not an exhaustive list and is subject to change. To learn more about our benefits please visit https://tala.benefitseasy.com/ and reach out to your recruiter with any questions. </li></ul><p><br></p>Salary Range: $165,000 - $215,000<p><br></p>Our vision is to build a new financial ecosystem where everyone can participate on equal footing and access the tools they need to be financially healthy. We strongly believe that inclusion fosters innovation and we’re proud to have a diverse global team that represents a multitude of backgrounds, cultures, and experience. We hire talented people regardless of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, or disability status.\n      </div>"]},
{"title": ["Software Engineer, Developer Productivity"], "location": ["\n              San Francisco Bay Area\n            "], "company_name": ["\n                Stem, Inc.\n              "], "position_name": ["Software Engineer, Developer Productivity"], "experience_required": ["\n            Mid-Senior level\n          "], "contract_type": ["\n          Full-time\n        "], "function_name": ["\n            Engineering\n          "], "company_sector": ["\n          Renewable Energy Semiconductor Manufacturing\n          "], "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>Position: Software Engineer – Developer Productivity</p><p>Reports to: Engineering Manager – Developer Productivity &amp; Infrastructure</p><p>Location: Remote in US or Canada</p><p><br></p><p><br></p><p><strong>About Stem</strong></p><p><em>Are you seeking a role with a Climate Tech industry leader that you can be excited and proud of as part of the clean energy transition??</em></p><p><br></p><p>Stem provides solutions that address the challenges of today’s dynamic energy market. By combining advanced energy storage solutions with Athena™, a world-class artificial intelligence (AI)-powered analytics platform, Stem enables customers and partners to optimize energy use by automatically switching between battery power, onsite generation and grid power. Stem’s solutions help enterprise customers benefit from a clean, adaptive energy infrastructure and achieve a wide variety of goals, including expense reduction, resilience, sustainability, environmental and corporate responsibility and innovation. Stem also offers full support for solar partners interested in adding storage to standalone, community or commercial solar projects – both behind and in front of the meter.</p><p><br></p><p><br></p><p>Stem’s culture embodies diversity &amp; inclusion beyond the traditional facets of gender, ethnicity, age, disabilities, and sexual orientation to include experience, personality, communication, workstyles, and more. At our core, Stem is at the momentous intersection of clean energy and software technology where diverse ideas, experiences, and professional skills converge to make the inclusive culture we have today. Together, we are turning old school thoughts about software and energy into progressive, collaborative, and innovative solutions. By joining our team, you will be collaborating with data scientists, energy experts, skilled salespeople, thought-leading executives and more from a range of backgrounds. This intersection of ideas, beliefs, and skills is what makes us unique enough to lead the world’s largest network of digitally connected energy storage systems.</p><p><br></p><p><br></p><p><strong>What we are looking for:</strong></p><p>You are a Software Engineer and passionate about creating the best possible developer experience to bake, test and deploy software. You understand the importance of having high velocity CI-CD pipelines that enables consistent, and reliable software deployments, and you enjoy developing the software and tools for improving Developer experience &amp; productivity.</p><p><em> </em></p><p><br></p><p><strong>Responsibilities:</strong></p><ul><li>Solve Stem’s unique build, test &amp; deployment challenges</li><li>Bring the best developer experience to our Software Developers and Automation Engineers</li><li>Lead various efforts to enhance our existing offerings and identify, design, and implement new ones with laser sharp focus on engineering teams as our customers.</li><li>Design, deploy and maintain our CI/CD pipeline, taking advantage of best of breed tools/systems like Docker, Jenkins, ArgoCD and Kubernetes, all running in our Amazon Web Services environment</li><li>Build tools used across the engineering organization to increase velocity, reliability &amp; confidence of pushing features into the wild</li><li>Own and enhance home-grown microservices and systems used as part of the CI/CD pipeline</li><li>Foster a DevOps culture in Stem and collaborate with software developers, system operators and test engineers in the organization.</li></ul><p><br></p><p><strong>Required Experience:</strong> </p><ul><li>Advanced degree (BSc or Masters) in Computer Science or related field</li><li>8+ years of working experience</li><li>Demonstrated experience in developing CI-CD, release build systems or related tooling and services</li><li>Highly proficient in Python, Groovy or another language</li><li>Ability to lead, design and implement complex solutions with many moving parts</li><li>Experience building RESTful applications</li><li>Working experience with Kubernetes, Docker and related tooling</li><li>Good knowledge of one or more CI systems like Jenkins, CircleCI, BuildKite, CodeFresh etc.</li><li>Experience with code and artifact repositories (GIT, Nexus, Artifactory, …)</li><li>Experience working with cloud infrastructure at AWS, Azure or Google Cloud</li><li>Familiar with various deployment strategies (A/B Testing, Blue/Green and Canary Deployments)</li><li>Experience with micro services or service-oriented architecture</li><li>Excellent written, verbal, and collaboration skills</li></ul><p> </p><p><br></p><p>Job Location</p><p>Bay Area, Boulder, Seattle and Austin, United States and Toronto, Canada</p><p><br></p><p><em>All new employees hired in the United States are required to be fully vaccinated against COVID-19, subject to such exceptions as required by law. If hired, you will be required to submit proof of full vaccination or have an approved accommodation along with your executed offer of employment.</em></p><p><em> </em></p><ul><li>Stem, Inc. is an equal opportunity employer committed to diversity in the workplace and does not discriminate against any employee or applicant for employment because of race, color, sex, pregnancy, religion, national origin, ethnicity, citizenship, sexual orientation, gender identity, age, marital status, disability, genetic information, military status, protected veteran status or any other factor protected by applicable federal, state or local laws.</li></ul>\n      </div>"]},
{"title": ["Lead Data Scientist (P1922)"], "location": ["\n              Chicago, IL\n            "], "company_name": ["\n                84.51˚\n              "], "position_name": ["Lead Data Scientist (P1922)"], "experience_required": ["\n            Mid-Senior level\n          "], "contract_type": ["\n          Full-time\n        "], "function_name": ["\n            Engineering and Information Technology\n          "], "company_sector": ["\n          Business Consulting and Services\n          "], "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <strong><u>84.51° Overview<br><br></u></strong>84.51° is a retail data science, insights and media company. We help the Kroger company, consumer packaged goods companies, agencies, publishers and affiliated partners create more personalized and valuable experiences for shoppers across the path to purchase.<br><br>Powered by cutting edge science, we leverage 1st party retail data from nearly 1 of 2 US households and 2BN+ transactions to fuel a more customer-centric journey utilizing 84.51° Insights, 84.51° Loyalty Marketing and our retail media advertising solution, Kroger Precision Marketing.<br><br>Join us at 84.51°!<br><br>__________________________________________________________<br><br><strong>Lead Data Scientist, Digital Relevancy Science Team – Personalization &amp; Loyalty Strategy<br><br></strong>Relevancy Team is responsible for making relevant and personalized customer experiences for Kroger's E-commerce site, which ranks among the top 10 e-commerce companies in the US. We deliver trillions of recommendations to the Kroger website at scale and make them available to millions of Kroger customers. Scale is the name of the game. The team has a rich portfolio of sciences which include product and coupon recommender systems, substitute recommendations, and shoppable recipes. We apply a multitude of advanced techniques such as deep learning, Matrix factorization, ML, and NLP to create our sciences.<br><br><strong><u>Responsibilities<br><br></u></strong><strong>Technical Leadership<br></strong><ul><li>Build innovative models and solutions using new deep learning architectures for sparse, graph and tabular data problems across domains, while demonstrating that the DL algos perform better than traditional, non-DL based methods.</li><li>Accelerate deep learning adoption across the enterprise by developing packages, tools and APIs with support from other science and engineering leads.</li><li>Lead discussions to frame problem statement, develop hypotheses, and identify appropriate modelling approaches for very large, personalized recommendation systems in production.</li><li>Become the expert in methodology and execution of scalable, automated, and cutting-edge sciences to achieve business and customer outcomes.</li><li>Gain a deep expertise on data sources, required transformations, and quality consistency.<br></li></ul><strong>Identify Opportunities<br></strong><ul><li>Identify opportunities for data science innovation and research within the function using new technology, methodologies, and approaches.</li><li>Develop proof of concepts and rapidly prototype new innovations and showcase to different stakeholders and partners for quick wins with enough technical and business clarity.</li><li>Provide guidance and structure to different stages of data science life cycle, including but not limited to investments in embeddings sciences, MLOps.</li><li>Work closely with data and ML engineers to build and deploy models at scale, provide support in production deployment, maintenance, and monitoring.<br></li></ul><strong>Mentoring<br></strong><ul><li>Mentoring of junior data scientists, especially on code and methodologies, and developing and sustaining technical pipelines for all parts of data science life cycle.</li><li>Work closely with data scientists to challenge the status quo; adopt, adhere, and amend how to data science processes.<br></li></ul><strong><u>Qualifications, Skills And Experience<br></u></strong><ul><li>4+ years of experience working with recommender systems and information retrieval systems at scale</li><li>4+ years developing analytical solutions using advanced statistical methods, machine learning algorithms and deep learning frameworks</li><li>4+ years using Python to develop analytical solutions</li><li>4+ years with data wrangling, data cleaning and prep, dimensionality reduction</li><li>4+ years with Big Data concepts, tools, cloud solutions and architecture (Azure, Hadoop, Python, Spark)</li><li>4+ years using one of the Deep Learning frameworks such as TensorFlow, Torch, MXNet etc.</li><li>4+ years working with NLP/ML libraries (spacy, scikit-learn, SparkNLP).</li><li>Experience with large scale language models (LLM), Transformers is preferred</li><li>Experience with MLOps best practices is preferred</li><li>Experience with training, developing, recruiting, coaching, and/or inspiring highly technical associates</li><li>Ability to create computationally efficient solutions</li><li>Experience building Python packages and exposing APIs for science assets</li><li>Strong academic background in mathematics, statistics, computer science, economics, or similar discipline</li><li>Data visualization skills and ability to present technical solutions to non-technical audience</li><li>Strong interpersonal and communication skills</li><li>Strong analytical, creative problem-solving and decision-making skills</li><li>Strong business acumen; grocery and/or retail experience is a plus</li><li>Passionate about data, analysis, and insights</li><li>Natural curiosity, Welcomes and embraces change</li><li>Ability to work fast yet accurately</li><li>An openness and willingness to try new things and to fail</li><li>Ability to work in a highly collaborative environment<br></li></ul>\n      </div>"]},
{"title": ["Senior Data Scientist - KPM (P3723)"], "location": ["\n              Portland, OR\n            "], "company_name": ["\n                84.51˚\n              "], "position_name": ["Senior Data Scientist - KPM (P3723)"], "experience_required": ["\n            Mid-Senior level\n          "], "contract_type": ["\n          Full-time\n        "], "function_name": ["\n            Engineering and Information Technology\n          "], "company_sector": ["\n          Business Consulting and Services\n          "], "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <strong><u>84.51° Overview<br><br></u></strong>84.51° is a retail data science, insights and media company. We help the Kroger company, consumer packaged goods companies, agencies, publishers and affiliated partners create more personalized and valuable experiences for shoppers across the path to purchase.<br><br>Powered by cutting edge science, we leverage 1st party retail data from nearly 1 of 2 US households and 2BN+ transactions to fuel a more customer-centric journey utilizing 84.51° Insights, 84.51° Loyalty Marketing and our retail media advertising solution, Kroger Precision Marketing.<br><br>Join us at 84.51°!<br><br>__________________________________________________________<br><br><strong>Senior Data Scientist – Kroger Precision Marketing <br><br></strong>Kroger Precision Marketing (KPM) powered by 84.51°, is a leading retail media advertising solution. KPM closes the loop between media exposure and store sales by using first-party purchase data to make brand advertising more addressable, actionable, and accountable. Launched almost five years ago, we have activated campaigns for over 1900 brands. Our vision is to become the preferred media company for advertisers by creating a more accountable media supply chain that increases the effectiveness of investment dollars. We are a growing team of passionate and talented analysts, data scientists, marketing consultants, and media strategists who are committed to transforming the media industry.<br><br>As <strong>Senior Data Scientist – Kroger Precision Marketing </strong>you are joining a community of analysts – we are researchers in search of the customer story.  We are the voice of the customer.  Customers share their story with us each day, and it is our job to tell their story.  Our Analysis team is known for solving client and customer problems, employing the most appropriate statistical and analytic approaches. You will be hands-on with respect to the analysis of a retailer database, using the full suite of 84.51° technical and visual tools – R, Python, Tableau, Excel, SQL, Power BI (and other internal tools) to create timely, relevant, and actionable insights. <br><br><strong><u>Responsibilities<br></u></strong><ul><li>Work on innovative data science projects, ideation, and methodology work to enhance our media planning, optimization, and measurement science offerings</li><li>Collaborate with other research teams at 84.51° to vet application of advanced science techniques within the media business </li><li>Utilize your media data science experience to influence and drive advanced machine learning solutions into our platform and products. Think creatively when building science solutions so as to bring the most value to the user</li><li>Be a data science / analytics ambassador to our sales and product teams. Explain the how and why around our data science solutions through formal and informal training sessions and creation of documentation</li><li>Mentor and develop junior data scientists on media insights interpretation, results delivery, and data science methodologies</li><li>As a data science champion, be a voice that helps improve and maintain and our position as industry leaders in media science capabilities<br></li></ul><strong><u>Qualifications, Skills And Experience<br></u></strong><ul><li>MS or PhD in Statistics, Mathematics, Data Science, Machine Learning, Computer Science or related field</li><li>1+ years of experience in analytics across ad technology, digital media and advertising. Experience in building media auction systems (RTB) preferred.</li><li>2+ years hands-on experience building and working with machine learning solutions. Ideally partnering across software engineering and product management teams to develop and scale new algorithms, features, and enhancements</li><li>Strong Python skills plus 2+ years of experience extracting and manipulating data from large, disparate data sources using big data and cloud technologies (Azure, Hadoop, Spark, Databricks and/or similar technologies)</li><li>Strong interpersonal and communication skills including excellent verbal, written, presentation and consultation skills are required</li><li>Strong business acumen, analytical problem-solving and decision-making skills</li><li>Excellent attention to detail, organization skills and ability to work in a highly collaborative environment<br></li></ul><strong><u>About 84.51°<br><br></u></strong>84.51° knows customers, and we know how to connect you.<br><br>Using a sophisticated, proprietary suite of tools and technology, we turn customer data into actionable knowledge. With unparalleled customer data and predictive analytics capabilities, we deliver personalized marketing strategies and ensure the best experience for customers of Kroger and more than 300 consumer-packaged-goods companies. We put the customer at the center of everything we do, resulting in a more dynamic, informed and personal approach to driving customer loyalty.<br><br>\n      </div>"]},
{"title": ["Senior Data Scientist - KPM (P3723)"], "location": ["\n              United States\n            "], "company_name": ["\n                84.51˚\n              "], "position_name": ["Senior Data Scientist - KPM (P3723)"], "experience_required": ["\n            Mid-Senior level\n          "], "contract_type": ["\n          Full-time\n        "], "function_name": ["\n            Engineering and Information Technology\n          "], "company_sector": ["\n          Business Consulting and Services\n          "], "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <strong><u>84.51° Overview<br><br></u></strong>84.51° is a retail data science, insights and media company. We help the Kroger company, consumer packaged goods companies, agencies, publishers and affiliated partners create more personalized and valuable experiences for shoppers across the path to purchase.<br><br>Powered by cutting edge science, we leverage 1st party retail data from nearly 1 of 2 US households and 2BN+ transactions to fuel a more customer-centric journey utilizing 84.51° Insights, 84.51° Loyalty Marketing and our retail media advertising solution, Kroger Precision Marketing.<br><br>Join us at 84.51°!<br><br>__________________________________________________________<br><br><strong>Senior Data Scientist – Kroger Precision Marketing <br><br></strong>Kroger Precision Marketing (KPM) powered by 84.51°, is a leading retail media advertising solution. KPM closes the loop between media exposure and store sales by using first-party purchase data to make brand advertising more addressable, actionable, and accountable. Launched almost five years ago, we have activated campaigns for over 1900 brands. Our vision is to become the preferred media company for advertisers by creating a more accountable media supply chain that increases the effectiveness of investment dollars. We are a growing team of passionate and talented analysts, data scientists, marketing consultants, and media strategists who are committed to transforming the media industry.<br><br>As <strong>Senior Data Scientist – Kroger Precision Marketing </strong>you are joining a community of analysts – we are researchers in search of the customer story.  We are the voice of the customer.  Customers share their story with us each day, and it is our job to tell their story.  Our Analysis team is known for solving client and customer problems, employing the most appropriate statistical and analytic approaches. You will be hands-on with respect to the analysis of a retailer database, using the full suite of 84.51° technical and visual tools – R, Python, Tableau, Excel, SQL, Power BI (and other internal tools) to create timely, relevant, and actionable insights. <br><br><strong><u>Responsibilities<br></u></strong><ul><li>Work on innovative data science projects, ideation, and methodology work to enhance our media planning, optimization, and measurement science offerings</li><li>Collaborate with other research teams at 84.51° to vet application of advanced science techniques within the media business </li><li>Utilize your media data science experience to influence and drive advanced machine learning solutions into our platform and products. Think creatively when building science solutions so as to bring the most value to the user</li><li>Be a data science / analytics ambassador to our sales and product teams. Explain the how and why around our data science solutions through formal and informal training sessions and creation of documentation</li><li>Mentor and develop junior data scientists on media insights interpretation, results delivery, and data science methodologies</li><li>As a data science champion, be a voice that helps improve and maintain and our position as industry leaders in media science capabilities<br></li></ul><strong><u>Qualifications, Skills And Experience<br></u></strong><ul><li>MS or PhD in Statistics, Mathematics, Data Science, Machine Learning, Computer Science or related field</li><li>1+ years of experience in analytics across ad technology, digital media and advertising. Experience in building media auction systems (RTB) preferred.</li><li>2+ years hands-on experience building and working with machine learning solutions. Ideally partnering across software engineering and product management teams to develop and scale new algorithms, features, and enhancements</li><li>Strong Python skills plus 2+ years of experience extracting and manipulating data from large, disparate data sources using big data and cloud technologies (Azure, Hadoop, Spark, Databricks and/or similar technologies)</li><li>Strong interpersonal and communication skills including excellent verbal, written, presentation and consultation skills are required</li><li>Strong business acumen, analytical problem-solving and decision-making skills</li><li>Excellent attention to detail, organization skills and ability to work in a highly collaborative environment<br></li></ul><strong><u>About 84.51°<br><br></u></strong>84.51° knows customers, and we know how to connect you.<br><br>Using a sophisticated, proprietary suite of tools and technology, we turn customer data into actionable knowledge. With unparalleled customer data and predictive analytics capabilities, we deliver personalized marketing strategies and ensure the best experience for customers of Kroger and more than 300 consumer-packaged-goods companies. We put the customer at the center of everything we do, resulting in a more dynamic, informed and personal approach to driving customer loyalty.<br><br>\n      </div>"]},
{"title": ["Lead Data Scientist (P1922)"], "location": ["\n              Portland, OR\n            "], "company_name": ["\n                84.51˚\n              "], "position_name": ["Lead Data Scientist (P1922)"], "experience_required": ["\n            Mid-Senior level\n          "], "contract_type": ["\n          Full-time\n        "], "function_name": ["\n            Engineering and Information Technology\n          "], "company_sector": ["\n          Business Consulting and Services\n          "], "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <strong><u>84.51° Overview<br><br></u></strong>84.51° is a retail data science, insights and media company. We help the Kroger company, consumer packaged goods companies, agencies, publishers and affiliated partners create more personalized and valuable experiences for shoppers across the path to purchase.<br><br>Powered by cutting edge science, we leverage 1st party retail data from nearly 1 of 2 US households and 2BN+ transactions to fuel a more customer-centric journey utilizing 84.51° Insights, 84.51° Loyalty Marketing and our retail media advertising solution, Kroger Precision Marketing.<br><br>Join us at 84.51°!<br><br>__________________________________________________________<br><br><strong>Lead Data Scientist, Digital Relevancy Science Team – Personalization &amp; Loyalty Strategy<br><br></strong>Relevancy Team is responsible for making relevant and personalized customer experiences for Kroger's E-commerce site, which ranks among the top 10 e-commerce companies in the US. We deliver trillions of recommendations to the Kroger website at scale and make them available to millions of Kroger customers. Scale is the name of the game. The team has a rich portfolio of sciences which include product and coupon recommender systems, substitute recommendations, and shoppable recipes. We apply a multitude of advanced techniques such as deep learning, Matrix factorization, ML, and NLP to create our sciences.<br><br><strong><u>Responsibilities<br><br></u></strong><strong>Technical Leadership<br></strong><ul><li>Build innovative models and solutions using new deep learning architectures for sparse, graph and tabular data problems across domains, while demonstrating that the DL algos perform better than traditional, non-DL based methods.</li><li>Accelerate deep learning adoption across the enterprise by developing packages, tools and APIs with support from other science and engineering leads.</li><li>Lead discussions to frame problem statement, develop hypotheses, and identify appropriate modelling approaches for very large, personalized recommendation systems in production.</li><li>Become the expert in methodology and execution of scalable, automated, and cutting-edge sciences to achieve business and customer outcomes.</li><li>Gain a deep expertise on data sources, required transformations, and quality consistency.<br></li></ul><strong>Identify Opportunities<br></strong><ul><li>Identify opportunities for data science innovation and research within the function using new technology, methodologies, and approaches.</li><li>Develop proof of concepts and rapidly prototype new innovations and showcase to different stakeholders and partners for quick wins with enough technical and business clarity.</li><li>Provide guidance and structure to different stages of data science life cycle, including but not limited to investments in embeddings sciences, MLOps.</li><li>Work closely with data and ML engineers to build and deploy models at scale, provide support in production deployment, maintenance, and monitoring.<br></li></ul><strong>Mentoring<br></strong><ul><li>Mentoring of junior data scientists, especially on code and methodologies, and developing and sustaining technical pipelines for all parts of data science life cycle.</li><li>Work closely with data scientists to challenge the status quo; adopt, adhere, and amend how to data science processes.<br></li></ul><strong><u>Qualifications, Skills And Experience<br></u></strong><ul><li>4+ years of experience working with recommender systems and information retrieval systems at scale</li><li>4+ years developing analytical solutions using advanced statistical methods, machine learning algorithms and deep learning frameworks</li><li>4+ years using Python to develop analytical solutions</li><li>4+ years with data wrangling, data cleaning and prep, dimensionality reduction</li><li>4+ years with Big Data concepts, tools, cloud solutions and architecture (Azure, Hadoop, Python, Spark)</li><li>4+ years using one of the Deep Learning frameworks such as TensorFlow, Torch, MXNet etc.</li><li>4+ years working with NLP/ML libraries (spacy, scikit-learn, SparkNLP).</li><li>Experience with large scale language models (LLM), Transformers is preferred</li><li>Experience with MLOps best practices is preferred</li><li>Experience with training, developing, recruiting, coaching, and/or inspiring highly technical associates</li><li>Ability to create computationally efficient solutions</li><li>Experience building Python packages and exposing APIs for science assets</li><li>Strong academic background in mathematics, statistics, computer science, economics, or similar discipline</li><li>Data visualization skills and ability to present technical solutions to non-technical audience</li><li>Strong interpersonal and communication skills</li><li>Strong analytical, creative problem-solving and decision-making skills</li><li>Strong business acumen; grocery and/or retail experience is a plus</li><li>Passionate about data, analysis, and insights</li><li>Natural curiosity, Welcomes and embraces change</li><li>Ability to work fast yet accurately</li><li>An openness and willingness to try new things and to fail</li><li>Ability to work in a highly collaborative environment<br></li></ul>\n      </div>"]},
{"title": ["Lead Data Scientist (P3719)"], "location": ["\n              United States\n            "], "company_name": ["\n                84.51˚\n              "], "position_name": ["Lead Data Scientist (P3719)"], "experience_required": ["\n            Mid-Senior level\n          "], "contract_type": ["\n          Full-time\n        "], "function_name": ["\n            Engineering and Information Technology\n          "], "company_sector": ["\n          Business Consulting and Services\n          "], "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <strong><u>84.51° Overview<br><br></u></strong>84.51° is a retail data science, insights and media company. We help the Kroger company, consumer packaged goods companies, agencies, publishers and affiliated partners create more personalized and valuable experiences for shoppers across the path to purchase.<br><br>Powered by cutting edge science, we leverage 1st party retail data from nearly 1 of 2 US households and 2BN+ transactions to fuel a more customer-centric journey utilizing 84.51° Insights, 84.51° Loyalty Marketing and our retail media advertising solution, Kroger Precision Marketing.<br><br>Join us at 84.51°!<br><br>__________________________________________________________<br><br><strong>Lead Data Scientist – Kroger Precision Marketing<br><br></strong>Kroger Precision Marketing (KPM) powered by 84.51°, is a leading retail media advertising solution. KPM closes the loop between media exposure and store sales by using first-party purchase data to make brand advertising more addressable, actionable, and accountable. Launched almost three years ago, we have activated campaigns for over 1000 brands. Our vision is to become the preferred media company for advertisers by creating a more accountable media supply chain that increases the effectiveness of investment dollars. We are a growing team of passionate and talented analysts, data scientists, marketing consultants, and media strategists who are committed to transforming the media industry.<br><br>As <strong>Lead Data Scientist– Kroger Precision Marketing </strong>you are joining a community of analysts, data scientists, and software engineers – we are researchers in search of the customer story.  We are the voice of the customer.  Customers share their story with us each day, and it is our job to tell their story.  Our Data Science team is known for solving client and customer problems, employing the most appropriate statistical and analytic approaches. You will be hands on with respect to the analysis of media with a robust retailer database of 60MM households, using the full suite of 84.51° technical and visual tools – SQL, R, Python, Tableau, and other specific internal tools – to create timely, relevant, and actionable predictive science solutions.<br><br><strong><u>Responsibilities<br></u></strong><ul><li>Lead science research projects, ideation, and methodology work to enhance our media planning, optimization, and measurement science offerings</li><li>Collaborate with other research teams at 84.51° to vet application of advanced science techniques within the media business </li><li>Utilize your media data science experience to influence and drive advanced machine learning solutions into our platform and products. Think creatively when building science solutions in order to bring the most value to the user</li><li>Be a data science / analytics ambassador to our sales and product teams. Explain the how and why around our data science solutions through formal and informal training sessions and creation of documentation</li><li>Independently lead and manage projects, tasks, and stakeholders to ensure that projects are delivered on time, within budget and to brief specification</li><li>Mentor and develop junior data scientists on media insights interpretation, results delivery, and data science methodologies</li><li>As a data science champion, be a voice that helps improve and maintain and our position as industry leaders in media science capabilities<br></li></ul><strong><u>Qualifications, Skills And Experience<br></u></strong><ul><li>MS or PhD in Statistics, Mathematics, Data Science, Machine Learning, Computer Science, or related field</li><li>2+ years of experience in analytics across ad technology, digital media and advertising. Experience in building media auction systems (RTB) preferred.</li><li>4+ years hands-on experience building and working with machine learning solutions. Ideally partnering across software engineering and product management teams to develop and scale new algorithms, features, and enhancements</li><li>Strong Python skills plus 4+ years of experience extracting and manipulating data from large, disparate data sources using big data and cloud technologies (Azure, Hadoop, Spark, Databricks and/or similar technologies)</li><li>Experience with one or more of the following: NLP, classification, pattern recognition, recommendation systems, targeting systems or similar</li><li>Strong interpersonal and communication skills including excellent verbal, written, presentation and consultation skills are required</li><li>Strong business acumen, analytical problem-solving and decision-making skills</li><li>Excellent attention to detail, organization skills and ability to work in a highly collaborative environment<br></li></ul><strong><u> About 84.51°<br><br></u></strong>84.51° knows customers, and we know how to connect you.<br><br>Using a sophisticated, proprietary suite of tools and technology, we turn customer data into actionable knowledge. With unparalleled customer data and predictive analytics capabilities, we deliver personalized marketing strategies and ensure the best experience for customers of Kroger and more than 300 consumer-packaged-goods companies. We put the customer at the center of everything we do, resulting in a more dynamic, informed and personal approach to driving customer loyalty.<br><br>\n      </div>"]},
{"title": ["Lead Data Scientist (P3719)"], "location": ["\n              Deerfield, IL\n            "], "company_name": ["\n                84.51˚\n              "], "position_name": ["Lead Data Scientist (P3719)"], "experience_required": ["\n            Mid-Senior level\n          "], "contract_type": ["\n          Full-time\n        "], "function_name": ["\n            Engineering and Information Technology\n          "], "company_sector": ["\n          Business Consulting and Services\n          "], "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <strong><u>84.51° Overview<br><br></u></strong>84.51° is a retail data science, insights and media company. We help the Kroger company, consumer packaged goods companies, agencies, publishers and affiliated partners create more personalized and valuable experiences for shoppers across the path to purchase.<br><br>Powered by cutting edge science, we leverage 1st party retail data from nearly 1 of 2 US households and 2BN+ transactions to fuel a more customer-centric journey utilizing 84.51° Insights, 84.51° Loyalty Marketing and our retail media advertising solution, Kroger Precision Marketing.<br><br>Join us at 84.51°!<br><br>__________________________________________________________<br><br><strong>Lead Data Scientist – Kroger Precision Marketing<br><br></strong>Kroger Precision Marketing (KPM) powered by 84.51°, is a leading retail media advertising solution. KPM closes the loop between media exposure and store sales by using first-party purchase data to make brand advertising more addressable, actionable, and accountable. Launched almost three years ago, we have activated campaigns for over 1000 brands. Our vision is to become the preferred media company for advertisers by creating a more accountable media supply chain that increases the effectiveness of investment dollars. We are a growing team of passionate and talented analysts, data scientists, marketing consultants, and media strategists who are committed to transforming the media industry.<br><br>As <strong>Lead Data Scientist– Kroger Precision Marketing </strong>you are joining a community of analysts, data scientists, and software engineers – we are researchers in search of the customer story.  We are the voice of the customer.  Customers share their story with us each day, and it is our job to tell their story.  Our Data Science team is known for solving client and customer problems, employing the most appropriate statistical and analytic approaches. You will be hands on with respect to the analysis of media with a robust retailer database of 60MM households, using the full suite of 84.51° technical and visual tools – SQL, R, Python, Tableau, and other specific internal tools – to create timely, relevant, and actionable predictive science solutions.<br><br><strong><u>Responsibilities<br></u></strong><ul><li>Lead science research projects, ideation, and methodology work to enhance our media planning, optimization, and measurement science offerings</li><li>Collaborate with other research teams at 84.51° to vet application of advanced science techniques within the media business </li><li>Utilize your media data science experience to influence and drive advanced machine learning solutions into our platform and products. Think creatively when building science solutions in order to bring the most value to the user</li><li>Be a data science / analytics ambassador to our sales and product teams. Explain the how and why around our data science solutions through formal and informal training sessions and creation of documentation</li><li>Independently lead and manage projects, tasks, and stakeholders to ensure that projects are delivered on time, within budget and to brief specification</li><li>Mentor and develop junior data scientists on media insights interpretation, results delivery, and data science methodologies</li><li>As a data science champion, be a voice that helps improve and maintain and our position as industry leaders in media science capabilities<br></li></ul><strong><u>Qualifications, Skills And Experience<br></u></strong><ul><li>MS or PhD in Statistics, Mathematics, Data Science, Machine Learning, Computer Science, or related field</li><li>2+ years of experience in analytics across ad technology, digital media and advertising. Experience in building media auction systems (RTB) preferred.</li><li>4+ years hands-on experience building and working with machine learning solutions. Ideally partnering across software engineering and product management teams to develop and scale new algorithms, features, and enhancements</li><li>Strong Python skills plus 4+ years of experience extracting and manipulating data from large, disparate data sources using big data and cloud technologies (Azure, Hadoop, Spark, Databricks and/or similar technologies)</li><li>Experience with one or more of the following: NLP, classification, pattern recognition, recommendation systems, targeting systems or similar</li><li>Strong interpersonal and communication skills including excellent verbal, written, presentation and consultation skills are required</li><li>Strong business acumen, analytical problem-solving and decision-making skills</li><li>Excellent attention to detail, organization skills and ability to work in a highly collaborative environment<br></li></ul><strong><u> About 84.51°<br><br></u></strong>84.51° knows customers, and we know how to connect you.<br><br>Using a sophisticated, proprietary suite of tools and technology, we turn customer data into actionable knowledge. With unparalleled customer data and predictive analytics capabilities, we deliver personalized marketing strategies and ensure the best experience for customers of Kroger and more than 300 consumer-packaged-goods companies. We put the customer at the center of everything we do, resulting in a more dynamic, informed and personal approach to driving customer loyalty.<br><br>\n      </div>"]},
{"title": ["Software Engineer, Big Data"], "location": ["\n              San Francisco, CA\n            "], "company_name": ["\n                Pinterest\n              "], "position_name": ["Software Engineer, Big Data"], "experience_required": ["\n            Mid-Senior level\n          "], "contract_type": ["\n          Full-time\n        "], "function_name": ["\n            Information Technology\n          "], "company_sector": ["\n          IT Services and IT Consulting, Software Development, and Technology, Information and Internet\n          "], "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        2456066<br><br><strong><u>About Pinterest<br><br></u></strong>Millions of people across the world come to Pinterest to find new ideas every day. It’s where they get inspiration, dream about new possibilities and plan for what matters most. Our mission is to help those people find their inspiration and create a life they love. In your role, you’ll be challenged to take on work that upholds this mission and pushes Pinterest forward. You’ll grow as a person and leader in your field, all the while helping Pinners make their lives better in the positive corner of the internet.<br><br><em>Our new progressive work model is called PinFlex, a term that’s uniquely Pinterest to describe our flexible approach to living and working. Visit our </em><em><u>PinFlex</u></em><em> landing page to learn more. <br><br></em>The Big Data &amp; Analytics Platform team at Pinterest is responsible for end to end big data infrastructure, data warehousing &amp; business intelligence solutions that powers the rest of the business. The team owns both the critical data infrastructures from log ingestion, batch &amp; stream processing, big data query &amp; workflow systems, and also the data processing &amp; ETL pipelines for data warehousing and business intelligence.<br><br><strong><u>What You’ll Do<br></u></strong><ul><li>You’ll have the opportunity to build the infrastructure platforms or the data processing pipelines that powers Pinterest’s critical business needs.</li><li>Building or using the cutting edge big data technologies such as Hadoop/Spark/Flink/Kafka/Airflow/Presto.<br></li></ul><strong><u>What We’re Looking For</u></strong> <ul><li>4+ years of industry experience in big data infrastructure or data warehouse engineering/business intelligence.</li><li>Passionate about working with data at hundreds of petabytes scale.</li><li>Solid experience in one of the languages in Java/Scala/Python.</li><li>Nice to have:</li><ul><li>B.S., M.S., or PhD in a related field</li><li>Publications at conferences</li><li>Expertise with either big data infrastructure (e.g. Hadoop/Spark/Flink/Kafka/Airflow/Presto) or with using big data technologies for data processing, ETL, reporting.<br></li></ul></ul>At Pinterest we believe the workplace should be equitable, inclusive, and inspiring for every employee. In an effort to provide greater transparency, we are sharing the base salary range for this position. This position will pay a base salary of $172,500 to $382,700. The position is also eligible for equity. Final salary is based on a number of factors including location, travel, relevant prior experience, or particular skills and expertise.<br><br>Information regarding the culture at Pinterest and benefits available for this position can be found at https://www.pinterestcareers.com/pinterest-life/.<br><br><strong><u>Our Commitment To Diversity<br><br></u></strong>At Pinterest, our mission is to bring everyone the inspiration to create a life they love—and that includes our employees. We’re taking on the most exciting challenges of our working lives, and we succeed with a team that represents an inclusive and diverse set of identities and backgrounds.<br><br>\n      </div>"]},
{"title": ["Lead Data Scientist (P3719)"], "location": ["\n              Cincinnati, OH\n            "], "company_name": ["\n                84.51˚\n              "], "position_name": ["Lead Data Scientist (P3719)"], "experience_required": ["\n            Mid-Senior level\n          "], "contract_type": ["\n          Full-time\n        "], "function_name": ["\n            Engineering and Information Technology\n          "], "company_sector": ["\n          Business Consulting and Services\n          "], "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <strong><u>84.51° Overview<br><br></u></strong>84.51° is a retail data science, insights and media company. We help the Kroger company, consumer packaged goods companies, agencies, publishers and affiliated partners create more personalized and valuable experiences for shoppers across the path to purchase.<br><br>Powered by cutting edge science, we leverage 1st party retail data from nearly 1 of 2 US households and 2BN+ transactions to fuel a more customer-centric journey utilizing 84.51° Insights, 84.51° Loyalty Marketing and our retail media advertising solution, Kroger Precision Marketing.<br><br>Join us at 84.51°!<br><br>__________________________________________________________<br><br><strong>Lead Data Scientist – Kroger Precision Marketing<br><br></strong>Kroger Precision Marketing (KPM) powered by 84.51°, is a leading retail media advertising solution. KPM closes the loop between media exposure and store sales by using first-party purchase data to make brand advertising more addressable, actionable, and accountable. Launched almost three years ago, we have activated campaigns for over 1000 brands. Our vision is to become the preferred media company for advertisers by creating a more accountable media supply chain that increases the effectiveness of investment dollars. We are a growing team of passionate and talented analysts, data scientists, marketing consultants, and media strategists who are committed to transforming the media industry.<br><br>As <strong>Lead Data Scientist– Kroger Precision Marketing </strong>you are joining a community of analysts, data scientists, and software engineers – we are researchers in search of the customer story.  We are the voice of the customer.  Customers share their story with us each day, and it is our job to tell their story.  Our Data Science team is known for solving client and customer problems, employing the most appropriate statistical and analytic approaches. You will be hands on with respect to the analysis of media with a robust retailer database of 60MM households, using the full suite of 84.51° technical and visual tools – SQL, R, Python, Tableau, and other specific internal tools – to create timely, relevant, and actionable predictive science solutions.<br><br><strong><u>Responsibilities<br></u></strong><ul><li>Lead science research projects, ideation, and methodology work to enhance our media planning, optimization, and measurement science offerings</li><li>Collaborate with other research teams at 84.51° to vet application of advanced science techniques within the media business </li><li>Utilize your media data science experience to influence and drive advanced machine learning solutions into our platform and products. Think creatively when building science solutions in order to bring the most value to the user</li><li>Be a data science / analytics ambassador to our sales and product teams. Explain the how and why around our data science solutions through formal and informal training sessions and creation of documentation</li><li>Independently lead and manage projects, tasks, and stakeholders to ensure that projects are delivered on time, within budget and to brief specification</li><li>Mentor and develop junior data scientists on media insights interpretation, results delivery, and data science methodologies</li><li>As a data science champion, be a voice that helps improve and maintain and our position as industry leaders in media science capabilities<br></li></ul><strong><u>Qualifications, Skills And Experience<br></u></strong><ul><li>MS or PhD in Statistics, Mathematics, Data Science, Machine Learning, Computer Science, or related field</li><li>2+ years of experience in analytics across ad technology, digital media and advertising. Experience in building media auction systems (RTB) preferred.</li><li>4+ years hands-on experience building and working with machine learning solutions. Ideally partnering across software engineering and product management teams to develop and scale new algorithms, features, and enhancements</li><li>Strong Python skills plus 4+ years of experience extracting and manipulating data from large, disparate data sources using big data and cloud technologies (Azure, Hadoop, Spark, Databricks and/or similar technologies)</li><li>Experience with one or more of the following: NLP, classification, pattern recognition, recommendation systems, targeting systems or similar</li><li>Strong interpersonal and communication skills including excellent verbal, written, presentation and consultation skills are required</li><li>Strong business acumen, analytical problem-solving and decision-making skills</li><li>Excellent attention to detail, organization skills and ability to work in a highly collaborative environment<br></li></ul><strong><u> About 84.51°<br><br></u></strong>84.51° knows customers, and we know how to connect you.<br><br>Using a sophisticated, proprietary suite of tools and technology, we turn customer data into actionable knowledge. With unparalleled customer data and predictive analytics capabilities, we deliver personalized marketing strategies and ensure the best experience for customers of Kroger and more than 300 consumer-packaged-goods companies. We put the customer at the center of everything we do, resulting in a more dynamic, informed and personal approach to driving customer loyalty.<br><br>\n      </div>"]},
{"title": ["Release Train Engineer (RTE)"], "location": ["\n              Dulles Town Center, VA\n            "], "company_name": ["\n                Solutions³ LLC\n              "], "position_name": ["Release Train Engineer (RTE)"], "experience_required": ["\n            Mid-Senior level\n          "], "contract_type": ["\n          Full-time\n        "], "function_name": ["\n            Engineering and Information Technology\n          "], "company_sector": ["\n          Internet Publishing\n          "], "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <strong>Title</strong>: <strong>Release Train Engineer (RTE) </strong><p><br></p><strong><em>This is a Remote work position</em></strong><p><br></p><strong>Description</strong>:<p><br></p>Solutions³ LLC is supporting our prime contractor and their U.S. Government customer on a large mission-critical development and sustainment program to design, build, deliver, and operate a network operations environment; including introducing new cyber capabilities to address emerging threats.<p><br></p>Solutions³ LLC is seeking a <strong>Release Train Engineer</strong> (<strong>RTE</strong>) to support this critical customer mission. The Release Train Engineer will act as a servant leader and drive relentless improvement. They will ensure clear communication working alongside Scrum Masters to remove impediments and help the ART towards success in meeting its PI objectives. The RTE is expected to have a thorough understanding of the Scaled Agile Framework (SAFe) and will be able to use the appropriate Agile methodology (Scrum/Kanban/XP) to facilitate the ART level activities.<p><br></p><strong>Responsibilities</strong>:<p><br></p><ul><li>Exhibit the behaviors of a Lean-Agile Leader with a Lean-Agile Mindset. Help the team embrace Lean-Agile Values, adopt and apply Lean-Agile Principles, and implement Lean- Agile practices</li><li>Manages and optimizes the flow of value through the ART, facilitates ART level events (including I&amp;A, SoS) in helping to manage risks and dependencies—escalating impediments as needed</li><li>Drives the journey towards high-performing teams and ARTs through transparency, team empowerment and continuous learning in order to promote Business Value delivery</li><li>Produce and present ART level metrics to help the ARTs improve and take responsibility for their actions; Teach problem-solving techniques and support the Scrum Masters as coaches for their Agile team</li><li>Facilitate PI Planning readiness, organizes and conducts the PI Planning event, working in conjunction with PM, Architects, Epic Owners, and Business Owner</li><li>Help the Product Management in their efforts to manage and prioritize the ART Feature Backlog, generate a Vision, and build a Roadmap</li><li>Define and document the ART’s development value stream. Coach ART members on understanding their value stream, measure the flow and relentlessly improve on the ART’s value flow</li></ul><p><br></p><strong>Eligibility</strong>:<p><br></p><ul><li>Must be a US Citizen</li><li>Must have an active DoD Secret Clearance and must able to obtain a TS/SCI clearance</li><li>Must be able to obtain DHS Suitability prior to starting employment </li><li>Must have 8+ years directly relevant experience </li><li>Must have 2+ years of Agile experience and recent hands-on experience as a successful Scrum Master OR Release Train Engineer</li></ul><p><br></p><strong>Required Skills</strong><p><br></p><ul><li>Solid problem solving and influencing skills</li><li>Excellent interpersonal, collaboration and communication skills</li><li>Experience working with various audiences, both technical and non-technical</li><li>Experience working on software development teams and understand both SDLC and Agile Framework</li><li>Experience working with Agile methodologies such as Scrum, Kanban, Extreme Programming</li><li>Proficient in using Jira software </li></ul><p><br></p><strong>Desired Skills</strong>:<p><br></p><ul><li>Experience working with Agile tools including Confluence</li><li>Domain knowledge in Cyber Security</li><li>Working knowledge in various technologies to include Cloud Computing, Big Data, DevSecOps, and Automation</li></ul><p><br></p><strong>Required Education</strong>: BS Systems Engineering, Computer Science, Computer Engineering, Computer Information Systems, OR a related field. Two years of related work experience may be substituted for each year of degree-level education.<p><br></p><strong>Desired Certifications</strong>: Agile certification from Scaled Agile Inc. (SAFe SASM, RTE, SPC)<p><br></p><ul><li> Scrum Alliance certification (CSM, A-CSM, CSP-SM) or PMI’s Agile Certified Professional</li><li> DoD 8570.1-M Compliance at IAT Level I</li></ul><p><br></p>Powered by JazzHR<p><br></p>yrCPyhnK9u\n      </div>"]},
{"title": ["Senior Python Engineer"], "location": ["\n              Los Angeles, CA\n            "], "company_name": ["\n                Jobot\n              "], "position_name": ["Senior Python Engineer"], "experience_required": ["\n            Mid-Senior level\n          "], "contract_type": ["\n          Full-time\n        "], "function_name": ["\n            Engineering and Information Technology\n          "], "company_sector": ["\n          IT Services and IT Consulting and Software Development\n          "], "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <strong>REMOTE - Senior Python Engineer opportunity - High-Growth Start-Up!</strong><p><br></p>This Jobot Job is hosted by David DeCristofaro<p><br></p>Are you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume.<p><br></p>Salary $150,000 - $190,000 per year<p><br></p><strong>A Bit About Us</strong><p><br></p>Founded by MIT alumni, we are a high-growth, SaaS based company focused on make the most out large amounts of complex data in real-time to solve real world problems across multiple sectors. This includes Legal, Finance, Public Sector, Non-Profit, and more!<p><br></p>Our flagship product is like no other within the industry and will be a true gamechanger in multiple sectors, helping to speed up delivery and increase efficiencies for an organization.<p><br></p>If you are interested in making an impact at a growing company, then please read on!<p><br></p><strong><br><br><strong>Why join us?<br></strong></strong><p><br></p><ul><li> Tremendous Growth Opportunity!</li><li> Competitive Base Salary + Equity!</li><li> Cutting-Edge Technology!</li><li> Meaningful Projects!</li><li> High-Impact Opportunity!</li><li> Fully Remote and Flexible Hours!</li><li> Unlimited PTO!</li><li> Excellent Benefits Package!</li></ul><p><br></p><strong>Job Details</strong><p><br></p>We are looking for a Senior Backend Engineer to take ownership of the full development lifecycle within a small Engineering team. This will be a high-impact role, focused on the backend of our flagship SaaS product. Some skills and responsibilities include<p><br></p><ul><li> 7+ years of software development experience, ideally SaaS or enterprise software development</li><li> Expert knowledge of Python and/or Golang</li><li> Experience with a graph database such as GraphQL, Cypher, and/or Neo4J</li><li> Track record of building and working with complex backend systems</li><li> Fluency in web framework architecture such as Flask</li><li> Familiarity with cloud environments (AWS, GCP)</li></ul><p><br></p>Interested in hearing more? Easy Apply now by clicking the \"Apply\" button.<p><br></p>\n      </div>"]},
{"title": ["Software Engineer in Test (Automation)"], "location": ["\n              Windsor, CT\n            "], "company_name": ["\n                Bridge Technical Talent\n              "], "position_name": ["Software Engineer in Test (Automation)"], "experience_required": ["\n            Mid-Senior level\n          "], "contract_type": ["\n          Full-time\n        "], "function_name": ["\n            Information Technology, Business Development, and Analyst\n          "], "company_sector": ["\n          IT Services and IT Consulting, Software Development, and Strategic Management Services\n          "], "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong><u>POSITION SUMMARY</u></strong></p><p>This position is responsible for developing and maintaining the software automation framework needed to test N-Tier applications, front-end web applications, and web services developed by the Solutions Engineering Center (SEC). This person may also be required to develop QA Test Plans, generate QA Reports, and conduct software application training as needed.</p><p><br></p><p><strong><u>CORE QUALIFICATIONS</u></strong></p><ul><li>5+ years of related work experience developing in Selenium framework and JavaScript/Node.JS</li><li>2+ years of experience testing software using automation</li><li>Experience and capability to effectively write code by hand as needed</li><li>Demonstrated CI/CD experience, writing and designing test cases</li><li>Expert level in JavaScript and Node.JS framework</li><li>Experience with Agile development/testing methodologies</li><li>Experience developing scripts for testing web services, preferably REST APIs</li><li>Knowledge and familiarity with design patterns</li><li>Ability to write relationship database queries in SQL</li><li>Experience with version control systems such as Git, CVS, or Subversion a plus</li><li>PC networking knowledge a plus</li><li>Strong communication skills, both written and verbal; Good grasp of English language oral/written</li><li>Bachelor’s degree in a related field strongly preferred</li></ul><p><br></p><p><strong><u>ESSENTIAL RESPONSIBILITIES</u></strong></p><ul><li>Develop and implement automation testing frameworks to evaluate front-end web applications and web services with an agile development environment</li><li>Develop automation test framework and test cases for functional, performance, and regression test execution</li><li>Interpret functional requirements and design documents to plan, develop, write, and execute application functional and data validation automation test plans and test scripts</li><li>Maintain automated tests and test framework</li><li>Work with developers, project managers, technical writers, and other individuals to collect all information necessary to create effective QA Functional Test Plans and automation scripts</li><li>Integrate software testing tools with software build environments to automatically execute the automation test scripts as part of the post-build process</li><li>Ensure all automation testing produces accurate pass/fail reports</li><li>Continuously research automation test standards and implement “best practices” when designing/implementing the automation testing frameworks that will be deployed/utilized for testing all software solutions</li></ul><p><br></p><p><strong><u>COMPENSATION &amp; BENEFITS</u></strong></p><ul><li>Outstanding benefits package (including medical, dental, vision, disability, and life insurance)</li><li>401(k) plan with matching company contribution</li><li>Generous holiday and paid time off schedules</li><li>Tuition Assistance Program</li><li>Employee Referral Bonus Program</li><li>Ongoing professional development training</li><li>Visible, exciting work supporting sales of cutting-edge technology and workflow solutions</li><li>Salary commensurate with experience level and qualifications</li></ul>\n      </div>"]},
{"title": ["Lead Data Scientist (P3719)"], "location": ["\n              Chicago, IL\n            "], "company_name": ["\n                84.51˚\n              "], "position_name": ["Lead Data Scientist (P3719)"], "experience_required": ["\n            Mid-Senior level\n          "], "contract_type": ["\n          Full-time\n        "], "function_name": ["\n            Engineering and Information Technology\n          "], "company_sector": ["\n          Business Consulting and Services\n          "], "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <strong><u>84.51° Overview<br><br></u></strong>84.51° is a retail data science, insights and media company. We help the Kroger company, consumer packaged goods companies, agencies, publishers and affiliated partners create more personalized and valuable experiences for shoppers across the path to purchase.<br><br>Powered by cutting edge science, we leverage 1st party retail data from nearly 1 of 2 US households and 2BN+ transactions to fuel a more customer-centric journey utilizing 84.51° Insights, 84.51° Loyalty Marketing and our retail media advertising solution, Kroger Precision Marketing.<br><br>Join us at 84.51°!<br><br>__________________________________________________________<br><br><strong>Lead Data Scientist – Kroger Precision Marketing<br><br></strong>Kroger Precision Marketing (KPM) powered by 84.51°, is a leading retail media advertising solution. KPM closes the loop between media exposure and store sales by using first-party purchase data to make brand advertising more addressable, actionable, and accountable. Launched almost three years ago, we have activated campaigns for over 1000 brands. Our vision is to become the preferred media company for advertisers by creating a more accountable media supply chain that increases the effectiveness of investment dollars. We are a growing team of passionate and talented analysts, data scientists, marketing consultants, and media strategists who are committed to transforming the media industry.<br><br>As <strong>Lead Data Scientist– Kroger Precision Marketing </strong>you are joining a community of analysts, data scientists, and software engineers – we are researchers in search of the customer story.  We are the voice of the customer.  Customers share their story with us each day, and it is our job to tell their story.  Our Data Science team is known for solving client and customer problems, employing the most appropriate statistical and analytic approaches. You will be hands on with respect to the analysis of media with a robust retailer database of 60MM households, using the full suite of 84.51° technical and visual tools – SQL, R, Python, Tableau, and other specific internal tools – to create timely, relevant, and actionable predictive science solutions.<br><br><strong><u>Responsibilities<br></u></strong><ul><li>Lead science research projects, ideation, and methodology work to enhance our media planning, optimization, and measurement science offerings</li><li>Collaborate with other research teams at 84.51° to vet application of advanced science techniques within the media business </li><li>Utilize your media data science experience to influence and drive advanced machine learning solutions into our platform and products. Think creatively when building science solutions in order to bring the most value to the user</li><li>Be a data science / analytics ambassador to our sales and product teams. Explain the how and why around our data science solutions through formal and informal training sessions and creation of documentation</li><li>Independently lead and manage projects, tasks, and stakeholders to ensure that projects are delivered on time, within budget and to brief specification</li><li>Mentor and develop junior data scientists on media insights interpretation, results delivery, and data science methodologies</li><li>As a data science champion, be a voice that helps improve and maintain and our position as industry leaders in media science capabilities<br></li></ul><strong><u>Qualifications, Skills And Experience<br></u></strong><ul><li>MS or PhD in Statistics, Mathematics, Data Science, Machine Learning, Computer Science, or related field</li><li>2+ years of experience in analytics across ad technology, digital media and advertising. Experience in building media auction systems (RTB) preferred.</li><li>4+ years hands-on experience building and working with machine learning solutions. Ideally partnering across software engineering and product management teams to develop and scale new algorithms, features, and enhancements</li><li>Strong Python skills plus 4+ years of experience extracting and manipulating data from large, disparate data sources using big data and cloud technologies (Azure, Hadoop, Spark, Databricks and/or similar technologies)</li><li>Experience with one or more of the following: NLP, classification, pattern recognition, recommendation systems, targeting systems or similar</li><li>Strong interpersonal and communication skills including excellent verbal, written, presentation and consultation skills are required</li><li>Strong business acumen, analytical problem-solving and decision-making skills</li><li>Excellent attention to detail, organization skills and ability to work in a highly collaborative environment<br></li></ul><strong><u> About 84.51°<br><br></u></strong>84.51° knows customers, and we know how to connect you.<br><br>Using a sophisticated, proprietary suite of tools and technology, we turn customer data into actionable knowledge. With unparalleled customer data and predictive analytics capabilities, we deliver personalized marketing strategies and ensure the best experience for customers of Kroger and more than 300 consumer-packaged-goods companies. We put the customer at the center of everything we do, resulting in a more dynamic, informed and personal approach to driving customer loyalty.<br><br>\n      </div>"]},
{"title": ["Senior Software Engineer, Python"], "location": ["\n              United States\n            "], "company_name": ["\n                Indigo\n              "], "position_name": ["Senior Software Engineer, Python"], "experience_required": ["\n            Mid-Senior level\n          "], "contract_type": ["\n          Full-time\n        "], "function_name": ["\n            Engineering and Information Technology\n          "], "company_sector": ["\n          Food and Beverage Manufacturing\n          "], "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <strong>About Indigo<br><br></strong>Indigo Ag is a mission-driven company dedicated to harnessing nature to help farmers sustainably feed the planet. We innovate across a breadth of technology and science disciplines to help enhance agriculture's long-term sustainability and profitability and mitigate the climate crisis. We seek to positively impact the world through the digital and biological solutions we bring to the market, creating a more resilient earth, healthier economies, and thriving communities. Our people build partnerships, explore the science, and engineer the technology to help grow the future of sustainable agriculture. The only way to achieve it is through a unique combination of expertise – from Fortune 500 to academia, soil science and agriculture, to tech start-ups.<br><br>We’re building the technology to feed the world and fight climate change. We believe that through teamwork we can achieve more to benefit all of agriculture: from farmers to consumers to the planet. Carbon by Indigo is a scientifically backed program that provides growers with a new revenue stream in the form of verified agricultural carbon credits.<br><br>As a Senior Backend Software Engineer on the Data Validation and Gapfilling team, you will help build, maintain, and scale the Data Validation and Gapfilling services. Both services are crucial to making sure that agronomic data is complete and correct. All data in the Carbon program must pass through these steps prior to carbon credit modeling.<br><br><strong> About this role:<br><br></strong>As an engineer on the Carbon Team you will:<br><ul><li> Design, build, test, and deploy code to create additional opportunities and scale our software.</li><li> Help turn uncertain product or scientific requirements into implementable software requirements.</li><li> Collaborate across Engineering, Science, Product, and Policy to improve product quality, performance, and reliability.</li><li> Provide constructive design and code reviews.<br><br></li></ul><strong>Qualifications:<br><br></strong>You have experience in one or more modern programming languages (we work primarily in Python, but alternate experience is acceptable).You have proven engineering and coding skills, data structure knowledge, and strong troubleshooting skills.<br><br>You are a fast learner and thrive in a fast-paced environment.<br><br>You are collaborative and able to communicate with other teams of engineers and non-engineers.<br><br>You enjoy mentoring others and sharing your knowledge.<br><br>You have a degree in an Engineering or STEM field, or equivalent work experience.<br><br>Experience working with scientists or working in a research environment is a plus.<br><br>Experience working in a complex domain, such as agriculture, is a plus.<br><br><strong>Why You Should Apply<br><br></strong>Our mission is unique, and therefore our teams are too. From multigenerational farming experts to product experience experts to cutting-edge technologists, our uniqueness can be owed to the individuals who make up our teams. Connected by a common vision and empowered by diversity, we aren’t an ordinary company, and neither are you. Join Indigo in cultivating a healthier planet.<br><br>The requirements listed above are examples of what we think enables success in this role, but we recognize the impossibility of fully capturing a singularly perfect description, and we believe in the power of diversified and creative displays of skills and qualifications. We embrace the unconventional. We embrace creativity. We embrace a challenge to the status quo. If the specifications in the list above aren’t an exact match… great! Apply, be you, and be proud that you aren’t ordinary (we certainly aren’t!).<br><br>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.<br><br><strong>Benefits:<br><br></strong>Health, dental, and vision insurance for you and your family.<br><br>Generous time off.<br><br>Parental leave<br><br>A remote-first organization with flexible work hours<br><br>Commuter benefits401(k) plan<br><br>Competitive compensation including stock options<br><br>#LI- CJ11<br><br><em>At Indigo, we are committed to providing an environment of mutual respect where equal employment opportunities are available to all applicants and team members. All employment decisions are based on business needs, job requirements, and individual qualifications, without regard to race, color, religion or belief, sex, pregnancy (including childbirth, lactation, and related medical conditions), national, social or ethnic origin, age, physical, mental or sensory disability, marital status, family or parental status, sexual orientation, gender identity and/or expression, family medical history or genetic information, military and veteran status, and any other characteristic protected by applicable law. Indigo believes that diversity, equity, and inclusion among our team members are critical to our success. We seek to recruit, develop and retain the most talented people from a diverse candidate pool. <br><br></em><em>If you’re applying for a job in the U.S. and need reasonable accommodation for any part of the employment process, please email talent@indigoag.com and let us know the nature of your request and contact information. Please note that only those inquiries concerning a request for reasonable accommodation will be responded to from this email address.</em>\n      </div>"]},
{"title": ["Software Engineer, Big Data"], "location": ["\n              California, United States\n            "], "company_name": ["\n                Pinterest\n              "], "position_name": ["Software Engineer, Big Data"], "experience_required": ["\n            Mid-Senior level\n          "], "contract_type": ["\n          Full-time\n        "], "function_name": ["\n            Information Technology\n          "], "company_sector": ["\n          IT Services and IT Consulting, Software Development, and Technology, Information and Internet\n          "], "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        2456066<br><br><strong><u>About Pinterest<br><br></u></strong>Millions of people across the world come to Pinterest to find new ideas every day. It’s where they get inspiration, dream about new possibilities and plan for what matters most. Our mission is to help those people find their inspiration and create a life they love. In your role, you’ll be challenged to take on work that upholds this mission and pushes Pinterest forward. You’ll grow as a person and leader in your field, all the while helping Pinners make their lives better in the positive corner of the internet.<br><br><em>Our new progressive work model is called PinFlex, a term that’s uniquely Pinterest to describe our flexible approach to living and working. Visit our </em><em><u>PinFlex</u></em><em> landing page to learn more. <br><br></em>The Big Data &amp; Analytics Platform team at Pinterest is responsible for end to end big data infrastructure, data warehousing &amp; business intelligence solutions that powers the rest of the business. The team owns both the critical data infrastructures from log ingestion, batch &amp; stream processing, big data query &amp; workflow systems, and also the data processing &amp; ETL pipelines for data warehousing and business intelligence.<br><br><strong><u>What You’ll Do<br></u></strong><ul><li>You’ll have the opportunity to build the infrastructure platforms or the data processing pipelines that powers Pinterest’s critical business needs.</li><li>Building or using the cutting edge big data technologies such as Hadoop/Spark/Flink/Kafka/Airflow/Presto.<br></li></ul><strong><u>What We’re Looking For</u></strong> <ul><li>4+ years of industry experience in big data infrastructure or data warehouse engineering/business intelligence.</li><li>Passionate about working with data at hundreds of petabytes scale.</li><li>Solid experience in one of the languages in Java/Scala/Python.</li><li>Nice to have:</li><ul><li>B.S., M.S., or PhD in a related field</li><li>Publications at conferences</li><li>Expertise with either big data infrastructure (e.g. Hadoop/Spark/Flink/Kafka/Airflow/Presto) or with using big data technologies for data processing, ETL, reporting.<br></li></ul></ul>At Pinterest we believe the workplace should be equitable, inclusive, and inspiring for every employee. In an effort to provide greater transparency, we are sharing the base salary range for this position. This position will pay a base salary of $172,500 to $382,700. The position is also eligible for equity. Final salary is based on a number of factors including location, travel, relevant prior experience, or particular skills and expertise.<br><br>Information regarding the culture at Pinterest and benefits available for this position can be found at https://www.pinterestcareers.com/pinterest-life/.<br><br><strong><u>Our Commitment To Diversity<br><br></u></strong>At Pinterest, our mission is to bring everyone the inspiration to create a life they love—and that includes our employees. We’re taking on the most exciting challenges of our working lives, and we succeed with a team that represents an inclusive and diverse set of identities and backgrounds.<br><br>\n      </div>"]},
{"title": ["Research Scientist"], "location": ["\n              Alpharetta, GA\n            "], "company_name": ["\n                Solvay\n              "], "position_name": ["Research Scientist"], "experience_required": ["\n            Mid-Senior level\n          "], "contract_type": ["\n          Full-time\n        "], "function_name": ["\n            Research, Design, and Science\n          "], "company_sector": ["\n          Chemical Manufacturing\n          "], "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        Solvay is a science company whose technologies bring benefits to many aspects of daily life. Our purpose—we bond people, ideas and elements to reinvent progress—is a call to go beyond, to reinvent future forms of progress and create sustainable shared value for all through the power of science. In a world facing an ever-growing population and quest for resources, we aim to be the driving force triggering the next breakthroughs to enable humanity to advance while protecting the planet we all share.<br><br>We bond with customers and partners to address today and tomorrow’s megatrends. As a global leader in Materials, Chemicals and Solutions, Solvay brings advancements in planes, cars, batteries, smart and medical devices, water and air treatment, to solve critical industrial, social and environmental challenges. You can count on our innovative solutions to contribute to safer, cleaner and more sustainable future.<br><br>Important EEO information related to opening in the US<br>Solvay is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or any other legally protected characteristics. Click on the links to read \"The EEO is the Law\" poster and the “EEO is the Law” poster Supplement.<br>We will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. For more information, please click here.<br>Solvay is committed to working with and providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the employment process, please send an e-mail to humanresources.na-us@solvay.com and let us know the nature of your request and your contact information.<br><br>Role Overview<br><br><strong>We are looking for:<br></strong><strong>Job Overview And Responsibilities<br></strong>The Adhesives Research and Innovation team consists of Research Scientists that are responsible for developing breakthrough technologies in support of Solvay’s future needs in adhesive bonding and surfacing. The research scientist is responsible for leading technology and product development projects to support the growth of the adhesives business. This is accomplished through independent research, scientific studies, and devising experiments to develop new products and technologies. The research scientist should also seek to foster gainful partnerships through collaborative interactions with our customers. The primary job responsibilities include:<br><br><strong>Main Position Responsibilities:<br></strong><ul><li>Leads the development of new adhesive technologies and products in support of the electronic adhesives business.</li><li>Leads multiple R&amp;I projects critical to grow the adhesives business in electronics.</li><li>Meets project milestones and provides project updates to the organization.</li><li>Leads and conducts research in the area of thermosetting polymers and related chemistries to develop leading edge technologies and products.</li><li>Conducts in depth literature searches, stays current on megatrends within the industry and understands the voice of customer.</li><li>Establishes structure/property relationships of materials and utilizes these learnings to develop new products.</li><li>Understands the key business goals of the adhesives business unit and target research areas to meet those goals.</li><li>Establish technical relationships with key customers by presenting and discussing research results.</li><li>Actively secures new IP on research developments and stays current on IP landscape.</li><li>Writes project reports and prepare technical presentations for internal and external review.</li><li>Works effectively with cross functional teams including R&amp;I, customer engineering, process engineering, marketing and sales.</li><li>Supports production operations during new product scale-ups and as required with issues related to the chemistry of products.<br><br><br></li></ul><strong>You will bring:<br><br></strong><strong>Qualifications:<br></strong><ul><li>Ph.D. in chemistry, materials science, polymer science or related scientific areas.</li><li>Minimum 5-10 years of experience in product development of adhesive pastes and films for electronic applications, thermosetting polymers, formulation of adhesives, materials for electronic applications or electronics packaging is required.</li><li>Working knowledge of organic chemistry and structural property relationships is a must.</li><li>Knowledge of surface science and analytical techniques to characterize surfaces will be helpful.</li><li>Familiarity with laboratory practices associated with thermosetting resins (mixing,</li><li>coating and fabrication of test specimens and testing) is desired. Knowledge of various material characterization techniques is required.</li><li>Strong leadership, communication skills and excellent interpersonal skills are essential.</li><li>Ability to work independently on complex research topics with a proven track record of developing breakthrough solutions and commercialization of new products.</li><li>Experiences in product transition from R&amp;D into production, lean manufacturing &amp; lean PD, and six sigma training are preferred but not required<br><br><br></li></ul><strong>You will get:<br></strong><ul><li>Competitive salary</li><li>Health insurance</li><li>Life insurance</li><li>16 weeks of maternity/paternity and co-parenting leave</li><li>Free language courses (24 languages available)</li><li>Additional local benefits<br><br></li></ul>The U.S. annual base salary range reasonably expected to be paid for this new hire is: $100,000 to $120,000. Since actual compensation packages are based on a variety of factors unique to each candidate, we may ultimately pay more or less than the posted base salary range. Total compensation for this role also include bonus and/or other incentives.<br><br><strong>Location </strong>- Alpharetta, GA<br><br><strong>Additional Information<br></strong>Solvay’s purpose is to bond people, ideas and elements to reinvent progress. We can only fulfill this purpose with a diverse workforce that feels respected and appreciated, and has equal opportunities to work, grow and thrive. Our differences, visible or not, are valued. As Solvay seeks to promote unity and not uniformity, we invite you - regardless of background, age, gender, race, national origin, ethnicity, religion, sexual orientation, ability or identity - to consider a future with us.<br><br><br><strong>Important Important EEO information related to opening in the US</strong> <br><br>Solvay is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or any other legally protected characteristics. Click on the links to read \"The EEO is the Law\" poster and the “EEO is the Law” poster Supplement.<br><br> We will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. For more information, please click here.<br><br> Solvay is committed to working with and providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the employment process, please send an e-mail to <strong>hrstaffingoffice.na-us@solvay.com</strong> or call 800-311-3555 and let us know the nature of your request and your contact information.<br><br>\n      </div>"]},
{"title": ["Site Reliability Engineer"], "location": ["\n              Salt Lake City Metropolitan Area\n            "], "company_name": ["\n                DASH2\n              "], "position_name": ["Site Reliability Engineer"], "experience_required": ["\n            Mid-Senior level\n          "], "contract_type": ["\n          Full-time\n        "], "function_name": ["\n            Engineering and Information Technology\n          "], "company_sector": ["\n          Software Development\n          "], "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>We are looking for a passionate Senior Site Reliability Engineer to join our team. Our team is responsible for driving scalable architecture, minimizing risks, providing visibility across a multitude of environments, systems and applications while using lean principles at scale in a fast-paced environment. You'll contribute to the design and documentation of systems, in collaboration with scrum teams, looking for opportunities to automate away waste. You'll work with scrum teams to troubleshoot complicated systems and applications and will partake in an on-call rotation.</p><p><br></p><p><strong> What you’ll be doing</strong></p><ul><li>Work with teams to design and implement automated code deployment solutions</li><li>Work with teams to design and implement automated environment provisioning and container solutions</li><li>Work with teams to design and implement application monitoring and alerting solutions to get issues to the right people at the right time</li><li>Work with teams to remediate issues that impact the health and performance of our production systems and infrastructure</li><li>Work with teams to diagnose and isolate issues at all layers of the stack, whether it be code or infrastructure, during development and in production</li><li>Manage build definitions and hardware in support of our Continuous Delivery policies and procedures</li></ul><p><br></p><p><strong>What you will need to be successful</strong></p><ul><li>Bachelor's degree in CS/Engineering or equivalent experience</li><li>8+ years' experience in a DevOps, SRE, or IT Operations position</li><li>2+ years' experience writing SQL queries and Stored Procedures</li><li>2+ years' experience developing in .NET and C#</li><li>Demonstrated interpersonal skills and ability to collaborate with product owners and development teams</li><li>Demonstrated ability to context switch while still delivering on commitments</li><li>Ability to troubleshoot complex systems and environments</li><li>Experience with CI/CD concepts and tooling</li><li>Knowledge of full stack monitoring concepts and tooling from code to system resources</li><li>Experience with containerization design concepts and tooling</li></ul><p><br></p><p>Benefits &amp; Perks</p><ul><li>Medical, Dental, Vision</li><li>HSA contribution and match</li><li>Dependent Care FSA match</li><li>Unlimited Paid Time Off</li><li>401(k) match</li><li>Paid Parental Leave</li><li>Ongoing Education &amp; Tuition Assistance</li><li>Gym/Fitness Reimbursement</li><li>Award Winning Wellness Program</li></ul>\n      </div>"]},
{"title": ["Software Developer- REMOTE"], "location": ["\n              Chicago, IL\n            "], "company_name": ["\n                Jobot\n              "], "position_name": ["Software Developer- REMOTE"], "experience_required": ["\n            Mid-Senior level\n          "], "contract_type": ["\n          Full-time\n        "], "function_name": ["\n            Engineering and Information Technology\n          "], "company_sector": ["\n          Software Development, Technology, Information and Internet, and Technology, Information and Media\n          "], "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <strong>REMOTE Full Stack Developer with C# experience needed for a SaaS startup!</strong><p><br></p>This Jobot Job is hosted by Naji Hendrix<p><br></p>Are you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume.<p><br></p>Salary $110,000 - $140,000 per year<p><br></p><strong>A Bit About Us</strong><p><br></p>About the company<p><br></p><ul><li> We are software as a service (SaaS) company headquartered in Florida. We provides a sales enablement platform that helps sales and marketing teams work more closely together and sell more effectively. </li><li> We are seeking a skilled Software Engineer to become an integral part of our team. </li><li> You will be responsible for enhancing and maintaining existing applications, as well as developing new web-based applications. </li><li> You will work with both front-end and back-end web developers to build all client-side logic. </li><li> You will be bridging the gap between the visual elements and the server-side infrastructure, taking an active role on both sides, and defining how the application looks and functions.</li></ul><p><br></p><strong><br><br><strong>Why join us?<br></strong></strong><p><br></p>This is REMOTE opportunity! We have a full benefits package and room to grow!<p><br></p><strong>Job Details</strong><p><br></p><strong>Responsibilities</strong><p><br></p><ul><li> Maintain existing codebase</li><li> Develop new user-facing applications and features</li><li> Build reusable code and libraries for future use</li><li> Ensure the technical feasibility of UI/UX designs</li><li> Optimize applications for maximum speed and scalability</li><li> Assure that all user input is validated before submitting to back-end services</li><li> Collaborate with other team members and stakeholders</li><li> Perform bugfixes on existing code as needed</li></ul><p><br></p><strong>Qualifications</strong><p><br></p><ul><li> 3+ years of JavaScript and C# experience </li><li> Understanding of web markup, including HTML5 and CSS3</li><li> Good understanding of JavaScript libraries and frameworks such as Vue, jQuery,</li></ul><p><br></p>ReactJS, Angular, or MooTools<p><br></p><ul><li> Exp. with SQL</li><li> Proficient understanding of cross-browser compatibility issues and ways to work</li></ul><p><br></p>around such issues<p><br></p><ul><li> Familiarity with JavaScript module loaders, such as Require.js and AMD</li><li> Proficient understanding of code versioning tools, such as Git / Mercurial /</li></ul><p><br></p>SVN<p><br></p><ul><li> Good understanding of browser rendering behavior and performance</li></ul><p><br></p>BONUS if you have exp. with ElasticSearch<p><br></p>Interested in hearing more? Easy Apply now by clicking the \"Apply\" button.<p><br></p>\n      </div>"]},
{"title": ["DevSecOps Engineer (Remote)"], "location": ["\n              United States\n            "], "company_name": ["\n                Planned Systems International\n              "], "position_name": ["DevSecOps Engineer (Remote)"], "experience_required": ["\n            Mid-Senior level\n          "], "contract_type": ["\n          Full-time\n        "], "function_name": ["\n            Engineering and Information Technology\n          "], "company_sector": ["\n          IT Services and IT Consulting, Software Development, and Computer and Network Security\n          "], "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p><strong>Essential Functions and Job Responsibilities:</strong></p><ul><li>Design, build and test scripts in native and tool-dependent languages for continuous integration, continuous delivery (CI/CD) pipeline to limit manual testing and troubleshooting.</li><li>Lead the development of an automated framework for Security Tool deployment and development, leveraging various scripting languages and open source solutions.</li><li>Using Security-as-Code principles, build templates to automate security vulnerabilities and suggest and implement proper alternatives.</li><li>Maintain interfaces with outside systems, analyze downtimes, analyze proposed system modifications, upgrades and identification of new commercial off the shelf software.</li><li>Identify issues with current software then develop system requirements and program specifications to upgrade or improve existing software.</li><li>Coordinate closely with programmers to ensure proper implementation of program and system specifications and requirements.</li><li>Architect and design API Security, Container Security, or Azure Cloud Security.</li><li>Apply security to cloud technologies (Managing secrets, Securing CD pipeline, Secure Infrastructure as Code, Container Security etc.).</li><li>Build and maintain monitoring, auditing, and reporting frameworks that produce artifacts supporting security and compliance needs.</li><li>Implement security features and monitoring tools, performing periodic security and code quality assessments.</li></ul><p><strong>Minimum Requirements:</strong></p><ul><li>Must be able to work in a distributed team environment able to quickly respond in a dynamic environment; strong organizational and time management skills including multi-tasking and prioritizing job duties.</li><li>3+ years of experience in software engineering/software development, including Web apps and technologies.</li><li>1+ years of hands-on experience in implementing/maintaining CI/CD, security and data pipelines.</li><li>1+ years of public Cloud hands-on experience (AWS preferred) with a good understanding of scripting/programming. languages such as Python, C++, Java, Powershell.</li><li>Understanding of modern web technologies and relationships between them.</li><li>Linux, NGINX, DNS, Docker, TLS, GitLab, Artifactory.</li><li>1+ years of experience using SSH including managing and upgrading software and systems via SSH.</li><li>Strong knowledge of the Linux command line, patch management, and related information security functions (authentication, encryption, SSL, etc.).</li></ul><p><strong>Additional Desired Qualifications:</strong></p><ul><li>Military experience is a plus</li></ul>\n      </div>"]},
{"title": ["Software Engineer/Sr. Software Engineer (REMOTE)"], "location": ["\n              Cambridge, MA\n            "], "company_name": ["\n                Flagship Pioneering\n              "], "position_name": ["Software Engineer/Sr. Software Engineer (REMOTE)"], "experience_required": ["\n            Mid-Senior level\n          "], "contract_type": ["\n          Full-time\n        "], "function_name": ["\n            Engineering and Information Technology\n          "], "company_sector": ["\n          Research Services and Biotechnology Research\n          "], "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <strong>Software Engineer/Sr. Software Engineer: AI and Computational Biology Group<br><br></strong><strong>Who We Are<br><br></strong>Harbinger Health, a Flagship-founded company, is pioneering early cancer detection. Harbinger aims to detect cancer, at the earliest stages, to save lives. Our platform leverages proprietary biological insights and artificial intelligence to enable high-resolution, molecular views on cancer from blood. We are a highly dynamic, entrepreneurial, and innovation-driven organization seeking collaborative, passionate, and dedicated people to join our team.<br><br>Flagship Pioneering conceives, creates, resources, and develops first-in-category bioplatform companies to transform human health and sustainability. Since its launch in 2000, the firm has, through its Flagship Labs unit, applied its unique hypothesis-driven innovation process to originate and foster more than 100 scientific ventures, resulting in more than $200 billion in aggregate value. To date, Flagship has deployed over $2.5 billion in capital toward the founding and growth of its pioneering companies alongside more than $19 billion of follow-on investments from other institutions. The current Flagship ecosystem comprises 42 transformative companies, including Axcella Health (Nasdaq: AXLA), Codiak BioSciences (Nasdaq: CDAK) Denali Therapeutics (Nasdaq: DNLI), Evelo Biosciences (Nasdaq: EVLO), Foghorn Therapeutics (Nasdaq: FHTX), Indigo Ag, Kaleido Biosciences (Nasdaq: KLDO), Moderna (Nasdaq: MRNA), Omega Therapeutics (Nasdaq: OMGA), Rubius Therapeutics (Nasdaq: RUBY), Sana Biotechnology (Nasdaq: SANA), Seres Therapeutics (Nasdaq: MCRB), and Sigilon Therapeutics (Nasdaq: SGTX).<br><br><strong>Position Summary<br><br></strong>Harbinger Health is seeking a highly motivated and innovative software engineer to join our AI and Computational Biology group. The candidate will be responsible to design, create and maintain software architectures to support our AI &amp; Computational Biology work both in research and product development. No prior knowledge of computational biology or experience in biotech industry is required. The candidate will be working closely with data scientists, machine learning engineers, bioinformatics group, and assay group. The successful candidate should have strong experience in software engineering and be resourceful in cloud based solutions as well as high-performance computing. Additionally, the candidate should have strong communication skills, attention to details and ability to work both independently and in a strong team environment.<br><br><strong>Key Responsibilities<br></strong><ul><li>Execute full software development life cycle (SDLC)</li><li>Develop flowcharts, layouts and documentation to identify requirements and solutions</li><li>Write well-designed, testable code</li><li>Produce specifications and determine operational feasibility</li><li>Develop software verification plans and quality assurance procedures</li><li>Document and maintain software functionality</li><li>Troubleshoot, debug and upgrade existing systems</li><li>Deploy software on popular cloud solutions such as AWS</li><li>Create and maintain cloud database solutions</li><li>Work with data scientists and machine learning engineers and integrate their software components into a fully functional software system<br><br></li></ul><strong>Qualifications<br></strong><ul><li>BSc degree in Computer Science, Engineering with 5 years of experience or MSc degree with 3 years of experience</li><li>Ability to develop software in Python</li><li>Experience with test-driven development</li><li>Experience with building scalable systems</li><li>Ability to document requirements and specifications</li><li>Knowledge of relational databases, SQL and ORM technologies is a plus</li><li>Experience with developing and implementing cloud solutions on AWS platforms is a plus</li><li>Experience with workflow management systems such as Cromwell or Nextflow is a plus</li><li>Strong communication and collaboration skills<br><br></li></ul>Flagship Pioneering and our ecosystem companies are <strong>committed to equal employment opportunity</strong> regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status.<br><br><em><strong>Recruitment &amp; Staffing Agencies:</strong></em><em> Flagship Pioneering and its affiliated Flagship Lab companies (collectively, “FSP”) do not accept unsolicited resumes from any source other than candidates. The submission of unsolicited resumes by recruitment or staffing agencies to FSP or its employees is strictly prohibited unless contacted directly by Flagship Pioneering’s internal Talent Acquisition team. Any resume submitted by an agency in the absence of a signed agreement will automatically become the property of FSP, and FSP will not owe any referral or other fees with respect thereto.</em>\n      </div>"]},
{"title": ["Sr Software Engineer - Machine Learning"], "location": ["\n              Chattanooga, TN\n            "], "company_name": ["\n                U.S. Xpress, Inc.\n              "], "position_name": ["Sr Software Engineer - Machine Learning"], "experience_required": ["\n            Mid-Senior level\n          "], "contract_type": ["\n          Full-time\n        "], "function_name": ["\n            Engineering and Information Technology\n          "], "company_sector": ["\n          Truck Transportation\n          "], "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        CHATTANOOGA TN<p><br></p>Monday - Friday 8:00am - 5:00pm<p><br></p>Position open to remote: Yes<p><br></p><strong><u>Who We Are</u></strong><p><br></p><strong>Relentlessly Delivering Big Ideas.</strong> U.S. Xpress is one of the nation’s largest asset-based trucking companies. But the most valuable asset we offer isn’t tractors, trailers, or even our exclusive, cutting-edge technology. It’s the collective brainpower of thousands of visionaries and problem-solvers. Together, we are revolutionizing the transportation industry by providing innovative, custom solutions. And, here, we believe in the sanctity of a promise—both to our customers, and our people. When we focus our varied talents on reshaping the future of transportation, that’s what we call the <strong>POWER OF U.S. </strong><p><br></p><strong> Why U.S. Xpress? </strong><p><br></p>Right Role. Right Tools. Right People. We invest in our talent starting on day one. You will be provided with personal and professional development opportunities that complement your interests and encourage you to build a career you’re passionate about. Whether it is employee stock options, profit-sharing, 401K, professional development, or our competitive pay, we help prepare you for the future. Be part of an organization that values out-of-the-box thinking and rewards employees for going above and beyond. Curious about the other benefits of working with us? Check out other perks below!<p><br></p><ul><li>Medical, Dental and Vision</li><li>Unlimited Vacation</li><li>Paid Parental Leave</li><li>Tuition Reimbursement</li><li>On-site work out facility</li></ul><p><br></p><strong><u>What You’ll Do</u></strong><p><br></p>The Senior Software Engineer is responsible for building the tools that power our freight platform. You should have a passion for tackling hard problems. A veteran who knows how to get things done, and how-to future-proof our architecture and implementations to scale for years to come. You will play a pivotal role in shaping the definition, vision, design, roadmap and development of product features from beginning to end.<p><br></p><ul><li>Design, implement, test, deploy and maintain innovative software solutions to transform service performance, durability, cost, and security</li><li>Use software engineering best practices to ensure a high standard of quality for all the team deliverables</li><li>Write high quality distributed system software</li><li>Promote state of the art technology trends, standards, frameworks, and tooling</li><li>Manage your work using git, agile practices, and our CI/CD pipeline</li><li>Work in an agile, startup development environment, where you are always working on the most important stuff</li><li>Mentor, teach, and coach other engineers to improve their engineering skills and responsibilities</li><li>Partner with various teams to create a technical strategy and design for proposed product improvements and new features</li></ul><p><br></p><strong><u>What We’re Looking For</u></strong><p><br></p>Education<p><br></p><ul><li>Bachelor's degree in Computer Science, Engineering, Mathematics, or a related field.</li><li>Master’s Degree or PHD preferred.</li></ul><p><br></p><strong><u>Experience</u></strong><p><br></p><ul><li>Experience with a variety of modern programming languages (Java, JavaScript, Python, or C#).</li><li>5+ years of experience in the job offered or a related occupation must involve: designing and developing large-scale, distributed software applications, tools, systems and services using Java, Typescript, or Python and Object Oriented Design.</li><li>Experience developing with established frameworks such as Spring, Express, GraphQL.</li><li>Demonstrated ability to learn new technologies.</li><li>Experience developing large scale, complex software systems.</li><li>Excellence in communicating with users, team members, and stakeholders to describe product features, designs, and product strategy.</li><li>Knowledge of professional software engineering practices and best practices for the full software development life cycle.</li><li>Experience with Kubernetes, Docker, Kafka, and Amazon Web Services is a plus.</li></ul><p><br></p><strong><u>Qualifications</u></strong><p><br></p><ul><li>Demonstrated ability to learn new technologies.</li><li>Experience developing large scale, complex software systems.</li><li>Excellence in communicating with users, team members, and stakeholders to describe product features, designs and product strategy.</li><li>Knowledge of professional software engineering practices and best practices for the full software development life cycle.</li></ul><p><br></p>Experience for Machine Learning Software Engineer Candidates<p><br></p><ul><li>Expertise in machine learning frameworks like pandas, numpy, scikit-learn, pytorch, keras, tensorflow.</li><li>Experience with industry ML tools such as MLflow, AWS Sagemaker and DataRobot.</li><li>Deep technical knowledge and expertise in the following areas: supervised and unsupervised machine learning, recommender systems, deep learning, time series modeling, geospatial modeling.</li><li>3+ years of industry experience of applying machine learning in production at scale.</li><li>Demonstrated experience in designing, building, and deploying production quality machine learning models.</li></ul><p><br></p><strong><u>Work Environment / Physical Requirements – Normal Office Settings.</u></strong><p><br></p>This job description indicates the general nature and level of work expected for this position. It is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities. Employees performing this job may be asked to perform other duties as required and the responsibilities of the position may change. Reasonable accommodations will be made to enable individuals with disabilities to perform the essential functions.<p><br></p>U.S. Xpress is an Equal Opportunity Employer committed to creating and maintaining a diverse workforce.<p><br></p>\n      </div>"]},
{"title": ["API Developer"], "location": ["\n              United States\n            "], "company_name": ["\n                Illumination Works\n              "], "position_name": ["API Developer"], "experience_required": ["\n            Mid-Senior level\n          "], "contract_type": ["\n          Full-time\n        "], "function_name": ["\n            Information Technology and Engineering\n          "], "company_sector": ["\n          IT Services and IT Consulting\n          "], "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        <p>As an <strong>API Developer</strong>, you will design and develop REST APIs on a cloud-based architecture to support an enterprise tablet based application. You will be working with the client-side web and mobile developers to prototype and deliver a working production system.</p><p><br></p><p>The key responsibilities of an API Developer include:</p><ul><li>Define and own the technical implementation with the help of the team</li><li>API lifecycle release management</li><li>Work with Team and Product Owner to define the API product roadmap, strategy, and solutions</li><li>Able to lead architecture discussions and influence key decision-makers around deployment topologies, scaling, performance, and sizing</li><li>Work closely with technical architects and architecture governance technical team for solution development and design reviews</li><li>Design and implement API management, which would include API proxies, mashups, northbound and southbound security, rate limiting, analytics, and developer portals</li><li>Lead Capacity Planning and Management activities to be able to handle additional transactions in the future</li><li>Functional, regression, and load testing</li><li>Test script definition and management</li><li>Mentor teams for designing, implementing, testing, and deploying the APIs using the latest technologies and best practices in the market</li><li>Understand and communicate risks, issues, challenges, and status/progress of the project</li><li>Experience architecting and developing software for scalable, distributed systems</li><li>Familiarity with middleware and Azure cloud technologies mobile app development</li></ul><p> </p><p><strong>Do you have what it takes? </strong>Are you driven to implement creative solutions that unravel complex and ever-changing challenges? We value passion, curiosity, and perseverance with an ability to communicate ideas and results to diverse audiences. We look for people who thrive in collaborative and independent assignments, have the aptitude to learn new data quickly, and who are willing to mentor junior team members. Key skills we look for include:</p><p><br></p><ul><li>US citizenship required </li><li>Must have played a leadership role in API Web and SOA, ESB, Integration implementations</li><li>Experience in SOA design and implementation and solution integration</li><li>Excellent knowledge of RESTful web services and related technologies and protocols: JSON, HTTP/HTTPS, OAuth, JWT, OpenID, TLS</li><li>Working knowledge of securing web services</li><li>Experience developing APIs for mobile and tablet applications</li><li>4+ years development experience with Java</li><li>4+ years development experience with JavaScript and/or Typescript</li><li>Experience with Node.js</li><li>Experience building and delivering Proof of Concepts independently and effectively</li><li>Working knowledge of cloud (GCP/AWS/Azure)</li><li>Excellent communication and presentation skills</li></ul><p><br></p><p><strong>Location and Travel Details: </strong>Cincinnati, OH, or remote</p><p><br></p><p><strong>A little more about us.</strong> At Illumination Works, we know data, and we should, we’ve been doing it since we started in 2006! We specialize in everything data from big data to data science, software ​engineering, data management, ​AR/IoT, and cloud development. Illumination Works is a trusted technology partner in user-centered digital transformation—delivering impactful business results to clients. We partner with ​customers to solve their unique technology and data challenges​, and stay on top of modern technologies ​and advancements leveraging our ​Innovation Lab. ​</p><p><br></p><p><strong>Why choose us?</strong> We invest in our employees in all aspects of their life and we value family. We offer market competitive salary, a generous PTO package, and comprehensive medical, dental, vision and life insurance plans. We also offer 401K, short/long-term disability insurance, a fun and engaging culture, and training opportunities to keep you up to speed on the latest technologies. </p><p><br></p><p><em>Illumination Works is committed to hiring and retaining a diverse workforce. We are an Equal Opportunity Employer, making decisions without regard to race, color, religion, sexual orientation, gender identity or national origin, age, veteran status, disability, or any other protected class. Acceptable candidates must successfully pass a drug test and background screen.</em></p>\n      </div>"]},
{"title": ["Senior Field Engineer"], "location": ["\n              United States\n            "], "company_name": ["\n                Domino Data Lab\n              "], "position_name": ["Senior Field Engineer"], "experience_required": ["\n            Mid-Senior level\n          "], "contract_type": ["\n          Full-time\n        "], "function_name": ["\n            Engineering and Information Technology\n          "], "company_sector": ["\n          Software Development\n          "], "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        At Domino Data Lab, we have an ambitious vision for data science. Our platform helps data science teams accelerate research, increase collaboration, and rapidly deploy predictive models. Our customers are the most sophisticated analytical organizations in the world, including companies like Bristol Myers Squibb, Allstate, Bayer, and Red Hat. Backed by Sequoia Capital, Coatue Management, Bloomberg Beta, and Zetta Venture Partners, we are at the epicenter of the data science revolution, helping companies develop the next breakthrough in medicine, build better cars, or recommend the best song play next.<p><br></p><strong><u>What We Are Building</u></strong><p><br></p>Customer Success Engineers (known internally as \"Field Engineers\") are an elite team who help data science teams turn their companies into model driven organizations. We train users, advise our customers on how to integrate their use cases on Domino, re-develop team processes, integrate data sources, and customize tools. By joining our team, you’ll work with top-tier data science teams at some of the most advanced companies across industries, including Finance &amp; Insurance, Pharmaceuticals &amp; Life Science, Aerospace &amp; Defense, and more. We have an incredible and diverse team, having a wide range of experiences across industries and academia, that will challenge and enable you to learn new skills that will take your career to the next stage.<p><br></p>As a Customer Success Engineer, one day you might be helping a marketing company starting to work with satellite images or an insurance company get money to their customers faster by integrating NLP into their claims processing. The next day, you might be training a room full of new users or working with an individual data scientist to help them get the most out of Domino. Our Customer Success Engineering team encounters a diversity of technical challenges and opportunities within each Domino customer's account, allowing you to get a firsthand look at what technologies the most innovative organizations are using.<p><br></p><strong><u>What Your Impact Will Be</u></strong><p><br></p><ul><li>Responsible for working with Domino’s most strategic customers to ensure their success</li><li>Build integrations to support custom/advanced data science workflows and how they integrate with the Domino API</li><li>Play an advisory role to our customers to help leverage Domino and data science best practices</li><li>Actively commit to our knowledge base to evolve the way customer success operates at Domino</li><li>Help evolve the way Domino deploys and maintains our software by being in constant communication with core development</li></ul><p><br></p><strong><u>What We Look For In This Role</u></strong><p><br></p><ul><li>Excellent troubleshooting skills</li><li>Strong interpersonal and communication skills</li><li>Willingness to travel up to 10% of the time*</li><li>Deep experience with system architecture, both cloud (AWS, Azure, or GCP) and on-prem environments.</li><li>Programming experience (Python or R preferred)</li><li>Knowledge of data science workflows</li><li>Hands-on DevOps experience in Docker and Kubernetes required</li><li>Understanding of data integrations and data pipelining tools</li><li>Previous working and troubleshooting experience with distributed computing frameworks such as: Spark, Hadoop, Dask, etc.</li></ul><p><br></p><strong><u>What We Value</u></strong><p><br></p><ul><li>We strongly believe in the value of growing a diverse team and encourage people of all backgrounds, genders, ethnicities, abilities, and sexual orientations to apply</li><li>We value a growth mindset. High-performing creative individuals who dig into problems and see the opportunities for success</li><li>We believe in individuals who seek truth and speak the truth and can be their whole selves at work </li><li>We value all of you that believe improving is always possible. At Domino, everything is a work in progress – we can do better at everything</li><li>We emphasize an environment of teaching and learning to equip employees with the tools needed to be successful in their function and the company</li></ul><p><br></p><em><strong>Compensation range</strong></em><p><br></p><em>Based on pay transparency guidelines, a reasonable expectation for the salary range for this role is $152,000-207,000 USD Annually. Information on our competitive total rewards package, including our benefits can be found here. Individual salaries are determined by evaluating a variety of factors including geography, cost of labor, experience, skills, education, and internal equity.</em>\n      </div>"]},
{"title": ["Remote - Lead Software Engineer: DevOps, Azure, Python, Docker"], "location": ["\n              Chicago, IL\n            "], "company_name": ["\n                CyberCoders\n              "], "position_name": ["Remote - Lead Software Engineer: DevOps, Azure, Python, Docker"], "experience_required": ["\n            Mid-Senior level\n          "], "contract_type": ["\n          Full-time\n        "], "function_name": ["\n            Engineering\n          "], "company_sector": ["\n          Software Development\n          "], "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\">\n        Are you a Senior, DevOps / Software Engineer searching for an explosive growth opportunity in AI and ML that is 100% Remote and offers you full benefits, equity and unlimited PTO?<br><br>We are a highly technical, collaborative, start-up in predictive analytics that provides companies with dynamic infrastructure updates that rapidly, continuously improve operations efficiencies and we are well on our way to becoming a multi-billion dollar success with multiple global, household names on our current client roster.<br><br>What You Will Be Doing<br><br>Assume a key technical role as Lead DevOps Architect deploying implementations of our product both on Cloud and on-prem for our clients.<br><br>Contributing your own innovative ideas and solutions as an integral member of our multidisciplinary engineering team which includes software engineers, data scientists and other IT Operations members.<br><br>Provide hands-on technical support with clients.<br><br>What You Need for this Position<br><br>Bachelor's degree or greater in a related engineering discipline<br><br>Background in Software Engineering<br><br>3+ most recent years in DevOps including Cloud implementation experience with Azure<br><br>Scripting skills in Python and Bash<br><br>3+ years of Docker, Linux and Postgres<br><br><strong><u>Experience With<br><br></u></strong>Grafana, Elasticsearch, GitLab<br><br><strong><u>Also Helpful<br><br></u></strong>Experience with: Java, Javascript, C#, C++, Powershell or Groovy<br><br>What's In It for You<br><ul><li> 100% REMOTE Work from Home anywhere in the U.S.</li><li> Unlimited PTO /Vacation</li><li> Medical, Dental, Vision: 80% Employer paid premiums for the employee/ 50% for dependents, multiple plans to select from</li><li> 401(k)</li><li> Equity</li><li> Life Insurance<br></li></ul><strong><u>Benefits<br></u></strong><ul><li> Vacation/PTO: Unlimited PTO</li><li> Medical: 80% Employer paid premiums for the employee/ 50% for dependents, multiple plans to select from</li><li> Dental</li><li> Vision</li><li> 401k</li><li> 100% REMOTE Work from Home</li><li> Equity</li><li> Life Insurance<br></li></ul>So, if you are a DevOps Architect looking for an explosive growth opportunity that offers EQUITY and is 100% Remote, Apply Now!<br><br>Colorado employees will receive paid sick leave. For additional information about available benefits, please contact Brooke Rinaldi<br><br><strong><u>Email Your Resume In Word To<br><br></u></strong>Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:<br><br>Brooke.Rinaldi@CyberCoders.com<br><ul><li>Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : BR-1713001 -- in the email subject line for your application to be considered.***<br></li></ul>Brooke Rinaldi - Principal Recruiter - CyberCoders<br><br>Applicants must be authorized to work in the U.S.<br><br><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer<br><br></strong>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.<br><br><strong>Your Right to Work</strong> – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.<br><br>\n      </div>"]}
]