[
{"title": "Acoustic Machine Learning Engineer", "location": "Santa Clara, CA", "company_name": "MindSource", "position_name": "Acoustic Machine Learning Engineer", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Engineering", "company_sector": "Computers and Electronics Manufacturing", "description": "Role: Acoustic Machine Learning EngineerLocation: Santa Clara Valley, CADuration: 12 monthsContract Type: W2Description:The primary activity of the Acoustic Technologist is to develop signal processing techniques to extract and enhance acoustic signals inside and outside on the audible range. Candidate in this role will be working with various sensor extracted signals to combine information for processing and analysis. Activities will include (but not be limited to) pre-processing, prototyping &amp; evaluation of DSP/acoustic features for signal extraction, algorithm prototyping. You will work with multi-functional teams to optimize and improve algorithms across various sensors and prototypes.In this role you will be able to experiment with sensor fusion methods to design the optimal signal processing chain for maximizing performance.Key Qualifications:Experience working with audio signal processing, signal extraction, time-frequency analysis, and algorithm prototyping/development.Experience working with acoustic feature extraction and machine learning models.Experience working with time series analysis of unstructured data.Good understanding of DSP and filtering techniques. e.g band pass filtering, wavelet transform, FFT analysis etc.Proficiency with acoustic measurements of speakers and microphonesProficiency in Matlab, Python, Max-MSP toolsUnderstanding of physical/room acoustics is a plus.C++ coding skills are a plus.Experience shipping high-complexity, high-volume consumer electronics is desired.Education &amp; Experience: Most of our engineers have advanced degrees in Electrical engineering, Acoustics, Signal Processing, Electronics, or an equivalent field, but if you’ve followed a different path to expertise in acoustics or sound quality, we still want to hear from you.Interested candidates please send your latest resume to sarath@mindsource.com", "link": "https://www.linkedin.com/jobs/view/3452569410"},
{"title": "Associate Software Engineer", "location": "Wilmington, DE", "company_name": "Pinnacle Group, Inc.", "position_name": "Associate Software Engineer", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Engineering and Information Technology", "company_sector": "IT Services and IT Consulting", "description": "Job Title: Associate Software EngineerLocation: Wilmington, DE OR Jersey City, NJ 07310 OR New York, NY OR Chicago, IL OR Plano, Austin, Houston, TX OR Tampa, FL (3 days onsite)Contract: Contract to HireRequired:• Expert in Java, Springboot/ Microservice and AWS design technique as well as experience working across large environments with multiple operating systems or infrastructure for large-scale programs (e.g., Expert Engineers) starting to be firm-wide resources working on projects across client• Is multi-skilled with expertise across software development lifecycle and toolset• May be recognized as a leader in Agile and cultivating teams working in Agile frameworks• Sought out as coach for at least one technical skill• Strong understanding of techniques such as Continuous Integration, Continuous Delivery, Test• Driven Development, Cloud Development, resiliency, security• Stays abreast of cutting edge technologies or trends and uses experience to influence application of those technologies or trends to support the business; may give speeches and outside the firm, writes articles.Pay Range: $42 - $50 W2The specific compensation for this position will be determined by a number of factors, including the scope, complexity and location of the role as well as the cost of labor in the market; the skills, education, training, credentials and experience of the candidate; and other conditions of employment. Our full-time consultants have access to benefits including medical, dental, vision as well as 401K contributions.", "link": "https://www.linkedin.com/jobs/view/3458396046"},
{"title": "Embedded Engineer", "location": "United States", "company_name": "Net2Source Inc.", "position_name": "Embedded Engineer", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Engineering and Information Technology", "company_sector": "Medical Equipment Manufacturing, Biotechnology Research, and Pharmaceutical Manufacturing", "description": "Position: Engr 3, Software Embedded Location: 100% RemoteDuration: 12+ Months (Extendable) Pay Rate: $63.77/hr on W2.  Must Have requirements:• Significant experience on Embedded Software Design and Development (NOT application software)• Hands on experience developing embedded software in C• Real-Time operating systems (RTOS) such as ThreadX, Free RTOS etc Description:This position is a technical position working in the embedded software/firmware development work streams. The individual would have responsibility for working cross-functionally to understand end-user needs and system requirements and mapping them to detailed embedded software and electrical design specifications and translating these into robust architecture and design elements.The responsibilities can include, but are not limited to: embedded software design &amp; implementation, design for critical features and functions, enabling implementation of features as part of a multi-disciplinary R&amp;D team (systems, electrical, mechanical and application software). Integrating and verifying implemented features through unit and functional testing.Typically, the embedded engineer will interface with other development teams for product integration and will interface both internally and externally to understand the clinical use cases, usability and system requirements. Minimum Qualifications:• Bachelor’s Degree in Electrical Engineering, Physics, Computer Engineering, software engineering or similar.• A minimum of 6 years of post-educational professional experience, with focus on Embedded Software Development, Board design and development.• Hands on experience developing embedded software in C and programming knowledge of Real-Time operating systems such as ThreadX, Micrium etc. is required• Hands on experience developing embedded UI/UX Desired Qualifications:• Master’s Degree in Electrical Engineering, Physics, Computer Engineering,or software engineering.• Experience working with graphical displays• 6+ years of professional experience in the medical device industry.• Experience programming Arm Cortex M4, M7, or similar microcontrollers• Previous experience with medical device embedded software and electrical design efforts.• Experience developing low level device drivers for hardware peripheral interfaces and devices such as SPI, I2C, USB, LCD, ADC, DAC, RFIC• Experience in a structured development environment with source control and bug tracking systems• Knowledgeable in hardware/software interfaces, programming of embedded processor utilizing a Real Time Operating System (RTOS), real-time and post processing data analytics,• Experience with software quality assurance to include unit and integration test development and execution, and code inspection and reviews.• Experience with digital and analog circuits, microprocessor hardware and software and development environments• Experience generating technical documentation and authoring internal/external publications• Experience reading and understanding schematic designs and Electrical components reference manuals• Working knowledge of applicable standards for medical devices: FDA QSR, ISO 13485, ISO 14971, IEC 62304.", "link": "https://www.linkedin.com/jobs/view/3454369920"},
{"title": "Senior Data Engineer", "location": "United States", "company_name": "BICP", "position_name": "Senior Data Engineer", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Information Technology", "company_sector": "IT Services and IT Consulting", "description": "BICP, a leader in the delivery of innovative cloud ecosystems &amp; advanced analytics data products for large enterprise customers, is looking to hire a Sr. Data Engineer to be a leader in our Data Products Delivery team embedded at a Fortune 100 retail client in Beaverton, Oregon. You will work with Engineering leadership to support a high visibility, greenfield implementation, working with critical business data delivering end-to-end data solutions. We are looking to hire a candidate with strong Data Engineering expertise to help build a solution integrating data from multiple legacy data sources into a new cloud-based data ecosystem. Senior Data Engineer should have experience with a variety of technologies including AWS, S3, Databricks, Snowflake, PySpark among others.You be involved with the technical architecture discussions and partner with leadership to help design and implement a new big data platform and business analytics solutions to empower stakeholders to meet data-driven analytics and reporting needs. You will help with design and deploy appropriate data architecture, data pipelines, reporting, dashboarding, data exploration, quality controls to enable self-service analytics for highly critical business data. What you will support:Build and deploy data pipelines to integrate data from a variety of data sources into new data foundation (AWS, S3, Databricks, Airflow etc.)Will work closely with product and analytics organizations, contributing to the design and implementation of data solutions. Proposes, guides, and builds data ecosystem solutionsPlays a leader role within the broader Data Foundation teamContinuously works to optimize and improve data velocity and accuracyDevelops and shares materials and documentation related to new data foundationWhat you bring to the table:1+ years hands-on with AWS and be familiar with enterprise data best practices and solutions.2+ years of experience working on ETL, data modeling, business intelligence architecture1+ years working with Databricks, Snowflake a big plus but not required1+ years experience working with PySparkDemonstrated success working with stakeholders and implementing end-to-end data solutions including data model, data pipelines and Business Intelligence products to solve complex business requirements.Prior experience in designing and implementing DW Architectures, OLAP technologies, Star-schema, Snowflake schema and Aggregation TechniquesAdvanced SQL and programming experience with at least one language such as Python, Scala, Java, C++ highly desiredExperience with agile delivery methodologies– Scrum, SAFe, etc. About BICPBICP is a consulting firm focused on delivering innovative Analytics + Hyperscale platform solutions to our customers. With deep experience across a diverse ecosystem analytical products and cloud-based platforms we have the required product ambiguity and expertise to deliver best in breed solutions tailored to our client’s critical business data needs.BICP is an Equal Opportunity Employer and does not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class.", "link": "https://www.linkedin.com/jobs/view/3422182106"},
{"title": "Software Engineer", "location": "Boston, MA", "company_name": "Insight Global", "position_name": "Software Engineer", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Engineering", "company_sector": "Computer and Network Security", "description": "Summary: As a Software Engineer you will work with R&amp;D teams working on core technologies for VR/AR and the Metaverse, on bringing up data processing pipelines and Computer Vision tools to better measure performance in large-scale and accelerate internal development of new features. Location Services team's north star is to build the accurate and battery efficient positioning platform across FRL devices that provides lat, lon, and altitude prediction anywhere in the world. Our north star serve as the foundation of location-based experiences, especially world AR, for Reality Labs devices. Imagine a user wearing AR glasses walks down the street, we provide position tracking function to enable world locked AR experience. When location based reminder is set (e.g., remind me of my shopping list at the grocery store), we provide geofence function to trigger the callback at the right time &amp; right place. To enable the above functionalities, we build the location prediction model/algorithms using mobile signals (e.g., GPS, WiFi, BLE, accelerometer, barometer, etc) and the infrastructure that enables realtime prediction. In particular, location services team are investing in the following areas: Location SDKs on wearables (e.g., Orion/Milan) to unblock location-based experiences. GeoAnchor APIs in Spark AR platform to enable world AR experiences. Cloud wireless positioning services (WPS) for world-scale FR-based location prediction using signals such as ambient WiFi/cell bluetooth. Minimum qualifications: - BSc in Computer Science, Software Engineering, Electrical Engineering or similar - At least 4 years of experience as SW engineer - 4+ years of experience in iOS or Android Development - Good verbal/written communication skills in english - Team player Must Have Qualifications: - Experience in C++ and Java - Experience with full stack development - Cross-platform (Android and iOS) - Experience with GPS, WiFi, BLE, accelerometer, etc", "link": "https://www.linkedin.com/jobs/view/3453595331"},
{"title": "React Native full stack developer", "location": "United States", "company_name": "TA Digital", "position_name": "React Native full stack developer", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Engineering and Information Technology", "company_sector": "IT Services and IT Consulting", "description": "Role: React native full stack Developer Location: REMOTEExperience- 6 to 12 yearsDescription:Bachelor's degree in Computer Science or related field The Full Stack Developer codes software applications based on business requirements. Work assignments will involve moderately complex to complex issues where the analysis of situations or data requires an in-depth evaluation of variable factors. The Full Stack Developer will develop fully fledged platforms which do not need other applications to function.  Job Description We are looking for a Full Stack Developer to produce scalable software solutions. You’ll be part of a cross-functional team that’s responsible for the full software development life cycle, from conception to deployment. As a Full Stack Developer, you should be comfortable around both front-end and back-end coding languages, development frameworks and third-party libraries. You should also be a team player with a knack for visual design and utility.  • Work with development teams and product managers to ideate software solutions • Build the front-end of applications through appealing visual design • Write effective APIs • Test software to ensure responsiveness and efficiency • Troubleshoot, debug and upgrade software • Create security and data protection settings • Build features and applications with a mobile responsive design • Write technical documentation • Work in a Scrum/Agile type environment and deliver upon assigned work in a timely manner over the course of an iterative project time-table. • Be available for execution or support of production turns. • Provide expertise to influence project, initiative, and maintenance technical direction during discovery, planning, and implementation stages. • Maintain modern development standards with best-practice approaches and development processes.  Requirements • HTML, CSS, JavaScript, jQuery • C#, .NET (Required) • Angular, React or Vue.js with Cloud experience • React native(Required)• Typescript (Required) • NPM/Node.js (Advanced) • SASS • W3C Web Standards • Accessibility • Web performance • Cross-browser compatibility • Content Management • Advanced understanding of modular design patterns • Content Management (advanced experience and best-practices) • Technical writing/communication skills • Unit and Experience Testing (Advanced) • Webpack (Advanced)", "link": "https://www.linkedin.com/jobs/view/3458430191"},
{"title": "Scientist", "location": "Durham, NC", "company_name": "Actalent", "position_name": "Scientist", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Research, Analyst, and Information Technology", "company_sector": "Business Consulting and Services", "description": "Our client, a biotechnology organization focuses on early cancer detection is focused on developing pioneering technology to detect and identify multipe deadly cancer types early. Through the utilization of next-generation sequencing, population-scale clinical studies, and state-of-the-art computer science and data science to enhance the scientific understanding of cancer biology, and to develop its multi-cancer early detection blood test. They are currently seeing scientist level individuals to assist in the development of the 3rd version of their proprietary assay.Skills:*Molecular biologyAutomated testingLiquid handlingBiologyAdditional Skills &amp; Qualifications:*AS or BS, MS, PhD Degree 2 - 5 years of industry experienceHigh throughput setting utilizing automated liquid handling robots - BioMek, Hamilton, TecanHigh attention to detailCritical thinking skillsAbility to handle ambiguityProblem solving skillsExperience Level:* Intermediate LevelAbout Actalent:Actalent connects passion with purpose. Our scalable talent solutions and services capabilities drive value and results and provide the expertise to help our customers achieve more. Every day, our experts around the globe are making an impact. We’re supporting critical initiatives in engineering and sciences that advance how companies serve the world. Actalent promotes consultant care and engagement through experiences that enable continuous development. Our people are the difference. Actalent is an operating company of Allegis Group, the global leader in talent solutions. The company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.", "link": "https://www.linkedin.com/jobs/view/3459430726"},
{"title": "Data Engineer", "location": "United States", "company_name": "SoftStandard Solutions", "position_name": "Data Engineer", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Information Technology", "company_sector": "IT Services and IT Consulting", "description": "Big Data Engineer Job DescriptionWe are looking to hire a talented big data engineer to develop and manage our company’s Big Data solutions. In this role, you will be required to design and implement Big Data tools and frameworks, implement ELT processes, collaborate with development teams, build cloud platforms, and maintain the production system.To ensure success as a big data engineer, you should have in-depth knowledge of Hadoop technologies, excellent project management skills, and high-level problem-solving skills. A top-notch Big Data Engineer understands the needs of the company and institutes scalable data solutions for its current and future needs.Big Data Engineer Responsibilities:Meeting with managers to determine the company’s Big Data needs.Developing Hadoop systems.Loading disparate data sets and conducting pre-processing services using Hive or Pig.Finalizing the scope of the system and delivering Big Data solutions.Managing the communications between the internal system and the survey vendor.Collaborating with the software research and development teams.Building cloud platforms for the development of company applications.Maintaining production systems.Training staff on data resource management.Big Data Engineer Requirements:Bachelor’s degree in computer engineering or computer science.Previous experience as a big data engineer.In-depth knowledge of Hadoop, Spark, and similar frameworks.Knowledge of scripting languages including Java, C++, Linux, Ruby, PHP, Python, and R.Knowledge of NoSQL and RDBMS databases including Redis and MongoDB.Familiarity with Mesos, AWS, and Docker tools.Excellent project management skills.Good communication skills.Ability to solve complex networking, data, and software issues.", "link": "https://www.linkedin.com/jobs/view/3454142033"},
{"title": "Scientist", "location": "Durham, NC", "company_name": "Actalent", "position_name": "Scientist", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Research, Analyst, and Information Technology", "company_sector": "Business Consulting and Services", "description": "Description:* Our client, a biotechnology organization focuses on early cancer detection is focused on developing pioneering technology to detect and identify multipe deadly cancer types early. Through the utilization of next-generation sequencing, population-scale clinical studies, and state-of-the-art computer science and data science to enhance the scientific understanding of cancer biology, and to develop its multi-cancer early detection blood test. They are currently seeing scientist level individuals to assist in the development of the 3rd version of their proprietary assay. *Skills:* Molecular biology Automated testing Liquid handling *Additional Skills &amp; Qualifications:* AS or BS, MS, PhD Degree in a Scientific Field 2 - 5 years of industry experience High throughput setting utilizing automated liquid handling robots - BioMek, Hamilton, Tecan High attention to detail Critical thinking skills Ability to handle ambiguity Problem solving skillsAbout Actalent:Actalent connects passion with purpose. Our scalable talent solutions and services capabilities drive value and results and provide the expertise to help our customers achieve more. Every day, our experts around the globe are making an impact. We’re supporting critical initiatives in engineering and sciences that advance how companies serve the world. Actalent promotes consultant care and engagement through experiences that enable continuous development. Our people are the difference. Actalent is an operating company of Allegis Group, the global leader in talent solutions. The company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.", "link": "https://www.linkedin.com/jobs/view/3459434548"},
{"title": "CAE Engineer L2", "location": "Raymond, OH", "company_name": "Altair", "position_name": "CAE Engineer L2", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Engineering and Information Technology", "company_sector": "Software Development", "description": "Transforming the Future with Convergence of Simulation and Data CAE Engineer L2Job SummaryOur client in Raymond, OH is looking for a CAE Engineer L2. This is a contract position.What You Will DoCandidate will purchase at the most favorable price consistent with quality, quantity, delivery and other factors, raw materials, equipment, machinery, components and supplies for development and business operations.BasicsRequires a BS degree in Business Administration or related degree.Minimum of 5 years experience or equivalent combination of education and experience.Experience with CAD drawings including knowledge of Automotive and Proto-Type parts.Proficient PC Skills (Excel, Word, PowerPoint and other technical software) and excellent communication/interpersonal skills. SAP Experience.How You Will Be Successful Envision the Future  Communicate Honestly and Broadly  Seek Technology and Business “First”  Embrace Diversity and Take Risks What We Offer Competitive Salary  Comprehensive Benefit Package  401(k) with matching contributions  Paid Time Off  Employee Discounts  Free training on all Altair products Why Work With UsAltair is a global technology company providing software and cloud solutions in the areas of data analytics, product development, and high-performance computing (HPC). Altair enables organizations in nearly every industry to compete more effectively in a connected world, while creating a more sustainable future. With more than 3,000 engineers, scientists, and creative thinkers in 25 countries, we help solve our customer’s toughest challenges and deliver unparalleled service, helping the innovators innovate, drive better decisions, and turn today’s problems into tomorrow’s opportunities. Our vision is to transform customer decision making with data analytics, simulation, and high-performance computing. For more than 30 years, we have been helping our customers integrate electronics and controls with mechanical design to expand product value, develop AI, simulation and data-driven digital twins to drive better decisions, and deliver advanced HPC and cloud solutions to support unlimited idea exploration. To learn more, please visit altair.com Ready to go? #ONLYFORWARD At our core we are explorers; adventures; pioneers. We are the brains behind some of the world’s most revolutionary innovations and are not only comfortable in new and unchartered waters, we dive headfirst. We are the original trailblazers that make the impossible possible, discovering new solutions to our customer’s toughest challenges.Altair is an equal opportunity employer. Our backgrounds are diverse, and every member of our global team is critical to our success. Altair’s history demonstrations a belief that empowering each individual authentic voice reinforces a culture that thrives because of the uniqueness among our team.", "link": "https://www.linkedin.com/jobs/view/3454054544"},
{"title": "IBM API Connect - 100% Remote", "location": "United States", "company_name": "System Soft Technologies", "position_name": "IBM API Connect - 100% Remote", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Information Technology", "company_sector": "IT Services and IT Consulting", "description": "100 % Remote Responsibilities Should be able to Analyse business requirements and convert them into Technical and/or Functional requirementsTakes a lead role in collaborating with customers, business analysts, partners, and IT team members to understand business requirements that drive the analysis and design of quality technical solutionsConcentrates on providing innovative solutions to more complex business needsREST API Design, Concept of REST, How to define Resources, HTTP Methods and respected functions on RESTSet up and configuration of Toolkit, Install Toolkit, User Management like User,Group, RolesCreating API definitions, Composing REST API, Defining API with REST Services, Creating a LoopBack applications, Data sources with connectors QualificationsMUST HAVES: (4+ years relevant experience on IBM API Connect)Middleware technologies - IIBMust have the ability to Review design and code to verify that theyadhere to Technology Services operational principlesMinimum 2 4 years of experience in IBM APICKnowledge of IBM API Component, Development Toolkit, APIGateway, API Connect terminologyShould have good communication and analytical skills", "link": "https://www.linkedin.com/jobs/view/3454822871"},
{"title": "Denodo Developer- Remote", "location": "United States", "company_name": "System Soft Technologies", "position_name": "Denodo Developer- Remote", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Human Resources", "company_sector": "IT Services and IT Consulting", "description": "100 % Remote Strong Denodo development. Some admin would be a plus, Prefer GraphQL, API experience, Cloud (GCP), Java, Springboot, SQL and Views. Act as Denodo SME when neededAnalyzing the existing API, business logic, decode SQL/Views, identify database, tables and fields, Request and Response attributes.Build and develop the future state of API’s to consume the data from Cloud GCP.", "link": "https://www.linkedin.com/jobs/view/3454826185"},
{"title": "Scientist", "location": "Durham, NC", "company_name": "Actalent", "position_name": "Scientist", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Research, Analyst, and Information Technology", "company_sector": "Business Consulting and Services", "description": "Description:* Our client, a biotechnology organization focuses on early cancer detection is focused on developing pioneering technology to detect and identify multipe deadly cancer types early. Through the utilization of next-generation sequencing, population-scale clinical studies, and state-of-the-art computer science and data science to enhance the scientific understanding of cancer biology, and to develop its multi-cancer early detection blood test. They are currently seeing scientist level individuals to assist in the development of the 3rd version of their proprietary assay.Skills:* Molecular biology, automated testing, liquid handling, biology, laboratory, developmentTop Skills Details:* Molecular biology,automated testing,liquid handlingAdditional Skills &amp; Qualifications:* AS or BS, MS, PhD Degree 2 - 5 years of industry experienceMUST HAVE-*High throughput setting utilizing automated liquid handling robots - BioMek, Hamilton, Tecan High attention to detail Critical thinking skills Ability to handle ambiguity Problem solving skillsExperience Level:* Intermediate LevelAbout Actalent:Actalent connects passion with purpose. Our scalable talent solutions and services capabilities drive value and results and provide the expertise to help our customers achieve more. Every day, our experts around the globe are making an impact. We’re supporting critical initiatives in engineering and sciences that advance how companies serve the world. Actalent promotes consultant care and engagement through experiences that enable continuous development. Our people are the difference. Actalent is an operating company of Allegis Group, the global leader in talent solutions. The company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.", "link": "https://www.linkedin.com/jobs/view/3459435563"},
{"title": "DevOps Engineer", "location": "Wilmington, DE", "company_name": "Pinnacle Group, Inc.", "position_name": "DevOps Engineer", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Engineering and Information Technology", "company_sector": "IT Services and IT Consulting", "description": "Job Title: Devops EngineerLocation: Wilmington, DE (3 days onsite)Contract: Contract to HireRequired:Must have worked in AWS infra experienceTools: Use AWS Infrastructure, Terraform, EKS Kubernetes, DynamoDB, Amazon Aurora PostgreSQL, Route 53Top 3 Skill Sets1. Terraform 2. CI/CD Pipelines Infrastructure as a Code3. Upgrading Services and Blue GreenPay Range: $60 - $70 W2The specific compensation for this position will be determined by a number of factors, including the scope, complexity and location of the role as well as the cost of labor in the market; the skills, education, training, credentials and experience of the candidate; and other conditions of employment. Our full-time consultants have access to benefits including medical, dental, vision as well as 401K contributions.", "link": "https://www.linkedin.com/jobs/view/3458405862"},
{"title": "Ab Initio Developer", "location": "Little Rock, AR", "company_name": "Amtex Systems Inc.", "position_name": "Ab Initio Developer", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Engineering and Information Technology", "company_sector": "IT Services and IT Consulting", "description": "Title: Ab Initio DeveloperLocation: Little Rock, ARDuration: 12+ MonthsDuties: Job Summary Developer is responsible for developing, documenting, educating and articulating complex business requirements to support enterprise information initiatives, ranging from vision to implementation, strategy, development and tactical execution of objectives. Incumbent will contribute expertise in system analysis, design, coding, testing, debugging and documents the development of all lifecycle phases. Principal Responsibilities • Contributes to and supports the Enterprise strategic and operational planning process including total quality management philosophies. • Develops and implements processes to ensure accurate and effective workflow distribution. • Provides technical expertise of subsystems and any other performance related systems. • Enhances and applies programming analysis, design, coding, testing, debugging, implementation and documentation. • Consults with users to identify current operating procedures and to clarify project objectives. • Uses standard application design principles to create logical and physical application designs to promote efficiency and code reuse. • Develops applications and creates deliverables aligned with processes and enterprise standards. • Designs and develops high-volume, low-latency applications for mission-critical systems and delivers high-availability and performance applications. • Designs, testable code and develops test protocols or plans and reviews revisions and results.Skills: Education &amp; Experience: • Bachelor’s degree, in Business, Computer Science, or Management Information Systems, or related. In lieu of degree, at least five (5) years’ equivalent experience. • Three (3) years’ direct experience serving source systems and project teams for developing, documenting, educating and articulating complex business requirements to support strategic and tactical business needs. • Knowledge and experience with data gathering, program logic development, coding, testing and documentation, and Application Systems Programming Design and Analysis. Specialized Knowledge &amp; Skills: Technical skill set and working experience in Ab Initio, DB2, Unix, Snowflake, Azure, AWS services (ADLS, ADF/Data Bricks, etc..), Python, Java. Healthcare Domain knowledge and working experience is **preferred**Education: Bachelor’s degree, in Business, Computer Science, or Management Information Systems, or related.", "link": "https://www.linkedin.com/jobs/view/3456971529"},
{"title": "Senior Scala Engineer - 12 months remote contract", "location": "Austin, Texas Metropolitan Area", "company_name": "Signify Technology", "position_name": "Senior Scala Engineer - 12 months remote contract", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Engineering and Information Technology", "company_sector": "Staffing and Recruiting", "description": "Senior Scala Engineer - 12 months extendable contract - Fully remoteNOTE: WE CANNOT USE A THIRD PARTY AGENCIES FOR THIS. Wow, what a great opportunity this is! A very long term Scala project here, working for a global specialized manufacturing company who are looking to hire excellent engineers to help build out their platforms and services. A very exciting and new project centred around Scala, Akka (steams, actors), AWS, and large data sets. This would be a position for mid-senior level engineers and/or senior-lead level engineers. There are multiple positions available here!ResponsibilitiesYou will be writing clean and high performing code for services using Scala. You will be responsible for performing all programming responsibilities without being heavily micromanaged. You will drive development activities for business-critical applications and services. You will interact with internal and external users to be able to deliver efficient solutions, as well as make adjustments to existing services to optimize their performance/usage. Above all, you will work in a fun and collaborative working environment.Qualifications3+ years of professional work experience in ScalaExpertise in Akka, Akka Streams, Akka ActorsHeavy experience working with AWS or similar cloud environmentExcellent experience working with large data sets and structures", "link": "https://www.linkedin.com/jobs/view/3455346974"},
{"title": "Scientist - Molecular Biology", "location": "Durham, NC", "company_name": "Actalent", "position_name": "Scientist - Molecular Biology", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Research, Analyst, and Information Technology", "company_sector": "Business Consulting and Services", "description": "Our client, a biotechnology organization focuses on early cancer detection is focused on developing pioneering technology to detect and identify multipe deadly cancer types early. Through the utilization of next-generation sequencing, population-scale clinical studies, and state-of-the-art computer science and data science to enhance the scientific understanding of cancer biology, and to develop its multi-cancer early detection blood test. They are currently seeing scientist level individuals to assist in the development of the 3rd version of their proprietary assay.Skills:*Molecular biologyAutomated testingLiquid handlingBiologyAdditional Skills &amp; Qualifications:*AS or BS, MS, PhD Degree 2 - 5 years of industry experienceHigh throughput setting utilizing automated liquid handling robots - BioMek, Hamilton, TecanHigh attention to detailCritical thinking skillsAbility to handle ambiguityProblem solving skillsExperience Level:* Intermediate LevelAbout Actalent:Actalent connects passion with purpose. Our scalable talent solutions and services capabilities drive value and results and provide the expertise to help our customers achieve more. Every day, our experts around the globe are making an impact. We’re supporting critical initiatives in engineering and sciences that advance how companies serve the world. Actalent promotes consultant care and engagement through experiences that enable continuous development. Our people are the difference. Actalent is an operating company of Allegis Group, the global leader in talent solutions. The company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.", "link": "https://www.linkedin.com/jobs/view/3459444768"},
{"title": "Research Associate/Associate Scientist, Chemistry", "location": "Redwood City, CA", "company_name": "Actalent", "position_name": "Research Associate/Associate Scientist, Chemistry", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Research, Analyst, and Information Technology", "company_sector": "Business Consulting and Services", "description": "Description:* Our client is a clinical-stage precision oncology company focused on developing novel targeted therapies to inhibit high-value frontier targets in RAS-addicted cancers. The company’s R&amp;D pipeline comprises RAS(ON) Inhibitors designed to suppress diverse oncogenic variants of RAS proteins, and RAS Companion Inhibitors for use in combination treatment strategies. As a new member of the team, you will join other outstanding scientists in a tireless commitment to patients with cancers harboring mutations in the RAS signaling pathway.The Opportunity:* As a key member of the Medicinal Chemistry team, you will be part of an integrated, multidisciplinary research team making significant contributions toward the discovery of important new drug candidates. Your responsibilities will include:Synthesizing biologically active compounds, including the design and execution of the synthetic routes, purification of final targets, and participating in analog design.Plan and execute assigned experiments to support research activities and project goals.Recommend alternatives, research new methods and techniques through literature search and proactively seek out others to identify solutions to challenges.Present research findings to the Medicinal Chemistry team and management.Partner in the scientific activities of other outstanding medicinal chemists, including Ph.D. scientists, and create an environment where all ideas are heard.Uphold the core values at Revolution Medicines: i) tireless commitment to patients; ii) transformative science; iii) exceptional together; iv) total integrity; and v) inclusiveness and fairness.Skills Required:* Chemistry, medicinal chemistry, synthesis, HPLC, NMR, nmr spectroscopy, natural product synthesis, discovery chemistry, mass spectrometryAdditional Skills &amp; Qualifications:* Required Experience, Skills, and Education:B.S. degree in Chemistry with 1+ years of research experience in, or an M.S. in Chemistry with a focus on organic synthesis and/or methodology development.Strong mechanistic understanding of organic chemistry is highly preferred.Experience with chemistry search engines (i.e. SciFinder and Reaxyx) to design and plan synthetic routes is preferred but not a must.High attention to details, especially in NMR, HPLC, mass spectrometry techniques, is preferred.Experience with synthetic methodologies to design, execute synthetic procedures, and troubleshoot reactionsStrong written and verbal communication skills to work with interdepartmental teams.Ability to multi-task, be efficient and well-organized, and work collaboratively as a team player with passion for science.Adaptive to a fast-paced interdisciplinary environment with a strong desire to further develop synthetic and medicinal chemistry skills.About Actalent:Actalent connects passion with purpose. Our scalable talent solutions and services capabilities drive value and results and provide the expertise to help our customers achieve more. Every day, our experts around the globe are making an impact. We’re supporting critical initiatives in engineering and sciences that advance how companies serve the world. Actalent promotes consultant care and engagement through experiences that enable continuous development. Our people are the difference. Actalent is an operating company of Allegis Group, the global leader in talent solutions. The company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.", "link": "https://www.linkedin.com/jobs/view/3459440981"},
{"title": "Full Stack Developer", "location": "United States", "company_name": "Apex Systems", "position_name": "Full Stack Developer", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Information Technology, Engineering, and Project Management", "company_sector": "IT Services and IT Consulting, Retail, and Pharmaceutical Manufacturing", "description": "*This role is can NOT provide sponsorship or visa transfer at this time. You must be able to sit on a W-2.*Job DetailsFull Remote6 months contract to hire Pay range $65-$75 hourly Pharmaceutical and convenience industry Technical requirements:· 8+ years of overall IT experience· 2+ years of experience in one or more Typescript frontend frameworks (Angular 8+, React, etc.) - AngularJS experience is not counted· 4+ years of experience implementing REST services, ideally implemented with Java 11+ and SpringBoot· Some experience in deploying to a cloud platform (Kubernetes, PCF, GCP, Azure, AWS, etc.)· Some experience with TDD, in both frontend and backend technologies· Good written and verbal communication skills· Some experience with agile methodology and pair programming (XP, Scrum, etc.) - candidate must be willing to pair program· Familiar with CI/CD tools (e.g. Jenkins)· Familiar with maintaining and interacting with databases (Oracle, PostGres, etc.)· Capacity to lead a feature track· Familiar with software release management tools (Pivotal Tracker, JIRA, Rally, etc.)· Capability to mentor junior and mid-level engineer resources", "link": "https://www.linkedin.com/jobs/view/3453571351"},
{"title": "Informatica Developer", "location": "Charlotte Metro", "company_name": "Strategic Staffing Solutions", "position_name": "Informatica Developer", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Information Technology", "company_sector": "IT Services and IT Consulting and Retail", "description": "STRATEGIC STAFFING SOLUTIONS HAS AN OPENING!Strategic Staffing Solutions (S3) is currently looking for an Informatica Developer for a contract opening with one of our largest clients.Location: Charlotte, NC (On-Site or Fully Remote)Duration: 6+ MonthsRate: $60-65/hrTop Skills:TalendInformaticaHadoopMinimum Qualifications:Bachelor's Degree in Computer Science, CIS, or related field (or equivalent work experience in a related field) \\2 years of experience in software development or a related field2 years of experience in database technologies 1 year of experience working on project(s) involving the implementation of solutions applying development life cycles (SDLC)The S3 Difference:The global mission of S3 is to build trusting relationships and deliver solutions that positively impact our customers, our consultants, and our communities. The four pillars of our company are to:Set the bar high for what a company should doCreate jobsOffer people an opportunity to succeed and change their station in lifeImprove the communities where we live and work through volunteering and charitable giving As an S3 employee, you’re eligible for a full benefits package that may include:Medical InsuranceDental InsuranceVision Insurance401(k) PlanVacation PackageLife &amp; Disability Insurance PlansFlexible Spending AccountsTuition Reimbursement", "link": "https://www.linkedin.com/jobs/view/3459167142"},
{"title": "Full Stack Engineer", "location": "Pittsburgh, PA", "company_name": "Compunnel Inc.", "position_name": "Full Stack Engineer", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Information Technology", "company_sector": "IT Services and IT Consulting", "description": "Looking for Java Full Stack DeveloperLocation: Pittsburgh, PA - OnsiteLong term - Direct ClientOnly USC/GC/ GC EAD Job Description(Sample JD)Minimum of 10+ years of hands-on core Java and J2EE web application development experience.Solid understanding of object-oriented design, design patterns, and software development best practices.Strong hands-on experience in coding on technologies like Java, spring, hibernate or any similar frameworks.Good understanding of UI &amp; UX concepts and coding experience in Angular 2,4,6,7,8,9 or 10.Build workflow and integrations with innovative tools and frameworks such as Docker, Terraform, Spring Boot, Angular, Ansible.", "link": "https://www.linkedin.com/jobs/view/3458389196"},
{"title": "Senior Full Stack Engineer", "location": "Jersey City, NJ", "company_name": "Pinnacle Group, Inc.", "position_name": "Senior Full Stack Engineer", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Engineering and Information Technology", "company_sector": "IT Services and IT Consulting", "description": "Job Title: Senior Full Stack EngineerLocation: Jersey City, NJ OR New York, NY OR Plano, TX OR Chicago, IL 60603 OR Tampa, FL (3 days onsite)Contract: Contract to HireRequired:• Expert in Java, Springboot/ Microservice and AWS design technique as well as experience working across large environments with multiple operating systems or infrastructure for large-scale programs (e.g., Expert Engineers) starting to be firm-wide resources working on projects across client• Is multi-skilled with expertise across software development lifecycle and toolset• May be recognized as a leader in Agile and cultivating teams working in Agile frameworks• Sought out as coach for at least one technical skill• Strong understanding of techniques such as Continuous Integration, Continuous Delivery, Test• Driven Development, Cloud Development, resiliency, security• Stays abreast of cutting edge technologies or trends and uses experience to influence application of those technologies or trends to support the business; may give speeches and outside the firm, writes articles.Pay Range: $62 - $70 W2The specific compensation for this position will be determined by a number of factors, including the scope, complexity and location of the role as well as the cost of labor in the market; the skills, education, training, credentials and experience of the candidate; and other conditions of employment. Our full-time consultants have access to benefits including medical, dental, vision as well as 401K contributions.", "link": "https://www.linkedin.com/jobs/view/3458385570"},
{"title": "Acoustic Machine Learning Engineer", "location": "Santa Clara, CA", "company_name": "MindSource", "position_name": "Acoustic Machine Learning Engineer", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Engineering", "company_sector": "Computers and Electronics Manufacturing", "description": "Role: Acoustic Machine Learning EngineerLocation: Santa Clara Valley, CADuration: 12 monthsContract Type: W2Description:The primary activity of the Acoustic Technologist is to develop signal processing techniques to extract and enhance acoustic signals inside and outside on the audible range. Candidate in this role will be working with various sensor extracted signals to combine information for processing and analysis. Activities will include (but not be limited to) pre-processing, prototyping &amp; evaluation of DSP/acoustic features for signal extraction, algorithm prototyping. You will work with multi-functional teams to optimize and improve algorithms across various sensors and prototypes.In this role you will be able to experiment with sensor fusion methods to design the optimal signal processing chain for maximizing performance.Key Qualifications:Experience working with audio signal processing, signal extraction, time-frequency analysis, and algorithm prototyping/development.Experience working with acoustic feature extraction and machine learning models.Experience working with time series analysis of unstructured data.Good understanding of DSP and filtering techniques. e.g band pass filtering, wavelet transform, FFT analysis etc.Proficiency with acoustic measurements of speakers and microphonesProficiency in Matlab, Python, Max-MSP toolsUnderstanding of physical/room acoustics is a plus.C++ coding skills are a plus.Experience shipping high-complexity, high-volume consumer electronics is desired.Education &amp; Experience: Most of our engineers have advanced degrees in Electrical engineering, Acoustics, Signal Processing, Electronics, or an equivalent field, but if you’ve followed a different path to expertise in acoustics or sound quality, we still want to hear from you.Interested candidates please send your latest resume to sarath@mindsource.com", "link": "https://www.linkedin.com/jobs/view/3452569410"},
{"title": "Software Engineer", "location": "Boston, MA", "company_name": "Insight Global", "position_name": "Software Engineer", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Engineering", "company_sector": "Computer and Network Security", "description": "Summary: As a Software Engineer you will work with R&amp;D teams working on core technologies for VR/AR and the Metaverse, on bringing up data processing pipelines and Computer Vision tools to better measure performance in large-scale and accelerate internal development of new features. Location Services team's north star is to build the accurate and battery efficient positioning platform across FRL devices that provides lat, lon, and altitude prediction anywhere in the world. Our north star serve as the foundation of location-based experiences, especially world AR, for Reality Labs devices. Imagine a user wearing AR glasses walks down the street, we provide position tracking function to enable world locked AR experience. When location based reminder is set (e.g., remind me of my shopping list at the grocery store), we provide geofence function to trigger the callback at the right time &amp; right place. To enable the above functionalities, we build the location prediction model/algorithms using mobile signals (e.g., GPS, WiFi, BLE, accelerometer, barometer, etc) and the infrastructure that enables realtime prediction. In particular, location services team are investing in the following areas: Location SDKs on wearables (e.g., Orion/Milan) to unblock location-based experiences. GeoAnchor APIs in Spark AR platform to enable world AR experiences. Cloud wireless positioning services (WPS) for world-scale FR-based location prediction using signals such as ambient WiFi/cell bluetooth. Minimum qualifications: - BSc in Computer Science, Software Engineering, Electrical Engineering or similar - At least 4 years of experience as SW engineer - 4+ years of experience in iOS or Android Development - Good verbal/written communication skills in english - Team player Must Have Qualifications: - Experience in C++ and Java - Experience with full stack development - Cross-platform (Android and iOS) - Experience with GPS, WiFi, BLE, accelerometer, etc", "link": "https://www.linkedin.com/jobs/view/3453595331"},
{"title": "Associate Software Engineer", "location": "Wilmington, DE", "company_name": "Pinnacle Group, Inc.", "position_name": "Associate Software Engineer", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Engineering and Information Technology", "company_sector": "IT Services and IT Consulting", "description": "Job Title: Associate Software EngineerLocation: Wilmington, DE OR Jersey City, NJ 07310 OR New York, NY OR Chicago, IL OR Plano, Austin, Houston, TX OR Tampa, FL (3 days onsite)Contract: Contract to HireRequired:• Expert in Java, Springboot/ Microservice and AWS design technique as well as experience working across large environments with multiple operating systems or infrastructure for large-scale programs (e.g., Expert Engineers) starting to be firm-wide resources working on projects across client• Is multi-skilled with expertise across software development lifecycle and toolset• May be recognized as a leader in Agile and cultivating teams working in Agile frameworks• Sought out as coach for at least one technical skill• Strong understanding of techniques such as Continuous Integration, Continuous Delivery, Test• Driven Development, Cloud Development, resiliency, security• Stays abreast of cutting edge technologies or trends and uses experience to influence application of those technologies or trends to support the business; may give speeches and outside the firm, writes articles.Pay Range: $42 - $50 W2The specific compensation for this position will be determined by a number of factors, including the scope, complexity and location of the role as well as the cost of labor in the market; the skills, education, training, credentials and experience of the candidate; and other conditions of employment. Our full-time consultants have access to benefits including medical, dental, vision as well as 401K contributions.", "link": "https://www.linkedin.com/jobs/view/3458396046"},
{"title": "Biostatistician", "location": "Conshohocken, PA", "company_name": "Actalent", "position_name": "Biostatistician", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Research, Analyst, and Information Technology", "company_sector": "Business Consulting and Services", "description": "Part time Biostat position with a leading biotech company in Philadelphia suburbs.*Must be open to work normal business hours from 8:30-5pm*This is going to start off as a part time contract for 9 months until studies are closed out and new studies are approved: which there is potential for full time hours. *Description:* Immunocore needs a Biostatistician to support one of their studies over the next 9 months as it winds down.This person will be doing TFL shells, SAP creation and handling the statistical section of protocols.They will also be representing Biostatistics at study team meetings and interacting with clinops drug safety regulatory and programming and data managementSkills:* Biostatistics, Statistics, TFL, SAP, Project management, SAS, R, CDISC Standards, Clinical trialTop Skills Details:* Biostatistics,Statistics,TFL,SAP,Project managementAdditional Skills &amp; Qualifications:* CDISCClinical trials experienceOncologyExperience Level:* Intermediate LevelAbout Actalent:Actalent connects passion with purpose. Our scalable talent solutions and services capabilities drive value and results and provide the expertise to help our customers achieve more. Every day, our experts around the globe are making an impact. We’re supporting critical initiatives in engineering and sciences that advance how companies serve the world. Actalent promotes consultant care and engagement through experiences that enable continuous development. Our people are the difference. Actalent is an operating company of Allegis Group, the global leader in talent solutions. The company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.", "link": "https://www.linkedin.com/jobs/view/3459446414"},
{"title": "Scientist", "location": "Durham, NC", "company_name": "Actalent", "position_name": "Scientist", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Research, Analyst, and Information Technology", "company_sector": "Business Consulting and Services", "description": "Description:* Our client, a biotechnology organization focuses on early cancer detection is focused on developing pioneering technology to detect and identify multipe deadly cancer types early. Through the utilization of next-generation sequencing, population-scale clinical studies, and state-of-the-art computer science and data science to enhance the scientific understanding of cancer biology, and to develop its multi-cancer early detection blood test. They are currently seeing scientist level individuals to assist in the development of the 3rd version of their proprietary assay.Skills:* Molecular biology, automated testing, liquid handling, biology, laboratory, developmentTop Skills Details:* Molecular biology,automated testing,liquid handlingAdditional Skills &amp; Qualifications:* AS or BS, MS, PhD Degree 2 - 5 years of industry experienceMUST HAVE-*High throughput setting utilizing automated liquid handling robots - BioMek, Hamilton, Tecan High attention to detail Critical thinking skills Ability to handle ambiguity Problem solving skillsExperience Level:* Intermediate LevelAbout Actalent:Actalent connects passion with purpose. Our scalable talent solutions and services capabilities drive value and results and provide the expertise to help our customers achieve more. Every day, our experts around the globe are making an impact. We’re supporting critical initiatives in engineering and sciences that advance how companies serve the world. Actalent promotes consultant care and engagement through experiences that enable continuous development. Our people are the difference. Actalent is an operating company of Allegis Group, the global leader in talent solutions. The company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.", "link": "https://www.linkedin.com/jobs/view/3459435563"},
{"title": "Biostatistician", "location": "Conshohocken, PA", "company_name": "Actalent", "position_name": "Biostatistician", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Research, Analyst, and Information Technology", "company_sector": "Business Consulting and Services", "description": "Part Time, 100% REMOTE OPPORTUNITY * *~20-30 hours a week~* Must be eligible to work in the USTypical responsibilities of the Biostatistician include but are not limited to:*Evaluate and compare the operating characteristics of completing clinical study designsWrite statistical sections of study protocolsWrite or oversee the writing of statistical analysis plansDevelop or review shells and programming specifications for TFLsReview CDISC data sets and CDISC data set specificationsOversee or perform ad-hoc and exploratory analyses to support publications and internal decision makingQualifications*Industry KnowledgeThe drug development lifecycle including both early and late stage oncology clinical trialsCDISC standardsExtensive knowledge of Health Authority requirementsProgramming skills in both SAS and RExcellent written and verbal communication skillsA proven ability to solve problems, working independently of others﻿﻿About Actalent:Actalent connects passion with purpose. Our scalable talent solutions and services capabilities drive value and results and provide the expertise to help our customers achieve more. Every day, our experts around the globe are making an impact. We’re supporting critical initiatives in engineering and sciences that advance how companies serve the world. Actalent promotes consultant care and engagement through experiences that enable continuous development. Our people are the difference. Actalent is an operating company of Allegis Group, the global leader in talent solutions. The company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.", "link": "https://www.linkedin.com/jobs/view/3459439762"},
{"title": "Data Engineer", "location": "United States", "company_name": "SoftStandard Solutions", "position_name": "Data Engineer", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Information Technology", "company_sector": "IT Services and IT Consulting", "description": "Big Data Engineer Job DescriptionWe are looking to hire a talented big data engineer to develop and manage our company’s Big Data solutions. In this role, you will be required to design and implement Big Data tools and frameworks, implement ELT processes, collaborate with development teams, build cloud platforms, and maintain the production system.To ensure success as a big data engineer, you should have in-depth knowledge of Hadoop technologies, excellent project management skills, and high-level problem-solving skills. A top-notch Big Data Engineer understands the needs of the company and institutes scalable data solutions for its current and future needs.Big Data Engineer Responsibilities:Meeting with managers to determine the company’s Big Data needs.Developing Hadoop systems.Loading disparate data sets and conducting pre-processing services using Hive or Pig.Finalizing the scope of the system and delivering Big Data solutions.Managing the communications between the internal system and the survey vendor.Collaborating with the software research and development teams.Building cloud platforms for the development of company applications.Maintaining production systems.Training staff on data resource management.Big Data Engineer Requirements:Bachelor’s degree in computer engineering or computer science.Previous experience as a big data engineer.In-depth knowledge of Hadoop, Spark, and similar frameworks.Knowledge of scripting languages including Java, C++, Linux, Ruby, PHP, Python, and R.Knowledge of NoSQL and RDBMS databases including Redis and MongoDB.Familiarity with Mesos, AWS, and Docker tools.Excellent project management skills.Good communication skills.Ability to solve complex networking, data, and software issues.", "link": "https://www.linkedin.com/jobs/view/3454142033"},
{"title": "Scientist - Molecular Biology", "location": "Durham, NC", "company_name": "Actalent", "position_name": "Scientist - Molecular Biology", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Research, Analyst, and Information Technology", "company_sector": "Business Consulting and Services", "description": "Our client, a biotechnology organization focuses on early cancer detection is focused on developing pioneering technology to detect and identify multipe deadly cancer types early. Through the utilization of next-generation sequencing, population-scale clinical studies, and state-of-the-art computer science and data science to enhance the scientific understanding of cancer biology, and to develop its multi-cancer early detection blood test. They are currently seeing scientist level individuals to assist in the development of the 3rd version of their proprietary assay.Skills:*Molecular biologyAutomated testingLiquid handlingBiologyAdditional Skills &amp; Qualifications:*AS or BS, MS, PhD Degree 2 - 5 years of industry experienceHigh throughput setting utilizing automated liquid handling robots - BioMek, Hamilton, TecanHigh attention to detailCritical thinking skillsAbility to handle ambiguityProblem solving skillsExperience Level:* Intermediate LevelAbout Actalent:Actalent connects passion with purpose. Our scalable talent solutions and services capabilities drive value and results and provide the expertise to help our customers achieve more. Every day, our experts around the globe are making an impact. We’re supporting critical initiatives in engineering and sciences that advance how companies serve the world. Actalent promotes consultant care and engagement through experiences that enable continuous development. Our people are the difference. Actalent is an operating company of Allegis Group, the global leader in talent solutions. The company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.", "link": "https://www.linkedin.com/jobs/view/3459444768"},
{"title": "Embedded Engineer", "location": "United States", "company_name": "Net2Source Inc.", "position_name": "Embedded Engineer", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Engineering and Information Technology", "company_sector": "Medical Equipment Manufacturing, Biotechnology Research, and Pharmaceutical Manufacturing", "description": "Position: Engr 3, Software Embedded Location: 100% RemoteDuration: 12+ Months (Extendable) Pay Rate: $63.77/hr on W2.  Must Have requirements:• Significant experience on Embedded Software Design and Development (NOT application software)• Hands on experience developing embedded software in C• Real-Time operating systems (RTOS) such as ThreadX, Free RTOS etc Description:This position is a technical position working in the embedded software/firmware development work streams. The individual would have responsibility for working cross-functionally to understand end-user needs and system requirements and mapping them to detailed embedded software and electrical design specifications and translating these into robust architecture and design elements.The responsibilities can include, but are not limited to: embedded software design &amp; implementation, design for critical features and functions, enabling implementation of features as part of a multi-disciplinary R&amp;D team (systems, electrical, mechanical and application software). Integrating and verifying implemented features through unit and functional testing.Typically, the embedded engineer will interface with other development teams for product integration and will interface both internally and externally to understand the clinical use cases, usability and system requirements. Minimum Qualifications:• Bachelor’s Degree in Electrical Engineering, Physics, Computer Engineering, software engineering or similar.• A minimum of 6 years of post-educational professional experience, with focus on Embedded Software Development, Board design and development.• Hands on experience developing embedded software in C and programming knowledge of Real-Time operating systems such as ThreadX, Micrium etc. is required• Hands on experience developing embedded UI/UX Desired Qualifications:• Master’s Degree in Electrical Engineering, Physics, Computer Engineering,or software engineering.• Experience working with graphical displays• 6+ years of professional experience in the medical device industry.• Experience programming Arm Cortex M4, M7, or similar microcontrollers• Previous experience with medical device embedded software and electrical design efforts.• Experience developing low level device drivers for hardware peripheral interfaces and devices such as SPI, I2C, USB, LCD, ADC, DAC, RFIC• Experience in a structured development environment with source control and bug tracking systems• Knowledgeable in hardware/software interfaces, programming of embedded processor utilizing a Real Time Operating System (RTOS), real-time and post processing data analytics,• Experience with software quality assurance to include unit and integration test development and execution, and code inspection and reviews.• Experience with digital and analog circuits, microprocessor hardware and software and development environments• Experience generating technical documentation and authoring internal/external publications• Experience reading and understanding schematic designs and Electrical components reference manuals• Working knowledge of applicable standards for medical devices: FDA QSR, ISO 13485, ISO 14971, IEC 62304.", "link": "https://www.linkedin.com/jobs/view/3454369920"},
{"title": "DevOps Engineer", "location": "Wilmington, DE", "company_name": "Pinnacle Group, Inc.", "position_name": "DevOps Engineer", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Engineering and Information Technology", "company_sector": "IT Services and IT Consulting", "description": "Job Title: Devops EngineerLocation: Wilmington, DE (3 days onsite)Contract: Contract to HireRequired:Must have worked in AWS infra experienceTools: Use AWS Infrastructure, Terraform, EKS Kubernetes, DynamoDB, Amazon Aurora PostgreSQL, Route 53Top 3 Skill Sets1. Terraform 2. CI/CD Pipelines Infrastructure as a Code3. Upgrading Services and Blue GreenPay Range: $60 - $70 W2The specific compensation for this position will be determined by a number of factors, including the scope, complexity and location of the role as well as the cost of labor in the market; the skills, education, training, credentials and experience of the candidate; and other conditions of employment. Our full-time consultants have access to benefits including medical, dental, vision as well as 401K contributions.", "link": "https://www.linkedin.com/jobs/view/3458405862"},
{"title": "Contract - MES Data Engineer", "location": "Elkhorn City, KY", "company_name": "V-Soft Consulting Group, Inc.", "position_name": "Contract - MES Data Engineer", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Information Technology", "company_sector": "IT Services and IT Consulting", "description": "MES Data EngineerPrimary Location: Kentucky (Remote)V-Soft Consulting is currently hiring for a MES Data Engineer for our premier client in Kentucky (Remote).What You’ll DoJob Responsibilities:Work on the data architecturePerform root cause analysis on internal and external data and processes to answer specific business questions and identify opportunities for improvement.Build data objects for data transformation, data structures, metadata, dependency and workload management.Create, process and extract value from large, disconnected datasets including business systems like PLM, ERP, and MES.Support and work with cross-functional teams in an agile environment.Interested?Qualified candidates should send their resumes to pratima@vsoftconsulting.comV-Soft Consulting Group is recognized among the top 100 fastest growing staffing companies in North America, V-Soft Consulting Group is headquartered in Louisville, KY with strategic locations in India, Canada and the U.S. V-Soft is known as an agile, innovative technology services company holding several awards and distinctions and has a wide variety of partnerships across diverse technology stacks.As a valued V-Soft Consultant, you’re eligible for full benefits (Medical, Dental, Vision), a 401(k) plan, competitive compensation, and more. V-Soft is partnered with numerous Fortune 500 companies, exceptionally positioned to advance your career growth.For more information or to view all our open jobs, please visit www.vsoftconsulting.com or call (844) 425-8425.", "link": "https://www.linkedin.com/jobs/view/3454164722"},
{"title": "Senior Scala Engineer - 12 months remote contract", "location": "Austin, Texas Metropolitan Area", "company_name": "Signify Technology", "position_name": "Senior Scala Engineer - 12 months remote contract", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Engineering and Information Technology", "company_sector": "Staffing and Recruiting", "description": "Senior Scala Engineer - 12 months extendable contract - Fully remoteNOTE: WE CANNOT USE A THIRD PARTY AGENCIES FOR THIS. Wow, what a great opportunity this is! A very long term Scala project here, working for a global specialized manufacturing company who are looking to hire excellent engineers to help build out their platforms and services. A very exciting and new project centred around Scala, Akka (steams, actors), AWS, and large data sets. This would be a position for mid-senior level engineers and/or senior-lead level engineers. There are multiple positions available here!ResponsibilitiesYou will be writing clean and high performing code for services using Scala. You will be responsible for performing all programming responsibilities without being heavily micromanaged. You will drive development activities for business-critical applications and services. You will interact with internal and external users to be able to deliver efficient solutions, as well as make adjustments to existing services to optimize their performance/usage. Above all, you will work in a fun and collaborative working environment.Qualifications3+ years of professional work experience in ScalaExpertise in Akka, Akka Streams, Akka ActorsHeavy experience working with AWS or similar cloud environmentExcellent experience working with large data sets and structures", "link": "https://www.linkedin.com/jobs/view/3455346974"},
{"title": "CAE Engineer L2", "location": "Raymond, OH", "company_name": "Altair", "position_name": "CAE Engineer L2", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Engineering and Information Technology", "company_sector": "Software Development", "description": "Transforming the Future with Convergence of Simulation and Data CAE Engineer L2Job SummaryOur client in Raymond, OH is looking for a CAE Engineer L2. This is a contract position.What You Will DoCandidate will purchase at the most favorable price consistent with quality, quantity, delivery and other factors, raw materials, equipment, machinery, components and supplies for development and business operations.BasicsRequires a BS degree in Business Administration or related degree.Minimum of 5 years experience or equivalent combination of education and experience.Experience with CAD drawings including knowledge of Automotive and Proto-Type parts.Proficient PC Skills (Excel, Word, PowerPoint and other technical software) and excellent communication/interpersonal skills. SAP Experience.How You Will Be Successful Envision the Future  Communicate Honestly and Broadly  Seek Technology and Business “First”  Embrace Diversity and Take Risks What We Offer Competitive Salary  Comprehensive Benefit Package  401(k) with matching contributions  Paid Time Off  Employee Discounts  Free training on all Altair products Why Work With UsAltair is a global technology company providing software and cloud solutions in the areas of data analytics, product development, and high-performance computing (HPC). Altair enables organizations in nearly every industry to compete more effectively in a connected world, while creating a more sustainable future. With more than 3,000 engineers, scientists, and creative thinkers in 25 countries, we help solve our customer’s toughest challenges and deliver unparalleled service, helping the innovators innovate, drive better decisions, and turn today’s problems into tomorrow’s opportunities. Our vision is to transform customer decision making with data analytics, simulation, and high-performance computing. For more than 30 years, we have been helping our customers integrate electronics and controls with mechanical design to expand product value, develop AI, simulation and data-driven digital twins to drive better decisions, and deliver advanced HPC and cloud solutions to support unlimited idea exploration. To learn more, please visit altair.com Ready to go? #ONLYFORWARD At our core we are explorers; adventures; pioneers. We are the brains behind some of the world’s most revolutionary innovations and are not only comfortable in new and unchartered waters, we dive headfirst. We are the original trailblazers that make the impossible possible, discovering new solutions to our customer’s toughest challenges.Altair is an equal opportunity employer. Our backgrounds are diverse, and every member of our global team is critical to our success. Altair’s history demonstrations a belief that empowering each individual authentic voice reinforces a culture that thrives because of the uniqueness among our team.", "link": "https://www.linkedin.com/jobs/view/3454054544"},
{"title": "Senior Java developer", "location": "New York, United States", "company_name": "RIIM", "position_name": "Senior Java developer", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Engineering and Information Technology", "company_sector": "IT Services and IT Consulting, Banking, and Financial Services", "description": "We have a requirement of Java Developer with extensive experience in Core Java, Microservices design patterns, Spring boot, messaging technologies and AWS /PCF. Must have 10+ years of experience in Java technologies.", "link": "https://www.linkedin.com/jobs/view/3459442456"},
{"title": "Ab Initio Developer", "location": "Little Rock, AR", "company_name": "Amtex Systems Inc.", "position_name": "Ab Initio Developer", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Engineering and Information Technology", "company_sector": "IT Services and IT Consulting", "description": "Title: Ab Initio DeveloperLocation: Little Rock, ARDuration: 12+ MonthsDuties: Job Summary Developer is responsible for developing, documenting, educating and articulating complex business requirements to support enterprise information initiatives, ranging from vision to implementation, strategy, development and tactical execution of objectives. Incumbent will contribute expertise in system analysis, design, coding, testing, debugging and documents the development of all lifecycle phases. Principal Responsibilities • Contributes to and supports the Enterprise strategic and operational planning process including total quality management philosophies. • Develops and implements processes to ensure accurate and effective workflow distribution. • Provides technical expertise of subsystems and any other performance related systems. • Enhances and applies programming analysis, design, coding, testing, debugging, implementation and documentation. • Consults with users to identify current operating procedures and to clarify project objectives. • Uses standard application design principles to create logical and physical application designs to promote efficiency and code reuse. • Develops applications and creates deliverables aligned with processes and enterprise standards. • Designs and develops high-volume, low-latency applications for mission-critical systems and delivers high-availability and performance applications. • Designs, testable code and develops test protocols or plans and reviews revisions and results.Skills: Education &amp; Experience: • Bachelor’s degree, in Business, Computer Science, or Management Information Systems, or related. In lieu of degree, at least five (5) years’ equivalent experience. • Three (3) years’ direct experience serving source systems and project teams for developing, documenting, educating and articulating complex business requirements to support strategic and tactical business needs. • Knowledge and experience with data gathering, program logic development, coding, testing and documentation, and Application Systems Programming Design and Analysis. Specialized Knowledge &amp; Skills: Technical skill set and working experience in Ab Initio, DB2, Unix, Snowflake, Azure, AWS services (ADLS, ADF/Data Bricks, etc..), Python, Java. Healthcare Domain knowledge and working experience is **preferred**Education: Bachelor’s degree, in Business, Computer Science, or Management Information Systems, or related.", "link": "https://www.linkedin.com/jobs/view/3456971529"},
{"title": "React Native full stack developer", "location": "United States", "company_name": "TA Digital", "position_name": "React Native full stack developer", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Engineering and Information Technology", "company_sector": "IT Services and IT Consulting", "description": "Role: React native full stack Developer Location: REMOTEExperience- 6 to 12 yearsDescription:Bachelor's degree in Computer Science or related field The Full Stack Developer codes software applications based on business requirements. Work assignments will involve moderately complex to complex issues where the analysis of situations or data requires an in-depth evaluation of variable factors. The Full Stack Developer will develop fully fledged platforms which do not need other applications to function.  Job Description We are looking for a Full Stack Developer to produce scalable software solutions. You’ll be part of a cross-functional team that’s responsible for the full software development life cycle, from conception to deployment. As a Full Stack Developer, you should be comfortable around both front-end and back-end coding languages, development frameworks and third-party libraries. You should also be a team player with a knack for visual design and utility.  • Work with development teams and product managers to ideate software solutions • Build the front-end of applications through appealing visual design • Write effective APIs • Test software to ensure responsiveness and efficiency • Troubleshoot, debug and upgrade software • Create security and data protection settings • Build features and applications with a mobile responsive design • Write technical documentation • Work in a Scrum/Agile type environment and deliver upon assigned work in a timely manner over the course of an iterative project time-table. • Be available for execution or support of production turns. • Provide expertise to influence project, initiative, and maintenance technical direction during discovery, planning, and implementation stages. • Maintain modern development standards with best-practice approaches and development processes.  Requirements • HTML, CSS, JavaScript, jQuery • C#, .NET (Required) • Angular, React or Vue.js with Cloud experience • React native(Required)• Typescript (Required) • NPM/Node.js (Advanced) • SASS • W3C Web Standards • Accessibility • Web performance • Cross-browser compatibility • Content Management • Advanced understanding of modular design patterns • Content Management (advanced experience and best-practices) • Technical writing/communication skills • Unit and Experience Testing (Advanced) • Webpack (Advanced)", "link": "https://www.linkedin.com/jobs/view/3458430191"},
{"title": "Scientist", "location": "Durham, NC", "company_name": "Actalent", "position_name": "Scientist", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Research, Analyst, and Information Technology", "company_sector": "Business Consulting and Services", "description": "Description:* Our client, a biotechnology organization focuses on early cancer detection is focused on developing pioneering technology to detect and identify multipe deadly cancer types early. Through the utilization of next-generation sequencing, population-scale clinical studies, and state-of-the-art computer science and data science to enhance the scientific understanding of cancer biology, and to develop its multi-cancer early detection blood test. They are currently seeing scientist level individuals to assist in the development of the 3rd version of their proprietary assay. *Skills:* Molecular biology Automated testing Liquid handling *Additional Skills &amp; Qualifications:* AS or BS, MS, PhD Degree in a Scientific Field 2 - 5 years of industry experience High throughput setting utilizing automated liquid handling robots - BioMek, Hamilton, Tecan High attention to detail Critical thinking skills Ability to handle ambiguity Problem solving skillsAbout Actalent:Actalent connects passion with purpose. Our scalable talent solutions and services capabilities drive value and results and provide the expertise to help our customers achieve more. Every day, our experts around the globe are making an impact. We’re supporting critical initiatives in engineering and sciences that advance how companies serve the world. Actalent promotes consultant care and engagement through experiences that enable continuous development. Our people are the difference. Actalent is an operating company of Allegis Group, the global leader in talent solutions. The company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.", "link": "https://www.linkedin.com/jobs/view/3459434548"},
{"title": "Denodo Developer- Remote", "location": "United States", "company_name": "System Soft Technologies", "position_name": "Denodo Developer- Remote", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Human Resources", "company_sector": "IT Services and IT Consulting", "description": "100 % Remote Strong Denodo development. Some admin would be a plus, Prefer GraphQL, API experience, Cloud (GCP), Java, Springboot, SQL and Views. Act as Denodo SME when neededAnalyzing the existing API, business logic, decode SQL/Views, identify database, tables and fields, Request and Response attributes.Build and develop the future state of API’s to consume the data from Cloud GCP.", "link": "https://www.linkedin.com/jobs/view/3454826185"},
{"title": "Scientist", "location": "Durham, NC", "company_name": "Actalent", "position_name": "Scientist", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Research, Analyst, and Information Technology", "company_sector": "Business Consulting and Services", "description": "Our client, a biotechnology organization focuses on early cancer detection is focused on developing pioneering technology to detect and identify multipe deadly cancer types early. Through the utilization of next-generation sequencing, population-scale clinical studies, and state-of-the-art computer science and data science to enhance the scientific understanding of cancer biology, and to develop its multi-cancer early detection blood test. They are currently seeing scientist level individuals to assist in the development of the 3rd version of their proprietary assay.Skills:*Molecular biologyAutomated testingLiquid handlingBiologyAdditional Skills &amp; Qualifications:*AS or BS, MS, PhD Degree 2 - 5 years of industry experienceHigh throughput setting utilizing automated liquid handling robots - BioMek, Hamilton, TecanHigh attention to detailCritical thinking skillsAbility to handle ambiguityProblem solving skillsExperience Level:* Intermediate LevelAbout Actalent:Actalent connects passion with purpose. Our scalable talent solutions and services capabilities drive value and results and provide the expertise to help our customers achieve more. Every day, our experts around the globe are making an impact. We’re supporting critical initiatives in engineering and sciences that advance how companies serve the world. Actalent promotes consultant care and engagement through experiences that enable continuous development. Our people are the difference. Actalent is an operating company of Allegis Group, the global leader in talent solutions. The company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.", "link": "https://www.linkedin.com/jobs/view/3459430726"},
{"title": "Senior Java Developer - Remote | WFH", "location": "Washington, DC", "company_name": "Get It Recruit - Information Technology", "position_name": "Senior Java Developer - Remote | WFH", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Engineering and Information Technology", "company_sector": "Human Resources Services", "description": "We're on the hunt for a top-notch Software Developer to join our team! In this hands-on role, you'll have the opportunity to work collaboratively to design, build, and enhance highly available, scalable, real-time systems. You'll be responsible for making recommendations on the best designs based on customer business objectives, timelines, and other resource constraints.As a software developer, you'll be participating in and/or directing major deliverables of projects through all aspects of the software development life cycle, including scope and work estimation, architecture and design, coding, and unit testing.To Excel In This Role, You'll NeedA BS degree and 10 years of prior relevant experience or Master’s with 8 years of prior relevant experience.Proficiency and knowledge of Oracle, Weblogic, SQL, MyBATIS, IBM MQ, MySQL, Spring MVC, Salesforce, Struts, Hibernate, Java, JSF, Swing, JavaScript, Bootstrap, Angular.Knowledge of software design patterns.Experience with an issue/problem tracking system (e.g., Jira)Proficiency with MS Office Products (Word, Excel, Visio, &amp; PowerPoint).Proficiency with common Agile practices, service-oriented environments, and better development practicesExcellent written and verbal communication skillsExperience with DevOps frameworksMust be a U.S. Citizen and able to obtain a Public Trust clearance.If you have experience with AWS, Legacy to cloud migration, CI/CD, SecDevOps, active CBP Full Background Investigation (FULL BI) or DOD Top Secret or DHS Public Trust clearance and experience with CBP, you'll be highly desirable.This is a full-time contract role with a pay range of $70.00 - $75.00 per hour. We're open to remote work, but local candidates in the DC Metro area will be preferred.If you're ready to take your career to the next level and be a part of a dynamic and innovative team, we want to hear from you. Apply today and let's see if we're a match!", "link": "https://www.linkedin.com/jobs/view/3454164524"},
{"title": "Research Associate/Associate Scientist, Chemistry", "location": "Redwood City, CA", "company_name": "Actalent", "position_name": "Research Associate/Associate Scientist, Chemistry", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Research, Analyst, and Information Technology", "company_sector": "Business Consulting and Services", "description": "Description:* Our client is a clinical-stage precision oncology company focused on developing novel targeted therapies to inhibit high-value frontier targets in RAS-addicted cancers. The company’s R&amp;D pipeline comprises RAS(ON) Inhibitors designed to suppress diverse oncogenic variants of RAS proteins, and RAS Companion Inhibitors for use in combination treatment strategies. As a new member of the team, you will join other outstanding scientists in a tireless commitment to patients with cancers harboring mutations in the RAS signaling pathway.The Opportunity:* As a key member of the Medicinal Chemistry team, you will be part of an integrated, multidisciplinary research team making significant contributions toward the discovery of important new drug candidates. Your responsibilities will include:Synthesizing biologically active compounds, including the design and execution of the synthetic routes, purification of final targets, and participating in analog design.Plan and execute assigned experiments to support research activities and project goals.Recommend alternatives, research new methods and techniques through literature search and proactively seek out others to identify solutions to challenges.Present research findings to the Medicinal Chemistry team and management.Partner in the scientific activities of other outstanding medicinal chemists, including Ph.D. scientists, and create an environment where all ideas are heard.Uphold the core values at Revolution Medicines: i) tireless commitment to patients; ii) transformative science; iii) exceptional together; iv) total integrity; and v) inclusiveness and fairness.Skills Required:* Chemistry, medicinal chemistry, synthesis, HPLC, NMR, nmr spectroscopy, natural product synthesis, discovery chemistry, mass spectrometryAdditional Skills &amp; Qualifications:* Required Experience, Skills, and Education:B.S. degree in Chemistry with 1+ years of research experience in, or an M.S. in Chemistry with a focus on organic synthesis and/or methodology development.Strong mechanistic understanding of organic chemistry is highly preferred.Experience with chemistry search engines (i.e. SciFinder and Reaxyx) to design and plan synthetic routes is preferred but not a must.High attention to details, especially in NMR, HPLC, mass spectrometry techniques, is preferred.Experience with synthetic methodologies to design, execute synthetic procedures, and troubleshoot reactionsStrong written and verbal communication skills to work with interdepartmental teams.Ability to multi-task, be efficient and well-organized, and work collaboratively as a team player with passion for science.Adaptive to a fast-paced interdisciplinary environment with a strong desire to further develop synthetic and medicinal chemistry skills.About Actalent:Actalent connects passion with purpose. Our scalable talent solutions and services capabilities drive value and results and provide the expertise to help our customers achieve more. Every day, our experts around the globe are making an impact. We’re supporting critical initiatives in engineering and sciences that advance how companies serve the world. Actalent promotes consultant care and engagement through experiences that enable continuous development. Our people are the difference. Actalent is an operating company of Allegis Group, the global leader in talent solutions. The company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.", "link": "https://www.linkedin.com/jobs/view/3459440981"},
{"title": "Full Stack Developer", "location": "United States", "company_name": "Apex Systems", "position_name": "Full Stack Developer", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Information Technology, Engineering, and Project Management", "company_sector": "IT Services and IT Consulting, Retail, and Pharmaceutical Manufacturing", "description": "*This role is can NOT provide sponsorship or visa transfer at this time. You must be able to sit on a W-2.*Job DetailsFull Remote6 months contract to hire Pay range $65-$75 hourly Pharmaceutical and convenience industry Technical requirements:· 8+ years of overall IT experience· 2+ years of experience in one or more Typescript frontend frameworks (Angular 8+, React, etc.) - AngularJS experience is not counted· 4+ years of experience implementing REST services, ideally implemented with Java 11+ and SpringBoot· Some experience in deploying to a cloud platform (Kubernetes, PCF, GCP, Azure, AWS, etc.)· Some experience with TDD, in both frontend and backend technologies· Good written and verbal communication skills· Some experience with agile methodology and pair programming (XP, Scrum, etc.) - candidate must be willing to pair program· Familiar with CI/CD tools (e.g. Jenkins)· Familiar with maintaining and interacting with databases (Oracle, PostGres, etc.)· Capacity to lead a feature track· Familiar with software release management tools (Pivotal Tracker, JIRA, Rally, etc.)· Capability to mentor junior and mid-level engineer resources", "link": "https://www.linkedin.com/jobs/view/3453571351"},
{"title": "Informatica Developer", "location": "Charlotte Metro", "company_name": "Strategic Staffing Solutions", "position_name": "Informatica Developer", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Information Technology", "company_sector": "IT Services and IT Consulting and Retail", "description": "STRATEGIC STAFFING SOLUTIONS HAS AN OPENING!Strategic Staffing Solutions (S3) is currently looking for an Informatica Developer for a contract opening with one of our largest clients.Location: Charlotte, NC (On-Site or Fully Remote)Duration: 6+ MonthsRate: $60-65/hrTop Skills:TalendInformaticaHadoopMinimum Qualifications:Bachelor's Degree in Computer Science, CIS, or related field (or equivalent work experience in a related field) \\2 years of experience in software development or a related field2 years of experience in database technologies 1 year of experience working on project(s) involving the implementation of solutions applying development life cycles (SDLC)The S3 Difference:The global mission of S3 is to build trusting relationships and deliver solutions that positively impact our customers, our consultants, and our communities. The four pillars of our company are to:Set the bar high for what a company should doCreate jobsOffer people an opportunity to succeed and change their station in lifeImprove the communities where we live and work through volunteering and charitable giving As an S3 employee, you’re eligible for a full benefits package that may include:Medical InsuranceDental InsuranceVision Insurance401(k) PlanVacation PackageLife &amp; Disability Insurance PlansFlexible Spending AccountsTuition Reimbursement", "link": "https://www.linkedin.com/jobs/view/3459167142"},
{"title": "Remote AI User Experience Researcher", "location": "Bellevue, WA", "company_name": "Aston Carter", "position_name": "Remote AI User Experience Researcher", "experience_required": "Mid-Senior level", "contract_type": "Contract", "function_name": "Design", "company_sector": "Staffing and Recruiting", "description": "Description:* We are looking for a sharp, detail-orientated individual who can conduct product design research with demonstrated experience with a wide variety of design research methodologies within our User Experience Researcher role! You will perform a variety of research methodical functions to support the AI Experience Team by conducting research to build meaningful and trustworthy intelligent experiences at an enterprise level.This role is 100% remote, supporting core AI Teams within Redmond, WA.* In this role, you will conduct innovative, generative, and evaluative research to assist in product design and to better understand user experiences. As the User Experience Researcher; you will: *Drive, conduct, and collaborate on user research:*The primary focus is to gain a better understanding of the needs and desires of target usersYou will target key users, map out user flows, create user journeys, validate the concept and design ideologies, and ultimately drive and synthesize insights that will facilitate the design and development of intelligent features and capabilities. *Document and present insights and recommendations to stakeholders:*You will help sculpt the intricacies of the AI Experience Team by providing calibrated user feedback based on research and analysis. *Work closely and collaborative with cross-functioning teams:*This role is wedged in-between tightly knitted teams. You will work closely and collaborative with designers, researchers, and content strategists - as well as project managers, data scientists, and engineering partners to ship product experiences that delight target users towards a better, more responsible AI experience.Interview Process:* The interview is divided into 2 parts, with an additional 3rd based on the need of additional screening. The first is a standard interview with upper members of leadership. The second will be a one-on-one interview with the main hiring manager. The second part is a standard 1-hour behavioral interview with the hiring manager.Key Responsibilities:*Conducting product design research including but not limited to: usability studies, field studies, in-depth interviews, heuristic evaluations, concept validation, user journey maps, competitive reviews, and interview/surveys.Required Skills/Qualifications:* *4+ years* of professional experience with a mix of *conducting product design research with usability studies, field studies, in-depth interviews, heuristic evaluations, concept validation, user journey maps, competitive reviews, and surveys* *4+ years* of Quantitative Research experience *4+ years* of Qualitative Research experience *2+ years *within a held leadership position *BA/BS degree* in Experimental Psychology, Cognitive Psychology, Human Factors, Human-Computer Interaction or a related fieldNice-to-have Skills/Qualifications:* *5+ years* of professional experience with a mix of *conducting product design research with usability studies, field studies, in-depth interviews, heuristic evaluations, concept validation, user journey maps, competitive reviews, and surveys* *5+ years* of Quantitative Research experience *5+ years* of Qualitative Research experience *3+ years *within a held Project Management position *MS/MA degree* in Experimental Psychology, Cognitive Psychology, Human Factors, Human-Computer Interaction or a related field // We reserve the right to pay above or below the posted wage based on factors unrelated to sex, race, or any other protected classification.Eligibility requirements apply to some benefits and may depend on your job classification and length of employment. Benefits are subject to change and may be subject to specific elections, plan, or program terms. This temporary role may be eligible for the following:Medical, dental &amp; vision401(k)/RothInsurance (Basic/Supplemental Life &amp;AD&amp;D)Short and long-term disabilityHealth and Dependent Care Spending Accounts (HAS * &amp; DCFSA)Transportation benefitsEmployee Assistance ProgramTime off/Leave (PTO, Vacation, or Sick Leave)About Aston Carter:Please Note: Scammers are posing as Aston Carter. We'll never contact you via Gmail, Telegram, or WhatsApp and we'll never solicit money from you.At Aston Carter, we’re dedicated to expanding career opportunities for the skilled professionals who power our business. Our success is driven by the talented, motivated people who join our team across a range of positions – from recruiting, sales and delivery to corporate roles. As part of our team, employees have the opportunity for long-term career success, where hard work is rewarded and the potential for growth is limitless. Established in 1997, Aston Carter is a leading staffing and consulting firm, providing high-caliber talent and premium services to more than 7,000 companies across North America. Spanning four continents and more than 200 offices, we extend our clients’ capabilities by seeking solvers and delivering solutions to address today’s workforce challenges. For organizations looking for innovative solutions shaped by critical-thinking professionals, visit [AstonCarter.com.](AstonCarter.com) Aston Carter is a company within Allegis Group, a global leader in talent solutions. The company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law. If you would like to request a reasonable accommodation, such as the modification or adjustment of the job application process or interviewing process due to a disability, please call 888-237-6835 or email [astoncarteraccommodation@astoncarter.com](mailto:%20astoncarteraccommodation@astoncarter.com) for other accommodation options. However, if you have questions about this position, please contact the Recruiter located at the bottom of the job posting. The Recruiter is the sole point of contact for questions about this position.", "link": "https://www.linkedin.com/jobs/view/3459433698"}
]